{"ANL_ANALYSIS_BATCH": {"Column Name": {"0": "BATCH_ID", "1": "ACTIVE_IND", "2": "BATCH_DESC", "3": "BATCH_NAME", "4": "BATCH_REF_NUM", "5": "CREATE_DATE", "6": "EFFECTIVE_DATE", "7": "EXPIRY_DATE", "8": "PPDM_GUID", "9": "REMARK", "10": "SAMPLE_COUNT", "11": "SOURCE", "12": "STANDARD_SAMPLE_COUNT", "13": "ROW_CHANGED_BY", "14": "ROW_CHANGED_DATE", "15": "ROW_CREATED_BY", "16": "ROW_CREATED_DATE", "17": "ROW_EFFECTIVE_DATE", "18": "ROW_EXPIRY_DATE", "19": "ROW_QUALITY"}, "Null": {"0": "N", "1": "Y", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "DATE", "6": "DATE", "7": "DATE", "8": "VARCHAR2", "9": "VARCHAR2", "10": "NUMBER", "11": "VARCHAR2", "12": "NUMBER", "13": "VARCHAR2", "14": "DATE", "15": "VARCHAR2", "16": "DATE", "17": "DATE", "18": "DATE", "19": "VARCHAR2"}, "Length": {"0": "40", "1": "1", "2": "240", "3": "255", "4": "30", "5": "DATE", "6": "DATE", "7": "DATE", "8": "38", "9": "2000", "10": "10", "11": "40", "12": "10", "13": "30", "14": "DATE", "15": "30", "16": "DATE", "17": "DATE", "18": "DATE", "19": 40}, "Key": {"0": "P", "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN}, "Ref Table(s)": {"0": NaN, "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": "R_SOURCE", "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "BATCH IDENTIFIER: Unique identifer for the batch or collection of samples that are\rrun through an analysis at the same time for comparitive purposes.", "1": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "2": "BATCH DESCRIPTION: Narrative comments about the batch that was created.", "3": "BATCH NAME: Common name given to the batch.", "4": "BATCH REFERENCE NUMBER: A reference number assigned to a batch or\rcollection of samples that are run through an analysis at the same time for\rcomparative pruposes. If equipment has been tampered with, or something bad has\rhappened (e.g. powerorwateroutage), you would be able to find everything in the\rsame batch.", "5": "BATCH CREATE DATE: The date on which this batch was created for inclusion in an\ranalysis run.", "6": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "7": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "8": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "9": "REMARK: Narrative remarks about this row of data.", "10": "SAMPLE COUNT: The number of samples that are included in this batch. Can be\rcalculated by adding the number of rows in SAMPLE ANALYSIS SAMPLE, if this\rinformation is available. This number should include any standard samples that are\rincludedin the batch.", "11": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "12": "STANDARD SAMPLE COUNT: The number of standard samples that are included in\rthe batch. Descriptions of standard samples are contained in the SAMPLE family of\rtables. Standard samples are used to help identify or quantify certain components of\rsamples.", "13": "ROW CHANGED BY: Application login id of the user who last changed the row.", "14": "ROW CHANGED DATE: System date of the last time the row was changed.", "15": "ROW CREATED BY: System user who created this row of data.", "16": "ROW CREATED DATE: Date that the row was created on.", "17": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "18": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "19": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}