{"ANL_ACCURACY": {"Column Name": {"0": "ANALYSIS_ID", "1": "ANL_SOURCE", "2": "ACCURACY_OBS_NO", "3": "ACCURACY_DESC", "4": "ACCURACY_TYPE", "5": "ACTIVE_IND", "6": "CALCULATED_IND", "7": "CALCULATE_METHOD_ID", "8": "CONFIDENCE_TYPE", "9": "EFFECTIVE_DATE", "10": "EXPIRY_DATE", "11": "MEASURED_VALUE_IND", "12": "PPDM_GUID", "13": "RAW_VALUE_IND", "14": "REFERENCED_COLUMN_NAME", "15": "REFERENCED_PPDM_GUID", "16": "REFERENCED_SYSTEM_ID", "17": "REFERENCED_TABLE_NAME", "18": "REMARK", "19": "REPEATABILITY_TYPE", "20": "REPORTED_IND", "21": "SOURCE", "22": "STEP_SEQ_NO", "23": "ROW_CHANGED_BY", "24": "ROW_CHANGED_DATE", "25": "ROW_CREATED_BY", "26": "ROW_CREATED_DATE", "27": "ROW_EFFECTIVE_DATE", "28": "ROW_EXPIRY_DATE", "29": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "NUMBER", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "VARCHAR2", "7": "VARCHAR2", "8": "VARCHAR2", "9": "DATE", "10": "DATE", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "VARCHAR2", "19": "VARCHAR2", "20": "VARCHAR2", "21": "VARCHAR2", "22": "NUMBER", "23": "VARCHAR2", "24": "DATE", "25": "VARCHAR2", "26": "DATE", "27": "DATE", "28": "DATE", "29": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "8", "3": "240", "4": "40", "5": "1", "6": "1", "7": "40", "8": "40", "9": "DATE", "10": "DATE", "11": "1", "12": "38", "13": "1", "14": "30", "15": "38", "16": "40", "17": "30", "18": "2000", "19": "40", "20": "1", "21": "40", "22": "8", "23": "30", "24": "DATE", "25": "30", "26": "DATE", "27": "DATE", "28": "DATE", "29": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN}, "Ref Table(s)": {"0": "ANL_ANALYSIS_REPORT\rANL_ANALYSIS_STEP", "1": "ANL_ANALYSIS_REPORT\rANL_ANALYSIS_STEP", "2": NaN, "3": NaN, "4": "R_ANL_ACCURACY_TYPE", "5": NaN, "6": NaN, "7": "ANL_CALC_METHOD", "8": "R_ANL_CONFIDENCE_TYPE", "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": "PPDM_COLUMN", "15": NaN, "16": "PPDM_TABLE\rPPDM_COLUMN", "17": "PPDM_TABLE\rPPDM_COLUMN", "18": NaN, "19": "R_ANL_REPEATABILITY", "20": NaN, "21": "R_SOURCE", "22": "ANL_ANALYSIS_STEP", "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "ANALYSIS IDENTIFIER: Unique identifier for a sample analysis. Various types of\ranalysis may be conducted on a sample. Samples may be derived from lithologic\rcuttings, fluid collection etc.", "1": "ANALYSIS SOURCE: The source that the analysis came from, this could be a lab\rtechnician, a lab, a company, a government agency, etc.", "2": "ACCURACY OBSERVATION NUMBER: Unique identifier for the accuracy\robservation for this study or step.", "3": "ACCURACY DESCRIPTION: Narrative remarks about the accuracy or\rtrustworthiness of a study, a step in a study or a specific result of a study. To indicate\rwhich specific result you are referring to, use the SYSTEM, TABLE, COLUMN and\rREFERENCED PPDM GUID.", "4": "ANALYSIS ACCURACY TYPE: The kind of accuracy that is indicated, such as the\raccuracy of transcription from paper or spreadsheet into the database, or the\raccuracy of the readings that a piece of equipment can make, or the impact of a\rcontaminant intothe sample that may render results inaccurate.", "5": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "6": "CALCULATED INDICATOR: A Y/N flag indicating that this value is calculated (as\ropposed to measured).", "7": "CALCULATION METHOD IDENTIFIER: Unique identifier for the method or formula\rused to create a calculated or derived value.", "8": "REFERENCE ANALYSIS CONFIDENCE TYPE: The level of confidence or certainty\rfor an analysis value. Various systems for measurement are defined in literature, and\rmay be text based (CERTAIN, PROBABLE, UNCERTAIN) or number based. This\rvalue tends to be subjective, and indicates the level of trust the analyst has in the\rresult.", "9": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "10": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "11": "MEASURED INDICATOR: A Y/N flag indicating that this value was measured, rather\rthan calculated or reported.", "12": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "13": "RAW VALUE INDICATOR: A Y/N flag indicating that this value is a raw value (as\ropposed to a calculated value).", "14": "PPDM COLUMN NAME: The name of a column that has an association with this\rlevel of classification system. This may be used in conjunction with an appropriate\rforeign key from the column that is referenced, or may be used generically in\rcombination with the PPDM_REFERENCED_GUID, which points to the row in the\rcolumn that is related to the classification system level. In this case, it is essential\rthat the PPDM GUID in the source table be managed carefully and appropriately.", "15": "PPDM REFERENCED GUID: The GUID in the table that has an association with this\rlevel of a classification system. In this case, we recommend that the name of the\rtable also be captured in PPDM TABLE, to make querying this information easier.\rUsually, the PP", "16": "SYSTEM IDENTIFIER: A unique identifier for a data storage system, such as a\rdatabase or XML schema.", "17": "PPDM TABLE NAME: The name of a table that has an association with this level of a\rclassification system. This may be used in conjunction with an appropriate foreign\rkey from the table that is referenced, or may be used generically in combination with\rthe", "18": "REMARK: Narrative remarks relating to this row of data.", "19": "REFERENCE ANALYSIS REPEATABILITY TYPE: The level of repeatability for a\rstudy result. Indicates how consistently the same or a similar result will be obtained\rwhen a step is repeated. A result may be highly repeatable, but still incorrect or\rnottrustworthy. For example a sample contaminant may affect your trust in the data,\reven though you get the same (incorrect) answer again and again. Equipment\rcapabilities may also result in a highly repeatable but inaccurate result.", "20": "REPORTED INDICATOR: A Y/N flag indicating that this value is provided as reported\rby the source, usually a laboratory. This indicates that the value was not created or\rmodified upon load into PPDM, even though the value may not be correct. If\rproblems are suspected, set PROBLEM_IND to Y, and for more details about what\rproblems may exist, refer to the ANL_PROBLEM table.", "21": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "22": "STEP SEQUENCE NUMBER: A unique number indicating the sequence of the step\ramong other steps in the preparation and processing of the sample.", "23": "ROW CHANGED BY: Application login id of the user who last changed the row.", "24": "ROW CHANGED DATE: System date of the last time the row was changed.", "25": "ROW CREATED BY: System user who created this row of data.", "26": "ROW CREATED DATE: Date that the row was created on.", "27": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "28": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "29": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}