{"ANL_REMARK": {"Column Name": {"0": "ANALYSIS_ID", "1": "ANL_SOURCE", "2": "REMARK_SEQ_NO", "3": "ACTIVE_IND", "4": "EFFECTIVE_DATE", "5": "EXPIRY_DATE", "6": "PPDM_GUID", "7": "REFERENCED_COLUMN_NAME", "8": "REFERENCED_PPDM_GUID", "9": "REFERENCED_SYSTEM_ID", "10": "REFERENCED_TABLE_NAME", "11": "REMARK", "12": "REMARK_BA_ID", "13": "REMARK_TYPE", "14": "SOURCE", "15": "STEP_SEQ_NO", "16": "ROW_CHANGED_BY", "17": "ROW_CHANGED_DATE", "18": "ROW_CREATED_BY", "19": "ROW_CREATED_DATE", "20": "ROW_EFFECTIVE_DATE", "21": "ROW_EXPIRY_DATE", "22": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "NUMBER", "3": "VARCHAR2", "4": "DATE", "5": "DATE", "6": "VARCHAR2", "7": "VARCHAR2", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "NUMBER", "16": "VARCHAR2", "17": "DATE", "18": "VARCHAR2", "19": "DATE", "20": "DATE", "21": "DATE", "22": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "8", "3": "1", "4": "DATE", "5": "DATE", "6": "38", "7": "30", "8": "38", "9": "40", "10": "30", "11": "2000", "12": "40", "13": "40", "14": "40", "15": "8", "16": "30", "17": "DATE", "18": "30", "19": "DATE", "20": "DATE", "21": "DATE", "22": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN}, "Ref Table(s)": {"0": "ANL_ANALYSIS_STEP\rANL_ANALYSIS_REPORT", "1": "ANL_ANALYSIS_REPORT\rANL_ANALYSIS_STEP", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": "PPDM_COLUMN", "8": NaN, "9": "PPDM_TABLE\rPPDM_COLUMN", "10": "PPDM_TABLE\rPPDM_COLUMN", "11": NaN, "12": "BUSINESS_ASSOCIATE", "13": "R_ANL_REMARK_TYPE", "14": "R_SOURCE", "15": "ANL_ANALYSIS_STEP", "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "ANALYSIS IDENTIFIER: Unique identifier for a sample analysis. Various types of\ranalysis may be conducted on a sample. Samples may be derived from lithologic\rcuttings, fluid collection etc.", "1": "ANALYSIS SOURCE: The source that the analysis came from, this could be a lab\rtechnician, a lab, a company, a government agency, etc.", "2": "REMARK SEQUENCE NUMBER: A unique number that can keep track of the\rremarks made in the analysis. This can help to keep track of the events that occurred\rand what was said about them.", "3": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "4": "EFFECTIVE DATE: The date that the data in this row first comes into effect.", "5": "EXPIRY DATE: The date that the data in this row is no longer active or in effect.", "6": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "7": "PPDM COLUMN NAME: The name of a column that has an association with this\rlevel of classification system.", "8": "PPDM GUID: This value may be used to provide a global unique identifier for this row\rof data. If used, optional PPDM NOT NULL constraints should be created.", "9": "SYSTEM IDENTIFIER: A unique identifier for a data storage system, such as a\rdatabase or XML schema.", "10": "PPDM TABLE NAME: The name of a table that has an association with this level of a\rclassification system. This may be used in conjunction with an appropriate foreign\rkey from the table that is referenced, or may be used generically in combination with\rthe", "11": "REMARK: Narrative remarks about this row of data.", "12": "REMARK BUSINESS ASSOCIATE: the business associate to whom the remark is\rattributed.", "13": "REMARK TYPE: The type of remark that may be made regarding the analysis. This\rmay be a very generic remark such as the outcome of the sample analysis or any\rproblems that may have arisen to any equipment during the sample analysis, etc.", "14": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "15": "STEP SEQUENCE NUMBER: A unique number indicating the sequence of the step\ramong other steps in the preparation and processing of the sample. This column is a\rsufficient method to keep track of what is done in the sample analysis. However, if\rthe requirement for more complicated tracking such as two steps occurring\rsimultaneously or if steps are needed to be added to the initial procedure, use the\rtwo columns STEP_SEQ_NO1 and STEP_SEQ_NO2 in the table\rANL_STEP_XREF.", "16": "ROW CHANGED BY: Application login id of the user who last changed the row.", "17": "ROW CHANGED DATE: System date of the last time the row was changed.", "18": "ROW CREATED BY: System user who created this row of data.", "19": "ROW CREATED DATE: Date that the row was created on.", "20": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "21": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "22": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}