{"ANL_DETAIL": {"Column Name": {"0": "ANALYSIS_ID", "1": "ANL_SOURCE", "2": "DETAIL_OBS_NO", "3": "ACTIVE_IND", "4": "ANL_DETAIL_TYPE", "5": "AVERAGE_RATIO_VALUE", "6": "AVERAGE_VALUE", "7": "AVERAGE_VALUE_OUOM", "8": "AVERAGE_VALUE_UOM", "9": "CALCULATED_IND", "10": "CALCULATE_METHOD_ID", "11": "DATE_FORMAT_DESC", "12": "EFFECTIVE_DATE", "13": "EXPIRY_DATE", "14": "MAX_DATE", "15": "MAX_RATIO_VALUE", "16": "MAX_VALUE", "17": "MAX_VALUE_OUOM", "18": "MAX_VALUE_UOM", "19": "MEASUREMENT_TYPE", "20": "MIN_DATE", "21": "MIN_RATIO_VALUE", "22": "MIN_VALUE", "23": "MIN_VALUE_OUOM", "24": "MIN_VALUE_UOM", "25": "PPDM_GUID", "26": "PROBLEM_IND", "27": "REFERENCE_VALUE", "28": "REFERENCE_VALUE_OUOM", "29": "REFERENCE_VALUE_TYPE", "30": "REFERENCE_VALUE_UOM", "31": "REMARK", "32": "REPORTED_IND", "33": "SOURCE", "34": "STEP_SEQ_NO", "35": "SUBSTANCE_ID", "36": "ROW_CHANGED_BY", "37": "ROW_CHANGED_DATE", "38": "ROW_CREATED_BY", "39": "ROW_CREATED_DATE", "40": "ROW_EFFECTIVE_DATE", "41": "ROW_EXPIRY_DATE", "42": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y", "33": "Y", "34": "Y", "35": "Y", "36": "Y", "37": "Y", "38": "Y", "39": "Y", "40": "Y", "41": "Y", "42": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "NUMBER", "3": "VARCHAR2", "4": "VARCHAR2", "5": "NUMBER", "6": "NUMBER", "7": "VARCHAR2", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "DATE", "13": "DATE", "14": "DATE", "15": "NUMBER", "16": "NUMBER", "17": "VARCHAR2", "18": "VARCHAR2", "19": "VARCHAR2", "20": "DATE", "21": "NUMBER", "22": "NUMBER", "23": "VARCHAR2", "24": "VARCHAR2", "25": "VARCHAR2", "26": "VARCHAR2", "27": "NUMBER", "28": "VARCHAR2", "29": "VARCHAR2", "30": "VARCHAR2", "31": "VARCHAR2", "32": "VARCHAR2", "33": "VARCHAR2", "34": "NUMBER", "35": "VARCHAR2", "36": "VARCHAR2", "37": "DATE", "38": "VARCHAR2", "39": "DATE", "40": "DATE", "41": "DATE", "42": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "8", "3": "1", "4": "40", "5": "0", "6": "0", "7": "40", "8": "40", "9": "1", "10": "40", "11": "8", "12": "DATE", "13": "DATE", "14": "DATE", "15": "0", "16": "0", "17": "40", "18": "40", "19": "40", "20": "DATE", "21": "0", "22": "0", "23": "40", "24": "40", "25": "38", "26": "1", "27": "0", "28": "40", "29": "40", "30": "40", "31": "2000", "32": "1", "33": "40", "34": "8", "35": "40", "36": "30", "37": "DATE", "38": "30", "39": "DATE", "40": "DATE", "41": "DATE", "42": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN, "37": NaN, "38": NaN, "39": NaN, "40": NaN, "41": NaN, "42": NaN}, "Ref Table(s)": {"0": "ANL_ANALYSIS_REPORT\rANL_ANALYSIS_STEP", "1": "ANL_ANALYSIS_REPORT\rANL_ANALYSIS_STEP", "2": NaN, "3": NaN, "4": "R_ANL_DETAIL_TYPE", "5": NaN, "6": NaN, "7": "PPDM_UNIT_OF_MEASURE", "8": "PPDM_UNIT_OF_MEASURE", "9": NaN, "10": "ANL_CALC_METHOD", "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": "PPDM_UNIT_OF_MEASURE", "18": "PPDM_UNIT_OF_MEASURE", "19": "R_ANL_VALID_MEASUREMEN\rT", "20": NaN, "21": NaN, "22": NaN, "23": "PPDM_UNIT_OF_MEASURE", "24": "PPDM_UNIT_OF_MEASURE", "25": NaN, "26": NaN, "27": NaN, "28": "PPDM_UNIT_OF_MEASURE", "29": "R_ANL_DETAIL_REF_VALUE", "30": "PPDM_UNIT_OF_MEASURE", "31": NaN, "32": NaN, "33": "R_SOURCE", "34": "ANL_ANALYSIS_STEP", "35": "SUBSTANCE", "36": NaN, "37": NaN, "38": NaN, "39": NaN, "40": NaN, "41": NaN, "42": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "ANALYSIS IDENTIFIER: Unique identifier for a sample analysis. Various types of\ranalysis may be conducted on a sample. Samples may be derived from lithologic\rcuttings, fluid collection etc.", "1": "ANALYSIS SOURCE: The source that the analysis came from, this could be a lab\rtechnician, a lab, a company, a government agency, etc.", "2": "DETAIL OBSERVATION NUMBER: A sequence number assigned to allow for\rmultiple detail observations.", "3": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "4": "SAMPLE ANALYSIS DETAIL TYPE: The type of technical analysis result that has\rbeen captured. Note that most common study results are explicitly managed in other\rdetail tables. Use this table only if necessary.", "5": "AVERAGE RATIO VALUE: the average value of the ratio, or the value of a single\rreading if only one reading is provided.", "6": "AVERAGE VALUE: The average or single value assigned to this specification. If only\rone measure is provided, it should be stored here.", "7": "ORIGINAL UNIT OF MEASURE", "8": "UNIT OF MEASURE", "9": "CALCULATED INDICATOR: A Y/N flag indicating that the value given was\rcalculated, rather than measured. If the REPORTED_IND is also set to Y, the\rcalculated value was provided by the source (usually the lab) and not calculated\rlater. For more details about how the value was calculated, refer to the\rCALCULATE_METHOD_ID column and foreign key.", "10": "CALCULATION METHOD IDENTIFIER: Unique identifier for the method or formula\rused to create a calculated or derived value.", "11": "DATE FORMAT DESCRIPTION: Use this column to define the level of precision in\rthe DATE format columns, such as YYYY, or YYYQQ, or YYYYMM or YYYYMMDD", "12": "EFFECTIVE DATE: The date that the data in this row first comes into effect.", "13": "EXPIRY DATE: The date that the data in this row is no longer active or in effect.", "14": "MAXIMUM DATE: the maximum date, such as an expiry date, that describes this\rproduct.", "15": "MAXIMUM RATIO VALUE: The maximum value allowed for this ratio between these\rtwo samples.", "16": "MAXIMUM VALUE: the maximum value for a specification, such as the maximum\rdiameter of a tank, or the maximum load capacity of a vehicle.", "17": "ORIGINAL UNIT OF MEASURE", "18": "UNIT OF MEASURE", "19": "ANALYSIS MEASUREMENT TYPE: A list of valid measurement types. ANL QC\rVALID MEASURE lists which measurement types are valid for various types of\ranalysis, and what valid ranges for the values should be. In analysis detail tables,\rensure that you haveselected a measurement type that is appropriate for the type of\rstudy.", "20": "MINUMUM DATE: the minimum date associated with a specification, such as a date\rthat a product cannot be used for, such as for aging processes.", "21": "MINIMUM RATIO VALUE: The minimum value allowed for this ratio between these\rtwo samples.", "22": "MINIMUM VALUE: the minimum value associated with a specification, such as\rminimum pipe thickness or minimum pressure capability.", "23": "ORIGINAL UNIT OF MEASURE", "24": "UNIT OF MEASURE", "25": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "26": "PROBLEM INDICATOR: A Y/N flag indicating whether or not there is a problem with\rthe step. If a yes flag is indicated, additional information regarding the problem\rshould be noted in the table ANL_PROBLEM.", "27": "REFERENCE VALUE: the value of a reference point. For example, the result may be\rrelated to a specific luminosity, light intensity or other setting. Other reference values,\rsuch as pressures or temperatures that reference specifications are also permitted.", "28": "ORIGINAL UNIT OF MEASURE", "29": "REFERENCE VALUE TYPE: In the event that a parameter is provided relative to\rsome other measure, use this set of columns. For example, a temperature may be\rachieved at standard atmospheric pressure.", "30": "UNIT OF MEASURE", "31": "REMARK: Narrative remarks about this row of data.", "32": "REPORTED INDICATOR: A Y/N flag indicating that this value is provided as reported\rby the source, usually a laboratory. This indicates that the value was not created or\rmodified upon load into PPDM, even though the value may not be correct. If\rproblems are suspected, set PROBLEM_IND to Y, and for more details about what\rproblems may exist, refer to the ANL_PROBLEM table.", "33": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "34": "STEP SEQUENCE NUMBER: A unique number indicating the sequence of the step\ramong other steps in the preparation and processing of the sample. This column is a\rsufficient method to keep track of what is done in the sample analysis. However, if\rthe requirement for more complicated tracking such as two steps occurring\rsimultaneously or if steps are needed to be added to the initial procedure, use the\rtwo columns STEP_SEQ_NO1 and STEP_SEQ_NO2 in the table\rANL_STEP_XREF.", "35": "SUBSTANCE IDENTIFIER: Unique identifier for a substance that can be described\reither chemically or in terms of composition. Elements, ions, isotopes, isomers,\rminerals, chemicals, solvents, production substances, hydrocarbons etc are all listed.\rBe advised that many applications and agencies may use the same term, but the\rdefinition and composition details may not be the same. Use the SUBSTANCE XREF\rtable to capture relationships between substances, such as similar substances.", "36": "ROW CHANGED BY: Application login id of the user who last changed the row.", "37": "ROW CHANGED DATE: System date of the last time the row was changed.", "38": "ROW CREATED BY: System user who created this row of data.", "39": "ROW CREATED DATE: Date that the row was created on.", "40": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "41": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "42": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}