{"ANL_BA": {"Column Name": {"0": "ANALYSIS_ID", "1": "ANL_SOURCE", "2": "BA_OBS_NO", "3": "ACTIVE_IND", "4": "ANALYSIS_BA_ID", "5": "BA_ROLE_TYPE", "6": "EFFECTIVE_DATE", "7": "EXPIRY_DATE", "8": "PPDM_GUID", "9": "PROBLEM_IND", "10": "REMARK", "11": "SOURCE", "12": "STEP_SEQ_NO", "13": "ROW_CHANGED_BY", "14": "ROW_CHANGED_DATE", "15": "ROW_CREATED_BY", "16": "ROW_CREATED_DATE", "17": "ROW_EFFECTIVE_DATE", "18": "ROW_EXPIRY_DATE", "19": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "NUMBER", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "DATE", "7": "DATE", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "NUMBER", "13": "VARCHAR2", "14": "DATE", "15": "VARCHAR2", "16": "DATE", "17": "DATE", "18": "DATE", "19": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "8", "3": "1", "4": "40", "5": "40", "6": "DATE", "7": "DATE", "8": "38", "9": "1", "10": "2000", "11": "40", "12": "8", "13": "30", "14": "DATE", "15": "30", "16": "DATE", "17": "DATE", "18": "DATE", "19": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN}, "Ref Table(s)": {"0": "ANL_ANALYSIS_REPORT\rANL_ANALYSIS_STEP", "1": "ANL_ANALYSIS_REPORT\rANL_ANALYSIS_STEP", "2": NaN, "3": NaN, "4": "BUSINESS_ASSOCIATE", "5": "R_ANL_BA_ROLE_TYPE", "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": "R_SOURCE", "12": "ANL_ANALYSIS_STEP", "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "ANALYSIS IDENTIFIER: Unique identifier for a sample analysis. Various types of\ranalysis may be conducted on a sample. Samples may be derived from lithologic\rcuttings, fluid collection etc.", "1": "ANALYSIS SOURCE: The source that the analysis came from, this could be a lab\rtechnician, a lab, a company, a government agency, etc.", "2": "BUSINESS ASSOCIATE OBSERVATION NUMBER: Unique identifier for the record\rthat describes the business associate that made the observation regarding the\rsample analysis.", "3": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "4": "ANALYSIS BUSINESS ASSOCIATE IDENTIFIER: Unique identifier for the business\rassociate who played a part in an analysis. Track the role played by the business\rassociate in BA_ROLE. If a BA plays more than one role, create a row for each role\rplayed by the BA.", "5": "REFERENCE ANALYSIS BUSINESS ASSOCIATE ROLE TYPE: the type of role that\ra business associate plays or may play during a sample analysis. Examples include\rtechnician, scientist, reviewer, laboratory, conducted for, document preparation etc.", "6": "EFFECTIVE DATE: The date that the data in this row first comes into effect.", "7": "EXPIRY DATE: The date that the data in this row is no longer active or in effect.", "8": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "9": "PROBLEM INDICATOR: A Y/N flag indicating whether or not there is a problem with\rthe step. If a yes flag is indicated, additional information regarding the problem\rshould be noted in the table ANL_PROBLEM.", "10": "REMARK: Narrative remarks about this row of data.", "11": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "12": "STEP SEQUENCE NUMBER: A unique number indicating the sequence of the step\ramong other steps in the preparation and processing of the sample. This column is a\rsufficient method to keep track of what is done in the sample analysis. However, if\rthe requirement for more complicated tracking such as two steps occurring\rsimultaneously or if steps are needed to be added to the initial procedure, use the\rtwo columns STEP_SEQ_NO1 and STEP_SEQ_NO2 in the table\rANL_STEP_XREF.", "13": "ROW CHANGED BY: Application login id of the user who last changed the row.", "14": "ROW CHANGED DATE: System date of the last time the row was changed.", "15": "ROW CREATED BY: System user who created this row of data.", "16": "ROW CREATED DATE: Date that the row was created on.", "17": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "18": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "19": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}