{"ANL_EQUIP": {"Column Name": {"0": "ANALYSIS_ID", "1": "ANL_SOURCE", "2": "EQUIP_OBS_NO", "3": "ACTIVE_IND", "4": "CALLIBRATION_RECORD", "5": "CATALOGUE_EQUIP_ID", "6": "EFFECTIVE_DATE", "7": "EQUIP_ID", "8": "EQUIP_ROLE", "9": "EXPIRY_DATE", "10": "LAB_BA_ID", "11": "PPDM_GUID", "12": "PROBLEM_IND", "13": "REMARK", "14": "SOURCE", "15": "STEP_SEQ_NO", "16": "ROW_CHANGED_BY", "17": "ROW_CHANGED_DATE", "18": "ROW_CREATED_BY", "19": "ROW_CREATED_DATE", "20": "ROW_EFFECTIVE_DATE", "21": "ROW_EXPIRY_DATE", "22": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "NUMBER", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "DATE", "7": "VARCHAR2", "8": "VARCHAR2", "9": "DATE", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "NUMBER", "16": "VARCHAR2", "17": "DATE", "18": "VARCHAR2", "19": "DATE", "20": "DATE", "21": "DATE", "22": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "8", "3": "1", "4": "2000", "5": "40", "6": "DATE", "7": "40", "8": "40", "9": "DATE", "10": "40", "11": "38", "12": "1", "13": "2000", "14": "40", "15": "8", "16": "30", "17": "DATE", "18": "30", "19": "DATE", "20": "DATE", "21": "DATE", "22": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN}, "Ref Table(s)": {"0": "ANL_ANALYSIS_REPORT\rANL_ANALYSIS_STEP", "1": "ANL_ANALYSIS_REPORT\rANL_ANALYSIS_STEP", "2": NaN, "3": NaN, "4": NaN, "5": "CAT_EQUIPMENT", "6": NaN, "7": "EQUIPMENT", "8": "R_ANL_EQUIP_ROLE", "9": NaN, "10": "BUSINESS_ASSOCIATE", "11": NaN, "12": NaN, "13": NaN, "14": "R_SOURCE", "15": "ANL_ANALYSIS_STEP", "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "ANALYSIS IDENTIFIER: Unique identifier for a sample analysis. Various types of\ranalysis may be conducted on a sample. Samples may be derived from lithologic\rcuttings, fluid collection etc.", "1": "ANALYSIS SOURCE: The source that the analysis came from, this could be a lab\rtechnician, a lab, a company, a government agency, etc.", "2": "EQUIPMENT OBSERVATION NUMBER: A unique number which allows for multiple\robservations by a piece of equipment during sample analysis.", "3": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "4": "CALLIBRATION RECORD: These are typically ASCII files provided along with lab\rresults, often as a text tile, or a paper document. The information includes data about\rhow the equipment was configured or calibrated for the stufy, and may provide useful\rbenchmarks for comparing studies or understanding the results of one study. You\rcan capture the contents of a text file in this record, or point to the RM module for the\rlocation of a paper or digital document (use ANL COMPONENT for the FK)", "5": "EQUIPMENT CATALOGUE IDENTIFIER: Unique identifier for the list of kinds of\requipment. Think of this as a catalogue or brochure that shows all the kinds of\requipment that you may use, but may or may not actually have. Actual pieces of\requipment thatexist are defined in the table EQUIPMENT.", "6": "EFFECTIVE DATE: The date that the data in this row first comes into effect.", "7": "EQUIPMENT IDENTIFIER: Unique identifier for the specific piece of equipment used\rin this study. If you only know the general make and model of the equipment, use\rCAT EQUIP ID.", "8": "EQUIPMENT ROLE: The role a particular piece of equipment plays in the sample\ranalysis.", "9": "EXPIRY DATE: The date that the data in this row is no longer active or in effect.", "10": "LABORATORY BUSINESS ASSOCIATE IDENTIFIER: A unique identifier for a\rbusiness associate within a laboratory.", "11": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "12": "PROBLEM INDICATOR: A Y/N flag indicating whether or not there is a problem with\rthe step. If a yes flag is indicated, additional information regarding the problem\rshould be noted in the table ANL_PROBLEM.", "13": "REMARK: Narrative remarks about this row of data.", "14": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "15": "STEP SEQUENCE NUMBER: A unique number indicating the sequence of the step\ramong other steps in the preparation and processing of the sample. This column is a\rsufficient method to keep track of what is done in the sample analysis. However, if\rthe requirement for more complicated tracking such as two steps occurring\rsimultaneously or if steps are needed to be added to the initial procedure, use the\rtwo columns STEP_SEQ_NO1 and STEP_SEQ_NO2 in the table\rANL_STEP_XREF.", "16": "ROW CHANGED BY: Application login id of the user who last changed the row.", "17": "ROW CHANGED DATE: System date of the last time the row was changed.", "18": "ROW CREATED BY: System user who created this row of data.", "19": "ROW CREATED DATE: Date that the row was created on.", "20": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "21": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "22": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}