{"ANL_GAS_COMPOSITION": {"Column Name": {"0": "ANALYSIS_ID", "1": "ANL_SOURCE", "2": "GAS_ANL_COMPOSITION_OBS_", "3": "ACTIVE_IND", "4": "CALCULATED_IND", "5": "CALCULATE_METHOD_ID", "6": "EFFECTIVE_DATE", "7": "EXPIRY_DATE", "8": "NOT_PRESENT_IND", "9": "PPDM_GUID", "10": "PROBLEM_IND", "11": "REMARK", "12": "REPORTED_IND", "13": "SOURCE", "14": "STEP_SEQ_NO", "15": "SUBSTANCE_AMOUNT", "16": "SUBSTANCE_AMOUNT_OUOM", "17": "SUBSTANCE_AMOUNT_UOM", "18": "SUBSTANCE_ID", "19": "SUBSTANCE_PERCENT", "20": "TRACE_IND", "21": "ROW_CHANGED_BY", "22": "ROW_CHANGED_DATE", "23": "ROW_CREATED_BY", "24": "ROW_CREATED_DATE", "25": "ROW_EFFECTIVE_DATE", "26": "ROW_EXPIRY_DATE", "27": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "ON", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "NUMBER", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "DATE", "7": "DATE", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "NUMBER", "15": "NUMBER", "16": "VARCHAR2", "17": "VARCHAR2", "18": "VARCHAR2", "19": "NUMBER", "20": "VARCHAR2", "21": "VARCHAR2", "22": "DATE", "23": "VARCHAR2", "24": "DATE", "25": "DATE", "26": "DATE", "27": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "8", "3": "1", "4": "1", "5": "40", "6": "DATE", "7": "DATE", "8": "1", "9": "38", "10": "1", "11": "2000", "12": "1", "13": "40", "14": "8", "15": "10,5", "16": "40", "17": "40", "18": "40", "19": "15,12", "20": "1", "21": "30", "22": "DATE", "23": "30", "24": "DATE", "25": "DATE", "26": "DATE", "27": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN}, "Ref Table(s)": {"0": "ANL_ANALYSIS_REPORT\rANL_ANALYSIS_STEP", "1": "ANL_ANALYSIS_REPORT\rANL_ANALYSIS_STEP", "2": NaN, "3": NaN, "4": NaN, "5": "ANL_CALC_METHOD", "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": "R_SOURCE", "14": "ANL_ANALYSIS_STEP", "15": NaN, "16": "PPDM_UNIT_OF_MEASURE", "17": "PPDM_UNIT_OF_MEASURE", "18": "SUBSTANCE", "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "ANALYSIS IDENTIFIER: Unique identifier for a sample analysis. Various types of\ranalysis may be conducted on a sample. Samples may be derived from lithologic\rcuttings, fluid collection etc.", "1": "ANALYSIS SOURCE: The source that the analysis came from, this could be a lab\rtechnician, a lab, a company, a government agency, etc.", "2": "GAS ANALYSIS COMPOSITION OBSERVATION NUMBER: A Unique observation\rnumber for the gas analysis.", "3": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "4": "CALCULATED INDICATOR: A Y/N flag indicating that the value given was\rcalculated, rather than measured. If the REPORTED_IND is also set to Y, the\rcalculated value was provided by the source (usually the lab) and not calculated\rlater. For more details about how the value was calculated, refer to the\rCALCULATE_METHOD_ID column and foreign key.", "5": "CALCULATION METHOD IDENTIFIER: Unique identifier for the method or formula\rused to create a calculated or derived value.", "6": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "7": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "8": "NOT PRESENT INDICATOR: A Y/N flag indicating that this substance was not found\rin the samle. This may be a result of equipment capabilities, problems in the sample.\rerror in the test that was run or the substance may actually not be present in the\rsample. Refer to the ANL PROBLEM to capture details about the problem that was\rfound.", "9": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "10": "PROBLEM INDICATOR: A Y/N flag indicating whether or not there is a problem with\rthe step. If a yes flag is indicated, additional information regarding the problem\rshould be noted in the table ANL_PROBLEM.", "11": "REMARK: Narrative remarks about this row of data.", "12": "REPORTED INDICATOR: A Y/N flag indicating that this value is provided as reported\rby the source, usually a laboratory. This indicates that the value was not created or\rmodified upon load into PPDM, even though the value may not be correct. If\rproblems are suspected, set PROBLEM_IND to Y, and for more details about what\rproblems may exist, refer to the ANL_PROBLEM table.", "13": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "14": "STEP SEQUENCE NUMBER: A unique number indicating the sequence of the step\ramong other steps in the preparation and processing of the sample. This column is a\rsufficient method to keep track of what is done in the sample analysis. However, if\rtherequirement for more complicated tracking such as two steps occurring\rsimultaneously or if steps are needed to be added to the initial procedure, use the\rtwo columns STEP_SEQ_NO1 and STEP_SEQ_NO2 in the table\rANL_STEP_XREF.", "15": "SUBSTANCE AMOUNT: the quantity of this substance that is part of the gas\ranalyzed.", "16": "ORIGINAL UNIT OF MEASURE", "17": "UNIT OF MEASURE", "18": "SUBSTANCE IDENTIFIER: Unique identifier for a substance that can be described\reither chemically or in terms of composition. Elements, ions, isotopes, isomers,\rminerals, chemicals, solvents, production substances, hydrocarbons etc are all listed.\rBe advised that many applications and agencies may use the same term, but the\rdefinition and composition details may not be the same. Use the SUBSTANCE XREF\rtable to capture relationships between substances, such as similar substances.", "19": "SUBSTANCE PERCENT: The percent of substance found in the gas analysis.", "20": "TRACE IND: A Y/N flag indicating that only trace amounts of this substance were\rfound during the analysis.", "21": "ROW CHANGED BY: Application login id of the user who last changed the row.", "22": "ROW CHANGED DATE: System date of the last time the row was changed.", "23": "ROW CREATED BY: System user who created this row of data.", "24": "ROW CREATED DATE: Date that the row was created on.", "25": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "26": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "27": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}