{"ANL_PROBLEM": {"Column Name": {"0": "ANALYSIS_ID", "1": "ANL_SOURCE", "2": "PROBLEM_OBS_NO", "3": "ACTIVE_IND", "4": "ACTIVITY_SET_ID", "5": "ANL_PROBLEM_IND", "6": "BA_PROBLEM_IND", "7": "CONFIDENCE_TYPE", "8": "EFFECTIVE_DATE", "9": "EQUIP_PROBLEM_IND", "10": "EXPIRY_DATE", "11": "METHOD_ID", "12": "METHOD_PROBLEM_IND", "13": "PERCENT_OF_SAMPLE", "14": "PPDM_GUID", "15": "PROBLEM_DESC", "16": "PROBLEM_RESULT", "17": "PROBLEM_RESULT_DESC", "18": "PROBLEM_SEVERITY", "19": "PROBLEM_SEVERITY_DESC", "20": "PROBLEM_TYPE", "21": "REFERENCED_COLUMN_NAME", "22": "REFERENCED_PPDM_GUID", "23": "REFERENCED_SYSTEM_ID", "24": "REFERENCED_TABLE_NAME", "25": "REMARK", "26": "RESOLUTION_METHOD", "27": "RESOLUTION_METHOD_DESC", "28": "RESOLUTION_STEP_SEQ_NO", "29": "RESOLVED_BY_BA_ID", "30": "SAMPLE_PROBLEM_IND", "31": "SOURCE", "32": "STEP_SEQ_NO", "33": "VALID_PROBLEM_OBS_NO", "34": "ROW_CHANGED_BY", "35": "ROW_CHANGED_DATE", "36": "ROW_CREATED_BY", "37": "ROW_CREATED_DATE", "38": "ROW_EFFECTIVE_DATE", "39": "ROW_EXPIRY_DATE", "40": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y", "33": "Y", "34": "Y", "35": "Y", "36": "Y", "37": "Y", "38": "Y", "39": "Y", "40": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "NUMBER", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "VARCHAR2", "7": "VARCHAR2", "8": "DATE", "9": "VARCHAR2", "10": "DATE", "11": "VARCHAR2", "12": "VARCHAR2", "13": "NUMBER", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "VARCHAR2", "19": "VARCHAR2", "20": "VARCHAR2", "21": "VARCHAR2", "22": "VARCHAR2", "23": "VARCHAR2", "24": "VARCHAR2", "25": "VARCHAR2", "26": "VARCHAR2", "27": "VARCHAR2", "28": "NUMBER", "29": "VARCHAR2", "30": "VARCHAR2", "31": "VARCHAR2", "32": "NUMBER", "33": "NUMBER", "34": "VARCHAR2", "35": "DATE", "36": "VARCHAR2", "37": "DATE", "38": "DATE", "39": "DATE", "40": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "8", "3": "1", "4": "40", "5": "1", "6": "1", "7": "40", "8": "DATE", "9": "1", "10": "DATE", "11": "40", "12": "1", "13": "15,12", "14": "38", "15": "240", "16": "40", "17": "1024", "18": "40", "19": "1024", "20": "40", "21": "30", "22": "38", "23": "40", "24": "30", "25": "2000", "26": "40", "27": "1024", "28": "8", "29": "40", "30": "1", "31": "40", "32": "8", "33": "8", "34": "30", "35": "DATE", "36": "30", "37": "DATE", "38": "DATE", "39": "DATE", "40": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN, "37": NaN, "38": NaN, "39": NaN, "40": NaN}, "Ref Table(s)": {"0": "ANL_ANALYSIS_REPORT\rANL_ANALYSIS_STEP\rANL_ANALYSIS_STEP", "1": "ANL_ANALYSIS_REPORT\rANL_ANALYSIS_STEP\rANL_ANALYSIS_STEP", "2": NaN, "3": NaN, "4": "ANL_VALID_PROBLEM", "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": "ANL_VALID_PROBLEM", "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": "R_ANL_PROBLEM_RESULT", "17": NaN, "18": "R_ANL_PROBLEM_SEVERITY", "19": NaN, "20": "R_ANL_PROBLEM_TYPE", "21": "PPDM_COLUMN", "22": NaN, "23": "PPDM_TABLE\rPPDM_COLUMN", "24": "PPDM_TABLE\rPPDM_COLUMN", "25": NaN, "26": "R_ANL_PROBLEM_RESOLUTI\rON", "27": NaN, "28": "ANL_ANALYSIS_STEP", "29": "BUSINESS_ASSOCIATE", "30": NaN, "31": "R_SOURCE", "32": "ANL_ANALYSIS_STEP", "33": "ANL_VALID_PROBLEM", "34": NaN, "35": NaN, "36": NaN, "37": NaN, "38": NaN, "39": NaN, "40": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "ANALYSIS IDENTIFIER: Unique identifier for a sample analysis. Various types of\ranalysis may be conducted on a sample. Samples may be derived from lithologic\rcuttings, fluid collection etc.", "1": "ANALYSIS SOURCE: The source that the analysis came from, this could be a lab\rtechnician, a lab, a company, a government agency, etc.", "2": "PROBLEM OBSERVATION NUMBER: A unique number that can keep track of the\rproblems that have arisen in the sample analysis.", "3": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "4": "ACTIVITY SET IDENTIFIER: A unique identifier for an activity set.", "5": "ANALYSIS PROBLEM INDICATOR: A Y/N flag indicating whether or not there is a\rproblem with the sample analysis.", "6": "BUSINESS ASSOCIATE PROBLEM INDICATOR: A Y/N flag indicating whether or\rnot there is a problem with the business associate.", "7": "REFERENCE ANALYSIS CONFIDENCE TYPE: The level of confidence or certainty\rfor an analysis value. Various systems for measurement are defined in literature, and\rmay be text based (CERTAIN, PROBABLE, UNCERTAIN) or number based. This\rvalue tends to be subjective, and indicates the level of trust the analyst has in the\rresult.", "8": "EFFECTIVE DATE: The date that the data in this row first comes into effect.", "9": "EQUIPMENT PROBLEM INDICATOR: A Y/N flag indicating whether or not there is a\rproblem with a particular piece of equipment.", "10": "EXPIRY DATE: The date that the data in this row is no longer active or in effect.", "11": "STANDARD METHOD SET IDENTIFIER: A unique identifier for a set or group of\rstandard methods. Often, these would identify a method, consisting of several\rdifferent steps, that are included in a typical analysis.", "12": "METHOD PROBLEM INDICATOR: A Y/N flag indicating whether or not there is a\rproblem with the method for sample analysis.", "13": "PERCENT OF SAMPLE: The percent of sample required in the sample analysis. If\rthere is not enough sample this may very well effect the quality of the sample\ranalysis.", "14": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "15": "PROBLEM DESCRIPTION: A narrative description about the problem that has arisen\rin the sample analysis.", "16": "REFERENCE ANALYSIS PROBLEM RESULT: The type of consequence that was\rthe outcome of the problem described. For example, results may be inaccurate, or a\rtest may be destroyed, or results may show anomalous values.", "17": "PROBLEM RESULT DESCRIPTION: Narrative comments about the result or\rconsequences of this problem.", "18": "REFERENCE ANALYSIS PROBLEM SEVERITY: A valid type of severity related to a\rproblem encountered during analysis. The severity may range from inconsequential\rto invalidating the results of a study.", "19": "PROBLEM SEVERITY DESCRIPTION: Narrative comments about how serious this\rproblem was to the results of the study.", "20": "REFERENCE ANALYSIS PROBLEM TYPE: This reference list contains a list of the\rvalid problems that can and are associated with laboratory analysis. Problems may\rrelate to equipment calibration errors, sample contamination, incorrect procedures\rused, technical error etc.", "21": "PPDM COLUMN NAME: The name of a column that has an association with this\rlevel of classification system.", "22": "PPDM GUID: This value may be used to provide a global unique identifier for this row\rof data. If used, optional PPDM NOT NULL constraints should be created.", "23": "SYSTEM IDENTIFIER: A unique identifier for a data storage system, such as a\rdatabase or XML schema.", "24": "PPDM TABLE NAME: The name of a table that has an association with this level of a\rclassification system. This may be used in conjunction with an appropriate foreign\rkey from the table that is referenced, or may be used generically in combination with\rthe", "25": "REMARK: Narrative remarks about this row of data.", "26": "REFERENCE ANALYSIS PROBLEM RESOLUTION METHOD: The method used to\rresolve a problem encountered during analysis. Could include re-running the\rsamples, calibrating equipment, collecting a new sample batch, altering parameters\rand so on.", "27": "RESOLUTION METHOD DESCRIPTION: Narrative remarks about how this problem\rwas resolved, it was actually resolved.", "28": "RESOLUTION STEP SEQUENCE NUMBER: A unique number that is assigned to\reach step in the resolution of a problem. This numbering of steps can be used to\runderstand what was actually done in the resolution of the problem and ultimately\rcan be used to see if the problem could be resolved more efficiently.", "29": "RESOLVED BY BUSINESS ASSOCIATE IDENTIFIER: A unique identifier for the\rbusiness associate that resolved the problem.", "30": "SAMPLE PROBLEM INDICATOR: A Y/N flag indicating whether or not there is a\rproblem with the sample.", "31": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "32": "STEP SEQUENCE NUMBER: A unique number indicating the sequence of the step\ramong other steps in the preparation and processing of the sample. This column is a\rsufficient method to keep track of what is done in the sample analysis. However, if\rthe requirement for more complicated tracking such as two steps occurring\rsimultaneously or if steps are needed to be added to the initial procedure, use the\rtwo columns STEP_SEQ_NO1 and STEP_SEQ_NO2 in the table\rANL_STEP_XREF.", "33": "VALID PROBLEM OBSERVATION NUMBER: Unique identifier for a recognized type\rof problem for an analysis method. Use this column to compare the problems\ridentified during analysis with the kinds of problem generally found. Optional.", "34": "ROW CHANGED BY: Application login id of the user who last changed the row.", "35": "ROW CHANGED DATE: System date of the last time the row was changed.", "36": "ROW CREATED BY: System user who created this row of data.", "37": "ROW CREATED DATE: Date that the row was created on.", "38": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "39": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "40": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}