{"CAT_ADDITIVE_GROUP_PART": {"Column Name": {"0": "ADDITIVE_GROUP_ID", "1": "ADDITIVE_TYPE_ID", "2": "ADDITIVE_PART_OBS_NO", "3": "ACTIVE_IND", "4": "CATALOGUE_ADDITIVE_ID", "5": "EFFECTIVE_DATE", "6": "EXPIRY_DATE", "7": "LONG_NAME", "8": "PPDM_GUID", "9": "REMARK", "10": "SHORT_NAME", "11": "SOURCE", "12": "SOURCE_DOCUMENT_ID", "13": "SUBSTANCE_ID", "14": "ROW_CHANGED_BY", "15": "ROW_CHANGED_DATE", "16": "ROW_CREATED_BY", "17": "ROW_CREATED_DATE", "18": "ROW_EFFECTIVE_DATE", "19": "ROW_EXPIRY_DATE", "20": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "NUMBER", "3": "VARCHAR2", "4": "VARCHAR2", "5": "DATE", "6": "DATE", "7": "VARCHAR2", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "DATE", "16": "VARCHAR2", "17": "DATE", "18": "DATE", "19": "DATE", "20": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "8", "3": "1", "4": "40", "5": "DATE", "6": "DATE", "7": "255", "8": "38", "9": "2000", "10": "30", "11": "40", "12": "40", "13": "40", "14": "30", "15": "DATE", "16": "30", "17": "DATE", "18": "DATE", "19": "DATE", "20": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN}, "Ref Table(s)": {"0": "CAT_ADDITIVE_GROUP", "1": "CAT_ADDITIVE_TYPE", "2": NaN, "3": NaN, "4": "CAT_ADDITIVE", "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": "R_SOURCE", "12": NaN, "13": "SUBSTANCE", "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "ADDITIVE GROUP IDENTIFIER: Unique identifier for an additive group. Additive\rgroups may be created to associate additives with similar function, or that are\rprohibited for use in a particular jurisdiction.", "1": "CATALOGUE ADDITIVE TYPE: A material added to a fluid to perform one or more\rspecific functions, such as a weighting agent, viscosifier or lubricant. (Schlumberger\rOilfield Glossary). Note that the function of this table may also be assumed by the\rCLASSIFICATION module for more robust and complete classifications.", "2": "ADDITIVE PART OBSERVATION NUMBER: a unique sequencer so that multiple\radditives of the same type may be added to a group. Allows implementations to\rcapture more than one specific catalogue additive of a type, if known.", "3": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "4": "CATALOGUE ADDITIVE IDENTIFIER: Unique identifier for the list of kinds of\radditives. Think of this table as a catalogue of all the kinds of additives that can be\rpurchased or created. Use this column if the specific catalogue number is known.", "5": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "6": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "7": "LONG NAME: Common long name used for the Catalogue Group Part.", "8": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL shouldbe created.", "9": "REMARK: Narrative remarks about this row of data", "10": "SHORT NAME: Common short name used for the Catalogue Group Part.", "11": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "12": "SOURCE DOCUMENT: The literature reference for the information about the\rsubstance in this row.", "13": "SUBSTANCE IDENTIFIER: Unique identifier for a substance that can be described\reither chemically or in terms of composition. Elements, ions, isotopes, isomers,\rminerals, chemicals, solvents, production substances, hydrocarbons etc are alllisted.\rBe advised that many applications and agencies may use the same term, but the\rdefinition and composition details may not be the same. Use the SUBSTANCE XREF\rtable to capture relationships between substances, such as similar substances.", "14": "ROW CHANGED BY: Application login id of the user who last changed the row.", "15": "ROW CHANGED DATE: System date of the last time the row was changed.ho last\rchanged the row.", "16": "ROW CREATED BY: System user who created this row of data.", "17": "ROW CREATED DATE: Date that the row was created on.", "18": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "19": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "20": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}