{"CAT_ADDITIVE": {"Column Name": {"0": "CATALOGUE_ADDITIVE_ID", "1": "ACTIVE_IND", "2": "ADDITIVE_GROUP", "3": "ADDITIVE_NAME", "4": "ADDITIVE_TYPE", "5": "EFFECTIVE_DATE", "6": "EXPIRY_DATE", "7": "MANUFACTURER", "8": "PPDM_GUID", "9": "PURCHASE_QUANTITY", "10": "PURCHASE_QUANTITY_TYPE", "11": "PURCHASE_QUANTITY_UOM", "12": "REMARK", "13": "SOURCE", "14": "SUPPLIER", "15": "UPC_CODE", "16": "ROW_CHANGED_BY", "17": "ROW_CHANGED_DATE", "18": "ROW_CREATED_BY", "19": "ROW_CREATED_DATE", "20": "ROW_EFFECTIVE_DATE", "21": "ROW_EXPIRY_DATE", "22": "ROW_QUALITY"}, "Null": {"0": "N", "1": "Y", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "DATE", "6": "DATE", "7": "VARCHAR2", "8": "VARCHAR2", "9": "NUMBER", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "DATE", "18": "VARCHAR2", "19": "DATE", "20": "DATE", "21": "DATE", "22": "VARCHAR2"}, "Length": {"0": "40", "1": "1", "2": "40", "3": "255", "4": "40", "5": "DATE", "6": "DATE", "7": "40", "8": "38", "9": "0", "10": "40", "11": "40", "12": "2000", "13": "40", "14": "30", "15": "20", "16": "30", "17": "DATE", "18": "30", "19": "DATE", "20": "DATE", "21": "DATE", "22": "40"}, "Key": {"0": "P", "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN}, "Ref Table(s)": {"0": NaN, "1": NaN, "2": "R_CAT_ADDITIVE_GROUP", "3": NaN, "4": "CAT_ADDITIVE_TYPE", "5": NaN, "6": NaN, "7": "BUSINESS_ASSOCIATE", "8": NaN, "9": NaN, "10": "R_CAT_ADDITIVE_QUANTITY", "11": "PPDM_UNIT_OF_MEASURE", "12": NaN, "13": "R_SOURCE", "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "CATALOGUE ADDITIVE IDENTIFIER: Unique identifier for the list of kinds of\radditives. Think of this table as a catalogue of all the kinds of additives that can be\rpurchased or created. This table can be used to store information about the\rpackaging and quantity per package.", "1": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "2": "CATALOGUE ADDITIVE GROUP: The class or group of additives that this additive\rbelongs to, such as drill mud additive, treatment additive, processing additive etc.\rWithin each group of additives, many types of additives may be described using CAT\rADDITIVE TYPE. Note that the function of this table may also be assumed by the\rCLASSIFICATION module for more robust and complete classifications. Note that if\ryou use this column in this table, you may be storing data that is redundant to the\rdata in CAT ADDITIVE TYPE. Please use good data management practices to avoid\rdata confusion. Usually this column is used only when the specific type of additive is\rnot known.", "3": "ADDITIVE NAME: The common name given to this kind of additive.", "4": "CATALOGUE ADDITIVE TYPE: A material added to a fluid to perform one or more\rspecific functions, such as a weighting agent, viscosifier or lubricant. (Schlumberger\rOilfield Glossary). Note that the function of this table may also be assumed by the\rCLASSIFICATION module for more robust and complete classifications.", "5": "EFFECTIVE DATE: date on which the data in this row came into effect.", "6": "EXPIRY DATE: Date on which the data in this row of data was no longer in effect.", "7": "MANUFACTURER: the unique identifier for the business associate who\rmanufactures this kind of equipment.", "8": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "9": "PURCHASE QUANTITY: the quantity of the additive that is purchased for this item.\rWorks in concert with PURCHASE QUANTIFY (how much), PURCHASE QUANTITY\rUOM (kilograms, pounds), PURCHASE TYPE (sacks, bags, blocks, pails). For\rexample an additive may be available in 20 Kg sacks, or 50 Kg bales.", "10": "PURCHASE QUANTITY TYPE: the type of quantity of the additive that is purchased\rfor this item, such as sacks, bails, pails etc. Works in concert with PURCHASE\rQUANTIFY (how much), PURCHASE QUANTITY UOM (kilograms, pounds),\rPURCHASE TYPE (sacks, bags, blocks, pails).", "11": "PURCHASE QUANTITY UNIT OF MEASURE: Works in concert with PURCHASE\rQUANTIFY (how much), PURCHASE QUANTITY UOM (kilograms, pounds),\rPURCHASE TYPE (sacks, bags, blocks, pails).", "12": "REMARK: Narrative remarks about this row of data.", "13": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "14": "SUPPLIER: the name of the company from whom this substance can be obtained", "15": "UNIVERSAL PRODUCT CODE: The UPC code for this additive.", "16": "ROW CHANGED BY: Application login id of the user who last changed the row.", "17": "ROW CHANGED DATE: System date of the last time the row was changed.", "18": "ROW CREATED BY: System user who created this row of data.", "19": "ROW CREATED DATE: Date that the row was created on.", "20": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "21": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "22": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}