{"CLASS_SYSTEM": {"Column Name": {"0": "CLASSIFICATION_SYSTEM_ID", "1": "ACTIVE_IND", "2": "CLASS_DIMENSION", "3": "EFFECTIVE_DATE", "4": "EXPIRY_DATE", "5": "PPDM_GUID", "6": "REMARK", "7": "SOURCE", "8": "SOURCE_DOCUMENT_ID", "9": "SYSTEM_DEFINITION", "10": "SYSTEM_NAME", "11": "SYSTEM_OWNER", "12": "SYSTEM_REF_NUM", "13": "SYSTEM_VERSION", "14": "ROW_CHANGED_BY", "15": "ROW_CHANGED_DATE", "16": "ROW_CREATED_BY", "17": "ROW_CREATED_DATE", "18": "ROW_EFFECTIVE_DATE", "19": "ROW_EXPIRY_DATE", "20": "ROW_QUALITY"}, "Null": {"0": "N", "1": "Y", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "DATE", "4": "DATE", "5": "VARCHAR2", "6": "VARCHAR2", "7": "VARCHAR2", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "DATE", "16": "VARCHAR2", "17": "DATE", "18": "DATE", "19": "DATE", "20": "VARCHAR2"}, "Length": {"0": "40", "1": "1", "2": "40", "3": "DATE", "4": "DATE", "5": "38", "6": "2000", "7": "40", "8": "40", "9": "2000", "10": "255", "11": "40", "12": "30", "13": "20", "14": "30", "15": "DATE", "16": "30", "17": "DATE", "18": "DATE", "19": "DATE", "20": "40"}, "Key": {"0": "P", "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN}, "Ref Table(s)": {"0": NaN, "1": NaN, "2": "R_CLASS_SYSTEM_DIMENSI\rON", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": "R_SOURCE", "8": "SOURCE_DOCUMENT", "9": NaN, "10": NaN, "11": "BUSINESS_ASSOCIATE", "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "CLASSIFICATION: SYSTEM: Identifies and describes the classification system that\ris used. The UNSPSC code set is a useful and practical source of classification\rinformation.", "1": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "2": "CLASS SYSTEM DIMENSION: The type of dimension or facet that is in this\rtaxomony or classification system. For example, a taxonomy may exist for an\rorganization, or for geographic areas, or for tools and equipment or materials. By\rprefrence, taxonomies should contain one dimension or as few dimensions as\rpossible. For classification purposes, each business object can refer to as many\rclassification systems as necessary.", "3": "EFFECTIVE DATE: date on which the data in this row came into effect.", "4": "EXPIRY DATE: Date on which the data in this row of data was no longer in effect.", "5": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "6": "REMARK: Narrative remarks about this row of data.", "7": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "8": "SOURCE DOCUMENT: Foreign key from the table that captures bibliographic or\rsource information. This could be a URL, book, publication or other document.", "9": "SYSTEM DEFINITION: A textual definition of this classification system.", "10": "CLASSIFICATION SYSTEM NAME: The name assigned to the classificaiton system.", "11": "CLASSIFICATION SYSTEM OWNER: the business associate who is the owner or\rcustodian of the classification system.", "12": "CLASSIFICATION SYSTEM REFERENCE NUMBER: A reference number assigned\rto a classification system, possibly by the owner. These reference numbers may not\rbe unique.", "13": "SYSTEM VERSION: The version number of the classification system.", "14": "ROW CHANGED BY: Application login id of the user who last changed the row.", "15": "ROW CHANGED DATE: System date of the last time the row was changed.", "16": "ROW CREATED BY: System user who created this row of data.", "17": "ROW CREATED DATE: Date that the row was created on.", "18": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "19": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "20": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}