{"CONSENT_BA": {"Column Name": {"0": "CONSENT_ID", "1": "CONSENT_BA_OBS_NO", "2": "ACTIVE_IND", "3": "BUSINESS_ASSOCIATE_ID", "4": "DESCRIPTION", "5": "EFFECTIVE_DATE", "6": "EXPIRY_DATE", "7": "FULL_NAME", "8": "PPDM_GUID", "9": "REMARK", "10": "ROLE", "11": "SOURCE", "12": "ROW_CHANGED_BY", "13": "ROW_CHANGED_DATE", "14": "ROW_CREATED_BY", "15": "ROW_CREATED_DATE", "16": "ROW_EFFECTIVE_DATE", "17": "ROW_EXPIRY_DATE", "18": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "NUMBER", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "DATE", "6": "DATE", "7": "VARCHAR2", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "DATE", "14": "VARCHAR2", "15": "DATE", "16": "DATE", "17": "DATE", "18": "VARCHAR2"}, "Length": {"0": "40", "1": "8", "2": "1", "3": "40", "4": "2000", "5": "DATE", "6": "DATE", "7": "255", "8": "38", "9": "2000", "10": "40", "11": "40", "12": "30", "13": "DATE", "14": "30", "15": "DATE", "16": "DATE", "17": "DATE", "18": "40"}, "Key": {"0": "P", "1": "P", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN}, "Ref Table(s)": {"0": "CONSENT", "1": NaN, "2": NaN, "3": "BUSINESS_ASSOCIATE", "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": "R_CONSENT_BA_ROLE", "11": "R_SOURCE", "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "LAND RIGHT CONSENT: Consents grant permission to conduct operations based\ron approval of what is done or proposed by another. Conditions, including actions to\rbe taken or fees to be paid, may or may not be applied against the consent.", "1": "CONSENT BA IDENTIFIER: a unique identifier added to allow people or companies\rto be associated with the consent. These people or companies may be validated\ragainst the business associates table or simple stored in an unvalidated column\rdepending what you need to do with the data.", "2": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "3": "BUSINESS ASSOCIATE: unique identifier for the business associate who is involved\rwith the consent. This column and FK are optional, if desired this validated column\rmay be used or an unvalidated column (FULL NAME) may be used instead.", "4": "DESCRIPTION: Narrative description about the role played by a business associate\rin the consent.", "5": "EFFECTIVE DATE: date on which the data in this row came into effect.", "6": "EXPIRY DATE: Date on which the data in this row of data was no longer in effect.", "7": "FULL NAME: unvalidated column to allow associations between persons and\rcompanies that are not in the BA table.", "8": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "9": "REMARK: Narrative remarks about this row of data.", "10": "CONSENT BUSINESS ASSOCIATE ROLE: Describes the role played by a business\rassociate in obtaining a consent, such as signing authority, chief negotiator etc.", "11": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "12": "ROW CHANGED BY: Application login id of the user who last changed the row.", "13": "ROW CHANGED DATE: System date of the last time the row was changed.", "14": "ROW CREATED BY: System user who created this row of data.", "15": "ROW CREATED DATE: Date that the row was created on.", "16": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "17": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "18": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}