{"CONT_MKTG_ELECT_SUBST": {"Column Name": {"0": "CONTRACT_ID", "1": "OPERATING_PROCEDURE_ID", "2": "SUBSTANCE_ID", "3": "SUBSTANCE_OBS_NO", "4": "ACTIVE_IND", "5": "BOTH_IND", "6": "EFFECTIVE_DATE", "7": "ELECTION_COST", "8": "ELECTION_COST_QUALIFIER", "9": "ELECTION_PERCENT", "10": "ELECTION_PERCENT_QUALIFIE", "11": "EXPIRY_DATE", "12": "PPDM_GUID", "13": "REMARK", "14": "SOURCE", "15": "SUBSTANCE_OUOM", "16": "SUBSTANCE_UOM", "17": "ROW_CHANGED_BY", "18": "ROW_CHANGED_DATE", "19": "ROW_CREATED_BY", "20": "ROW_CREATED_DATE", "21": "ROW_EFFECTIVE_DATE", "22": "ROW_EXPIRY_DATE", "23": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "N", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "NUMBER", "4": "VARCHAR2", "5": "VARCHAR2", "6": "DATE", "7": "NUMBER", "8": "VARCHAR2", "9": "NUMBER", "10": "VARCHAR2", "11": "DATE", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "DATE", "19": "VARCHAR2", "20": "DATE", "21": "DATE", "22": "DATE", "23": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "40", "3": "8", "4": "1", "5": "1", "6": "DATE", "7": "12,2", "8": "40", "9": "15,12", "10": "40", "11": "DATE", "12": "38", "13": "2000", "14": "40", "15": "40", "16": "40", "17": "30", "18": "DATE", "19": "30", "20": "DATE", "21": "DATE", "22": "DATE", "23": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": "P", "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN}, "Ref Table(s)": {"0": "CONT_OPER_PROC", "1": "CONT_OPER_PROC", "2": "SUBSTANCE", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": "R_SOURCE", "15": "PPDM_UNIT_OF_MEASURE", "16": "PPDM_UNIT_OF_MEASURE", "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "CONTRACT ID: Unique identifier for the contract table.", "1": "OPERATING PROCEDURE IDENTIFIER: Unique identifier for the operating\rprocedure.", "2": "SUBSTANCE IDENTIFIER: Unique identifier for a substance that can be described\reither chemically or in terms of composition. Elements, ions, isotopes, isomers,\rminerals, chemicals, solvents, production substances, hydrocarbons etc are all listed.\rBe advised that many applications and agencies may use the same term, but the\rdefinition and composition details may not be the same. Use the SUBSTANCE XREF\rtable to capture relationships between substances, such as similar substances.", "3": "SUBSTANCE OBSERVATION NUMBER: A unique number allowing a substance to\rbe a marketing election substance off and on throughout the lifetime of the contract.\rUse the ACTIVE IND to determine which rows of data are currently valid.", "4": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "5": "BOTH INDICATOR: A yes / no flag indicating whether the election cost and the\relection percent must be added to obtain the complete sum for the election. If set to\rY, they must be added. If set to N, only the populated column is relevant.", "6": "EFFECTIVE DATE: The date that an associated substance(s) was valid to be\rmarketed by the operator on behalf of the joint account.", "7": "ELECTION COST: an amount or fee associated with a specified business associate\relection (e.g. marketing fee is equal to a specified flat fee of M3 production of natural\rgas liquids - CAPL 1990 Operating Procedure)", "8": "ELECTION COST QUALIFIER: a restriction on the amount to be charged for\rmarketing substances on behalf of a business associate by the operator. (e.g. not to\rexceed, etc.)", "9": "ELECTION PERCENT: a percentage marketing fee to be charged by the operator on\rall production produced on behalf of a business associate not taking produced\rsubstance in kind.", "10": "ELECTION PERCENT QUALIFIER: a restriction on the percentage of the marketing\rfee to be charged on produced substance(s) by the operator. (e.g. not to exceed,\retc.)", "11": "EXPIRY DATE: the date on which this row of data is no longer in effect from a\rbusiness perspective.", "12": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "13": "REMARK: Narrative remarks about this row of data.", "14": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "15": "SUBSTANCE ORIGINAL UNITS OF MEASURE: the original units of measure\rdeclared for the substance in the contract. (e.g. contract may state bbls.)", "16": "SUBSTANCE UOM: The current units of measure for a specified substance that is\rbeing used in the conduct of business. (not indicated in contract)", "17": "ROW CHANGED BY: Application login id of the user who last changed the row.", "18": "ROW CHANGED DATE: System date of the last time the row was changed.", "19": "ROW CREATED BY: System user who created this row of data.", "20": "ROW CREATED DATE: Date that the row was created on.", "21": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "22": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "23": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}