{"CONTRACT": {"Column Name": {"0": "CONTRACT_ID", "1": "ACTIVE_IND", "2": "AMI_AOE_IND", "3": "AREA_ID", "4": "AREA_TYPE", "5": "ASSIGNMENT_PROC_IND", "6": "CASING_POINT_ELECTION", "7": "CLOSING_DATE", "8": "CONFIDENTIAL_IND", "9": "CONTRACT_NAME", "10": "CONTRACT_NUM", "11": "CURRENCY_CONVERSION", "12": "CURRENCY_OUOM", "13": "EFFECTIVE_DATE", "14": "EXPIRY_DATE", "15": "EXTENSION_CONDITION", "16": "GOVERNING_CONTRACT_IND", "17": "LIABILITY_PERIOD", "18": "LIABILITY_PERIOD_OUOM", "19": "LIABILITY_RELEASE_DATE", "20": "NAT_CURRENCY_CONVERSION", "21": "NAT_CURRENCY_UOM", "22": "OPERATING_PROC_IND", "23": "PPDM_GUID", "24": "PRIMARY_TERM", "25": "PRIMARY_TERM_OUOM", "26": "REMARK", "27": "ROFR_IND", "28": "SECONDARY_TERM", "29": "SECONDARY_TERM_OUOM", "30": "SOURCE", "31": "SOURCE_DOCUMENT", "32": "SURRENDER_NOTICE_TERM", "33": "SURRENDER_NOTICE_TERM_O", "34": "TERMINATION_DATE", "35": "VOTING_PROC_IND", "36": "ROW_CHANGED_BY", "37": "ROW_CHANGED_DATE", "38": "ROW_CREATED_BY", "39": "ROW_CREATED_DATE", "40": "ROW_EFFECTIVE_DATE", "41": "ROW_EXPIRY_DATE", "42": "ROW_QUALITY"}, "Null": {"0": "N", "1": "Y", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y", "33": "OYM", "34": "Y", "35": "Y", "36": "Y", "37": "Y", "38": "Y", "39": "Y", "40": "Y", "41": "Y", "42": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "VARCHAR2", "7": "DATE", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "NUMBER", "12": "VARCHAR2", "13": "DATE", "14": "DATE", "15": "VARCHAR2", "16": "VARCHAR2", "17": "NUMBER", "18": "VARCHAR2", "19": "DATE", "20": "NUMBER", "21": "VARCHAR2", "22": "VARCHAR2", "23": "VARCHAR2", "24": "NUMBER", "25": "VARCHAR2", "26": "VARCHAR2", "27": "VARCHAR2", "28": "NUMBER", "29": "VARCHAR2", "30": "VARCHAR2", "31": "VARCHAR2", "32": "NUMBER", "33": "VARCHAR2", "34": "DATE", "35": "VARCHAR2", "36": "VARCHAR2", "37": "DATE", "38": "VARCHAR2", "39": "DATE", "40": "DATE", "41": "DATE", "42": "VARCHAR2"}, "Length": {"0": "40", "1": "1", "2": "1", "3": "40", "4": "40", "5": "1", "6": "40", "7": "DATE", "8": "1", "9": "255", "10": "30", "11": "10,5", "12": "40", "13": "DATE", "14": "DATE", "15": "40", "16": "1", "17": "10,5", "18": "40", "19": "DATE", "20": "10,5", "21": "40", "22": "1", "23": "38", "24": "10,5", "25": "40", "26": "2000", "27": "1", "28": "10,5", "29": "40", "30": "40", "31": "40", "32": "10,5", "33": "40", "34": "DATE", "35": "1", "36": "30", "37": "DATE", "38": "30", "39": "DATE", "40": "DATE", "41": "DATE", "42": "40"}, "Key": {"0": "P", "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN, "37": NaN, "38": NaN, "39": NaN, "40": NaN, "41": NaN, "42": NaN}, "Ref Table(s)": {"0": "CONT_AREA", "1": NaN, "2": NaN, "3": "CONT_AREA", "4": "CONT_AREA", "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": "PPDM_UNIT_OF_MEASURE", "13": NaN, "14": NaN, "15": "R_CONT_EXTEND_COND", "16": NaN, "17": NaN, "18": "PPDM_UNIT_OF_MEASURE", "19": NaN, "20": NaN, "21": "PPDM_UNIT_OF_MEASURE", "22": NaN, "23": NaN, "24": NaN, "25": "PPDM_UNIT_OF_MEASURE", "26": NaN, "27": NaN, "28": NaN, "29": "PPDM_UNIT_OF_MEASURE", "30": "R_SOURCE", "31": "SOURCE_DOCUMENT", "32": NaN, "33": "PPDM_UNIT_OF_MEASURE", "34": NaN, "35": NaN, "36": NaN, "37": NaN, "38": NaN, "39": NaN, "40": NaN, "41": NaN, "42": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "CONTRACT ID: Unique identifier for the contract table.", "1": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "2": "AREA OF MUTUAL INTEREST OR AREA OF EXCLUSION INDICATOR: indicates\rthat this contract is subject to an AREA OF MUTUAL INTEREST OR AN AREA OF\rEXCLUSION. The type of contract is found in the CONTRACT TYPE table. This\rdenormalized value is added for query performance.", "3": "AREA ID: Unique identifier for any named area such as a country, province, project\rarea, area of interest, offshore area, district etc.", "4": "AREA TYPE ID: Unique identifier for the type of area, such as country, state, AOI etc.", "5": "ASSIGNMENT PROCEDURE INDICATOR: A yes / no flag indicating that an industry\rstandard assignment procedure is allowed to be used by current parties in the\rcontract to assign interests in the contract which greatly reduces the cycle time of\rbusiness associate recognition in a contract. (i.e. only signatures of assignor and\rassignee are required with c.c. to all other current parties in the master agreement)\r(This is currently only used in Canada, Notice of Assignment Procedure)", "6": "CASING POINT ELECTION: A decision is made by all business associates at the\ragreed objective depth ( either a specified depth or the depth at which a specific zone\ris penetrated) whether or not they are participating in the costs associated with\rsetting a production string of casing. (Non-participation either creates a penalty\rposition or forfeiture of interest in the zone)", "7": "CLOSING DATE: the date at which an agreement was consummated by performing\rsomething previously agreed upon. (used in Purchase and Sale Agreements)", "8": "CONFIDENTIAL INDICATOR: a yes/no flag indicating that the contract is considered\rconfidential.", "9": "CONTRACT NAME: The full name of the contract as it appears on the formal\rdocument.", "10": "CONTRACT NUMBER: the primary or usually accessed file number assigned to the\rcontract. Alternate name and numbers reside in the CONT ALIAS table.", "11": "CURRENCY CONVERSION RATE: the rate of conversion so that the stored\rcurrency value multiplied by the conversion rate will obtain the currency in the original\runits of measure at the time of conversion. This conversion rate is valid for all\rsubordinate tables as well.", "12": "CURRENCY ORIGINAL UNITS OF MEASURE: the original units of measure for the\rcontract. The default storage UOM is tracked in PPDM COLUMN.", "13": "EFFECTIVE DATE: the date on which the contract was first in effect.", "14": "EXPIRY DATE: the date on which this row of data is no longer in effect from a\rbusiness perspective.", "15": "EXTENSION CONDITION: The method by which the contract may be managed or\rextended over its life time. For example, a contract may be held by production, held\rfor the life of the lease, evergreen (goes year to year until one party terminates) or\rmustbe renegotiated at the end of the primary term. In some cases, specific\rconditions must be met for the contract to extend past the primary term.", "16": "GOVERNING CONTRACT INDICATOR: a yes / no flag indicating that the contract is\ra governing contract FOR A FACILITY, OPERATIONS AND INTERESTS or for\rspecified zones and substances described by a location.", "17": "LIABILITY PERIOD: the period of time that you are responsible for any obligations\rthat have not yet been met. May be financial or non-financial.", "18": "LIBIALITY PERIOD ORIGINAL UNIT OF MEASURE: The original unit of measure for\rthe liability period", "19": "LIABILITY RELEASE DATE: The date that you are no longer liable for obligations\rrelated to the contract.", "20": "NATIONAL CURRENCY CONVERSION: The conversion rate required to convert the\rstored currency to the national currency using the conversion rate at the time the\rcontract was in effect. This value is relevant for all contract rows subordinate to this\rone.", "21": "NATIONAL CURRENCY UNITS OF MEASURE: The units of measure for the\rnational currency.", "22": "OPERATING PROCEDURE INDICATOR: a Y/N flag indicating whether this contract\rhas an operating procedure in effect. See CONT OPER PROC for details.", "23": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "24": "PRIMARY TERM: usually used for special types of contracts where a specified time\rperiod is required for the conduct of business.", "25": "PRIMARY TERM OUOM: An original unit of measure in terms of days, months or\ryears for a contract.", "26": "REMARK: Narrative remarks about this row of data.", "27": "RIGHT OF FIRST REFUSAL INDICATOR: A yes / no flag indicating that there is a\rright of first refusal associated with this contract. (N=consent cannot be unreasonably\rheld and Y=right to exercise right of first refusal) Right of first refusal for assignment,\rsale or disposition of interest.", "28": "SECONDARY TERM: secondary or additional term of the agreement for special\rtypes of contracts in which the term of the contract is extended.", "29": "SECONDARY TERM ORIGINAL UNIT OF MEASURE: the original units for the\rsecondary term of the contract as defined in the contract. The stored unit of measure\rcan be found in the PPDM COLUMN table.", "30": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "31": "SOURCE DOCUMENT: A list of documents that are used as the source for supplying\rdata. Source documents may include government and regulatory forms, operator\rreports or scout tickets, publications, news letters, books or journals.", "32": "SURRENDER NOTICE TERM: The time period which notification must be served to\rsurrender an interest in the joint lands. (e.g. before the next rental date: 60 days)", "33": "SURRENDER NOTICE TERM ORIGINAL UNITS OF MEASURE: The unit of\rmeasure for the surrender notice term as defined in the contract. The stored units\rcan be found in PPDM COLUMN.", "34": "TERMINATION DATE: The date on which the contract was terminated. (e.g. occurs\rwhen all associated land rights have expired or when all obligations of a contract\rhave been met and no further operations are required)", "35": "VOTING PROCEDURE INDICATOR: A Y/N flag indicating whether this contract has\ra voting procedure in effect. See CONT VOTING PROC for details.", "36": "ROW CHANGED BY: Application login id of the user who last changed the row.", "37": "ROW CHANGED DATE: System date of the last time the row was changed.", "38": "ROW CREATED BY: System user who created this row of data.", "39": "ROW CREATED DATE: Date that the row was created on.", "40": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "41": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "42": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}