{"EQUIPMENT_MAINTAIN": {"Column Name": {"0": "EQUIPMENT_ID", "1": "EQUIP_MAINT_ID", "2": "ACTIVE_IND", "3": "ACTUAL_END_DATE", "4": "ACTUAL_START_DATE", "5": "CATALOGUE_EQUIP_ID", "6": "COMPLETED_BY_BA_ID", "7": "EFFECTIVE_DATE", "8": "END_DATE", "9": "EXPIRY_DATE", "10": "FAILURE_IND", "11": "LOCATION_BA_ADDRESS_OBS_", "12": "LOCATION_BA_ID", "13": "LOCATION_BA_SOURCE", "14": "MAINT_LOCATION_TYPE", "15": "MAINT_REASON", "16": "MAINT_TYPE", "17": "PPDM_GUID", "18": "PROJECT_ID", "19": "REMARK", "20": "SCHEDULED_DATE", "21": "SCHEDULED_IND", "22": "SOURCE", "23": "START_DATE", "24": "SYSTEM_CONDITION", "25": "ROW_CHANGED_BY", "26": "ROW_CHANGED_DATE", "27": "ROW_CREATED_BY", "28": "ROW_CREATED_DATE", "29": "ROW_EFFECTIVE_DATE", "30": "ROW_EXPIRY_DATE", "31": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "OY", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "DATE", "4": "DATE", "5": "VARCHAR2", "6": "VARCHAR2", "7": "DATE", "8": "DATE", "9": "DATE", "10": "VARCHAR2", "11": "NUMBER", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "VARCHAR2", "19": "VARCHAR2", "20": "DATE", "21": "VARCHAR2", "22": "VARCHAR2", "23": "DATE", "24": "VARCHAR2", "25": "VARCHAR2", "26": "DATE", "27": "VARCHAR2", "28": "DATE", "29": "DATE", "30": "DATE", "31": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "1", "3": "DATE", "4": "DATE", "5": "40", "6": "40", "7": "DATE", "8": "DATE", "9": "DATE", "10": "1", "11": "8", "12": "40", "13": "40", "14": "40", "15": "40", "16": "40", "17": "38", "18": "40", "19": "2000", "20": "DATE", "21": "1", "22": "40", "23": "DATE", "24": "40", "25": "30", "26": "DATE", "27": "30", "28": "DATE", "29": "DATE", "30": "DATE", "31": "40"}, "Key": {"0": "P", "1": "P", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN}, "Ref Table(s)": {"0": "EQUIPMENT", "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": "EQUIPMENT_MAINT_TYPE", "6": "BUSINESS_ASSOCIATE", "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": "BA_ADDRESS", "12": "BA_ADDRESS", "13": "BA_ADDRESS", "14": "R_EQUIP_MAINT_LOC", "15": "R_EQUIP_MAINT_REASON", "16": "EQUIPMENT_MAINT_TYPE", "17": NaN, "18": "PROJECT", "19": NaN, "20": NaN, "21": NaN, "22": "R_SOURCE", "23": NaN, "24": "R_EQUIP_SYSTEM_CONDITIO\rN", "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "EQUIPMENT IDENTIFIER: Unique identifier for a specific peice of equipment.", "1": "EQUIPMENT MAINTENANCE IDENTIFIER: Unique identifier for a maintenance\ractivity.", "2": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "3": "ACTUAL END DATE: The date that a maintenance event was actually completed.", "4": "ACTUAL START DATE: The date that a maintenance event actually started.", "5": "EQUIPMENT CATALOGUE IDENTIFIER: Unique identifier for the list of kinds of\requipment. Think of this as a catalogue or brochure that shows all the kinds of\requipment that you may use, but may or may not actually have. Actual peices of\requipment that exist are defined in the table EQUIPMENT.", "6": "COMPLETED BY BUSINESS ASSOCIATE: unique identifier for the business\rassociate who did the actual maintenance.", "7": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "8": "END DATE: the date that the maintenance was completed", "9": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "10": "FAILURE IND: A Y/N flag indicating that this maintenance occurred because of a\rmalfunction or other failure, and was not part of a regular maintenance schedule.", "11": "LOCATION BA ADDRESS OBSERVATION NUMBER: Unique identifier for the\rbusiness associate whose location the calibration work was completed. These\rprojects may be completed off site or on site, depending on how movable equipment\ris. Part of Foreign key.", "12": "LOCATION BUSINESS ASSOCIATE IDENTIFIER: Unique identifier for the business\rassociate whose location the calibration work was completed. These projects may be\rcompleted off site or on site, depending on how movable equipment is.", "13": "LOCATION BA ADDRESS SOURCE: Unique identifier for the business associate\rwhose location the calibration work was completed. These projects may be\rcompleted off site or on site, depending on how movable equipment is. Part of\rForeign key.", "14": "MAINTENANCE LOCATION TYPE: Whether the maintenance activity was\rconducted on site, off site or in some specified location (Delaware warehouse) or\rtype of location (such a maintenance yard).", "15": "MAINTENANCE REASON: The reason why this maintenance activity was\rundertaken, such as preventative maintenance, predictive maintenance, failure etc.", "16": "MAINTENANCE TYPE: For each type of equipment, the kinds of maintenance that\rcan be performed on it, from oil changes to calibration or complete restoration.", "17": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "18": "PROJECT IDENTIFIER: Unique id for the project that describes the details of a\rmaintenance run that is too complex for this table to handle fully.", "19": "REMARK: Narrative remarks about this row of data.", "20": "SCHEDULED DATE: The date that maintenance is scheduled to be performed. You\rcan create a row in this table for maintenance scheduled in the future if you wish.", "21": "SCHEDULED IND: A Y/N flag indicating that this maintenance occurred according to\ra schedule and was not the consequence of a failure.", "22": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "23": "START DATE: the date that the maintenance was started.", "24": "EQUIPMENT SYSTEM CONDITION: A list of conditions that equipment must be in\rfor maintenance to occur, such as shut down, moved to repair yard etc.", "25": "ROW CHANGED BY: Application login id of the user who last changed the row.", "26": "ROW CHANGED DATE: System date of the last time the row was changed.", "27": "ROW CREATED BY: System user who created this row of data.", "28": "ROW CREATED DATE: Date that the row was created on.", "29": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "30": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "31": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}