{"EQUIPMENT_XREF": {"Column Name": {"0": "EQUIPMENT_ID", "1": "EQUIPMENT_PART_ID", "2": "EQUIPMENT_XREF_OBS_NO", "3": "ACTIVE_IND", "4": "COMMISSION_DATE", "5": "DECOMMISSION_DATE", "6": "DESCRIPTION", "7": "EFFECTIVE_DATE", "8": "EQUIP_XREF_TYPE", "9": "EXPIRY_DATE", "10": "INTERCHANGABLE_IND", "11": "PPDM_GUID", "12": "REMARK", "13": "SOURCE", "14": "ROW_CHANGED_BY", "15": "ROW_CHANGED_DATE", "16": "ROW_CREATED_BY", "17": "ROW_CREATED_DATE", "18": "ROW_EFFECTIVE_DATE", "19": "ROW_EXPIRY_DATE", "20": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "NUMBER", "3": "VARCHAR2", "4": "DATE", "5": "DATE", "6": "VARCHAR2", "7": "DATE", "8": "VARCHAR2", "9": "DATE", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "DATE", "16": "VARCHAR2", "17": "DATE", "18": "DATE", "19": "DATE", "20": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "8", "3": "1", "4": "DATE", "5": "DATE", "6": "1024", "7": "DATE", "8": "40", "9": "DATE", "10": "1", "11": "38", "12": "2000", "13": "40", "14": "30", "15": "DATE", "16": "30", "17": "DATE", "18": "DATE", "19": "DATE", "20": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN}, "Ref Table(s)": {"0": "EQUIPMENT", "1": "EQUIPMENT", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": "R_EQUIP_XREF_TYPE", "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": "R_SOURCE", "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "EQUIPMENT IDENTIFIER: Unique identifier for a specific peice of equipment.", "1": "EQUIPMENT PART IDENTIFIER: Unique identifier for a peice of equipment that is\rnow part of a composite peice of equipment that is used as an whole. Over time,\rparts of the whole object may be replaced, repaired or reconfigured.", "2": "EQUIPMENT CROSS REFERENCE OBSERVATION NUMBER: A unique primary\rkey component added so that composite equipment may capture relationships\rbetween specific components more than once over a life time. For example, a rig\rmay be comprised of many parts, some of which are in service from time to time.", "3": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "4": "COMMISSION DATE: The date when this peice of equipment was commissioned as\ra part of this composite.", "5": "DECOMMISSION DATE: The date when this peice of equipment was\rdecommissioned as a part of this composite.", "6": "DESCRIPTION: a textual description of the equipment.", "7": "EFFECTIVE DATE: the date on which this row of data first came into effect from a\rbusiness perspective.", "8": "EQUIPMENT CROSS REFERENCE TYPE: the type of relationship between two\rpieces of equipment, often indicating one piece that can or has replaced another.\rMay also be used to indicate equipment that has the same function, and are\rtherefore equivalent. May be used to indicate the installation of one piece of\requipment with or in another.", "9": "EXPIRY DATE: the date on which this row of data is no longer in effect from a\rbusiness perspective.", "10": "INTERCHANGABLE IND: A Y/N flag indicating whether this part can be interchanged\rwith another part once installed. Y indicates the part can be removed and exchanged\rwith another part. N indicates that it cannot be removed or exchanged with another\rpart.", "11": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "12": "REMARK: Narrative remarks about this row of data.", "13": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "14": "ROW CHANGED BY: Application login id of the user who last changed the row.", "15": "ROW CHANGED DATE: System date of the last time the row was changed.", "16": "ROW CREATED BY: System user who created this row of data.", "17": "ROW CREATED DATE: Date that the row was created on.", "18": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "19": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "20": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}