{"EQUIPMENT": {"Column Name": {"0": "EQUIPMENT_ID", "1": "ACQUIRE_DATE_NEW", "2": "ACTIVE_IND", "3": "CATALOGUE_EQUIP_ID", "4": "COMMISSION_DATE", "5": "CURRENT_OWNER_BA_ID", "6": "DECOMMISSION_DATE", "7": "DESCRIPTION", "8": "EFFECTIVE_DATE", "9": "EQUIPMENT_GROUP", "10": "EQUIPMENT_NAME", "11": "EQUIPMENT_TYPE", "12": "EXPIRY_DATE", "13": "MANUFACTURER_BA_ID", "14": "PPDM_GUID", "15": "PURCHASE_DATE", "16": "REFERENCE_NUM", "17": "REMARK", "18": "SERIAL_NUM", "19": "SOURCE", "20": "ROW_CHANGED_BY", "21": "ROW_CHANGED_DATE", "22": "ROW_CREATED_BY", "23": "ROW_CREATED_DATE", "24": "ROW_EFFECTIVE_DATE", "25": "ROW_EXPIRY_DATE", "26": "ROW_QUALITY"}, "Null": {"0": "N", "1": "Y", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "DATE", "2": "VARCHAR2", "3": "VARCHAR2", "4": "DATE", "5": "VARCHAR2", "6": "DATE", "7": "VARCHAR2", "8": "DATE", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "DATE", "13": "VARCHAR2", "14": "VARCHAR2", "15": "DATE", "16": "VARCHAR2", "17": "VARCHAR2", "18": "VARCHAR2", "19": "VARCHAR2", "20": "VARCHAR2", "21": "DATE", "22": "VARCHAR2", "23": "DATE", "24": "DATE", "25": "DATE", "26": "VARCHAR2"}, "Length": {"0": "40", "1": "DATE", "2": "1", "3": "40", "4": "DATE", "5": "40", "6": "DATE", "7": "1024", "8": "DATE", "9": "40", "10": "255", "11": "40", "12": "DATE", "13": "40", "14": "38", "15": "DATE", "16": "30", "17": "2000", "18": "30", "19": "40", "20": "30", "21": "DATE", "22": "30", "23": "DATE", "24": "DATE", "25": "DATE", "26": "40"}, "Key": {"0": "P", "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN}, "Ref Table(s)": {"0": NaN, "1": NaN, "2": NaN, "3": "CAT_EQUIPMENT", "4": NaN, "5": "BUSINESS_ASSOCIATE", "6": NaN, "7": NaN, "8": NaN, "9": "R_CAT_EQUIP_GROUP", "10": NaN, "11": "R_CAT_EQUIP_TYPE", "12": NaN, "13": "BUSINESS_ASSOCIATE", "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": "R_SOURCE", "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "EQUIPMENT IDENTIFIER: Unique identifier for a specific piece of equipment.", "1": "ACQUIRE DATE NEW: The date this new piece of equipment was acquired.", "2": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "3": "EQUIPMENT CATALOGUE IDENTIFIER: Unique identifier for the list of kinds of\requipment. Think of this as a catalogue or brochure that shows all the kinds of\requipment that you may use, but may or may not actually have. Actual pieces of\requipment thatexist are defined in the table EQUIPMENT.", "4": "COMMISSION DATE: The date when this piece of equipment was commissioned.", "5": "OWNER BA ID: Unique identifier for the current owner of this equipment.", "6": "DECOMMISSION DATE: The date when this piece of equipment was\rdecommissioned.", "7": "DESCRIPTION: a textual description of the equipment.", "8": "EFFECTIVE DATE: the date on which this row of data first came into effect from a\rbusiness perspective.", "9": "EQUIPMENT GROUP: The functional group of equipment types, such as vehicles,\rdrilling rigs, measuring equipment, monitoring equipment etc. Note that the function\rof this table may also be assumed by the CLASSIFICATION module for more robust\rand complete classifications. If you are using CAT EQUIPMENT modules, you may\rnot need to populate this column, as the information will be in CAT EQUIPMENT\ralready.", "10": "EQUIPMENT NAME: For specific types of equipment that are assigned names, such\ras rigs. This column should not be used to identify the type of equipment this is.", "11": "EQUIPMENT TYPE: the type of equipment that is listed, can be grouped into broad\rclassifications with R CAT EQUIP GROUP if you wish. Note that the function of this\rtable may also be assumed by the CLASSIFICATION module for more robust and\rcomplete classifications. If you are using CAT EQUIPMENT modules, you may not\rneed to populate this column, as the information will be in CAT EQUIPMENT already.", "12": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "13": "MANUFACTURER BUSINESS ASSOCIATE IDENTIFIER: Unique identifier for the\rbusiness associate who manufactured this piece of equipment.", "14": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "15": "PURCHASE DATE: The date that this piece of equipment was purchased.", "16": "EQUIPMENT REFERENCE NUMBER: A reference number that is assigned to\requipment, particularly if that number is not the same as the serial number.", "17": "REMARK: Narrative remarks about this row of data.", "18": "SERIAL NUMBER: For equipment that is assigned a serial number, usually\rpermanently affixed to a piece of equipment.", "19": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "20": "ROW CHANGED BY: Application login id of the user who last changed the row.", "21": "ROW CHANGED DATE: System date of the last time the row was changed.", "22": "ROW CREATED BY: System user who created this row of data.", "23": "ROW CREATED DATE: Date that the row was created on.", "24": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "25": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "26": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}