{"FACILITY_EQUIPMENT": {"Column Name": {"0": "FACILITY_ID", "1": "FACILITY_TYPE", "2": "EQUIPMENT_ID", "3": "INSTALL_OBS_NO", "4": "ACTIVE_IND", "5": "EFFECTIVE_DATE", "6": "EXPIRY_DATE", "7": "INSTALL_DATE", "8": "PPDM_GUID", "9": "REMARK", "10": "REMOVE_DATE", "11": "REMOVE_REASON", "12": "SOURCE", "13": "USE_DESCRIPTION", "14": "ROW_CHANGED_BY", "15": "ROW_CHANGED_DATE", "16": "ROW_CREATED_BY", "17": "ROW_CREATED_DATE", "18": "ROW_EFFECTIVE_DATE", "19": "ROW_EXPIRY_DATE", "20": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "N", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "NUMBER", "4": "VARCHAR2", "5": "DATE", "6": "DATE", "7": "DATE", "8": "VARCHAR2", "9": "VARCHAR2", "10": "DATE", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "DATE", "16": "VARCHAR2", "17": "DATE", "18": "DATE", "19": "DATE", "20": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "40", "3": "8", "4": "1", "5": "DATE", "6": "DATE", "7": "DATE", "8": "38", "9": "2000", "10": "DATE", "11": "40", "12": "40", "13": "1024", "14": "30", "15": "DATE", "16": "30", "17": "DATE", "18": "DATE", "19": "DATE", "20": 40}, "Key": {"0": "P", "1": "P", "2": "P", "3": "P", "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN}, "Ref Table(s)": {"0": "FACILITY", "1": "FACILITY", "2": "EQUIPMENT", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": "R_EQUIP_REMOVE_REASON", "12": "R_SOURCE", "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "FACILITY ID: Number or code uniquely identifying the Facility.", "1": "FACILITY TYPE: The type of facility that is described in this row of data, such as\rpipeline, tank, battery etc. This value is managed by check constraint and may only\rbe equal to the name of one of the valid subtypes. Please note that FACILITY_TYPE\rwill eventually become a SUBTYPE and downsized to 30 characters.", "2": "EQUIPMENT IDENTIFIER: Unique identifier for a specific peice of equipment.", "3": "INSTALLATION OBSERVATION NUMBER: A unique number added to allow the\rsame piece of equipment to be installed at the same logical facility location more than\ronce over time (it can be removed and reinstalled later on).", "4": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "5": "EFFECTIVE DATE: date on which the data in this row came into effect.", "6": "EXPIRY DATE: Date on which the data is no longer valid.", "7": "INSTALLED DATE: The date that this piece of equipment was installed in a logical\rfacility location. Over time, a piece of equipment may be installed in more than one\rlogical location, or a logical location may have equipment replacements or upgrades\rover time.", "8": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "9": "REMARK: Narrative remarks about this row of data.", "10": "REMOVED DATE: The date this piece of equipment was removed from a logical\rfacility location.", "11": "REMOVE REASON: The reason why this particular piece of equipment was removed\ror replaced, such as replace due to wear and tear (scheduled), replace due to failure,\rupgrade.", "12": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "13": "USE DESCRIPTION: Description of the use of the equipment, as narrative text.", "14": "ROW CHANGED BY: Application login id of the user who last changed the row.", "15": "ROW CHANGED DATE: System date of the last time the row was changed.", "16": "ROW CREATED BY: System user who created this row of data.", "17": "ROW CREATED DATE: Date that the row was created on.", "18": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "19": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "20": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}