{"FIN_COST_SUMMARY": {"Column Name": {"0": "COST_ID", "1": "ACTIVE_IND", "2": "AMI_IND", "3": "CONFIDENTIAL_IND", "4": "COST_AMOUNT", "5": "COST_PER_SIZE", "6": "COST_PER_SIZE_OUOM", "7": "COST_TYPE", "8": "CURRENCY_CONVERSION", "9": "CURRENCY_OUOM", "10": "EFFECTIVE_DATE", "11": "EXPIRY_DATE", "12": "FINANCE_COMPONENT_ID", "13": "FINANCE_ID", "14": "PAID_DATE", "15": "PARENT_COST_ID", "16": "PERCENT_OF_PARENT", "17": "PPDM_GUID", "18": "REMARK", "19": "REPORT_COST_IND", "20": "SOURCE", "21": "SUBMIT_DATE", "22": "ROW_CHANGED_BY", "23": "ROW_CHANGED_DATE", "24": "ROW_CREATED_BY", "25": "ROW_CREATED_DATE", "26": "ROW_EFFECTIVE_DATE", "27": "ROW_EXPIRY_DATE", "28": "ROW_QUALITY"}, "Null": {"0": "N", "1": "Y", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "NUMBER", "5": "NUMBER", "6": "VARCHAR2", "7": "VARCHAR2", "8": "NUMBER", "9": "VARCHAR2", "10": "DATE", "11": "DATE", "12": "VARCHAR2", "13": "VARCHAR2", "14": "DATE", "15": "VARCHAR2", "16": "NUMBER", "17": "VARCHAR2", "18": "VARCHAR2", "19": "VARCHAR2", "20": "VARCHAR2", "21": "DATE", "22": "VARCHAR2", "23": "DATE", "24": "VARCHAR2", "25": "DATE", "26": "DATE", "27": "DATE", "28": "VARCHAR2"}, "Length": {"0": "40", "1": "1", "2": "1", "3": "1", "4": "12,2", "5": "12,2", "6": "40", "7": "40", "8": "10,5", "9": "40", "10": "DATE", "11": "DATE", "12": "40", "13": "40", "14": "DATE", "15": "40", "16": "15,12", "17": "38", "18": "2000", "19": "1", "20": "40", "21": "DATE", "22": "30", "23": "DATE", "24": "30", "25": "DATE", "26": "DATE", "27": "DATE", "28": "40"}, "Key": {"0": "P", "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN}, "Ref Table(s)": {"0": NaN, "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": "PPDM_UNIT_OF_MEASURE", "7": "R_FIN_COST_TYPE", "8": NaN, "9": "PPDM_UNIT_OF_MEASURE", "10": NaN, "11": NaN, "12": "FIN_COMPONENT", "13": "FINANCE FIN_COMPONENT", "14": NaN, "15": "FIN_COST_SUMMARY", "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": "R_SOURCE", "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "COST ID: unique identifier for each cost.", "1": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "2": "AMI IND: Indicates the cost was incurred for an AMI created under a contract", "3": "CONFIDENTIAL IND: Indicates the cost is confidential and should not be disclosed to\rother parties.", "4": "COST AMOUNT: The gross cost.", "5": "COST PER SIZE: The cost per size unit (such as dollars per km)", "6": "COST PER SIZE OUOM: original unit of measure used, such as Cdn dollars per km", "7": "FINANCE CENTER COST TYPE: the type of cost associated with the AFE or cost\rcenter.", "8": "CURRENCY CONVERSION RATE: the rate applied to convert the currency from its\roriginal monetary UOM to the stored UOM. This value is valid for this row in this table\ronly. When this value is multiplied by the STORED currency value, the original value\rof the transaction in the original currency is obtained.", "9": "CURRENCY ORIGINAL UNITS OF MEASURE: the currency in which the funds were\rinitially received. When the Stored currency is multiplied by the CURRENCY\rCONVERSION, the value of the transaction in the original currency is obtained.", "10": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "11": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "12": "AFE COMPONENT IDENTIFIER: Unique identifier for the AFE Component. Each\rbusiness object that is associated with this AFE should have its own component ID.", "13": "FINANCE SUIMMARY IDENTIFIER: Summary information about a financial\rreference, such as an AFE for an activity, such as seismic acquisition or processing.\rCould be a cost center or any other reference number.", "14": "PAID DATE: The date that this cost was paid. For details on fulfillment, use the\robligation module.", "15": "PARENT COST IDENTIFIER: unique identifier for the cost that is the parent of this\rreported cost. Used in the case where cost breakdowns and summaries are reported.\rUse the REPORT COST IND flag to ensure that costs are not reported or added\rmore than once in summaries.", "16": "PERCENT OF PARENT: If you are using the parent costs relationship to track the\rallocation of costs this value is used to record how much of the parent costs have\rbeen allocated to the subordinate cost.", "17": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "18": "REMARK: Narrative remarks about this row of data.", "19": "REPORT COSTS INDICATOR: A yes / no flag indicating whether these costs are\rincluded in a cost report. If you are using the parent costs relationship to track the\rallocation of costs, this flag is used to ensure that you do not reports costs twice.", "20": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "21": "SUBMIT DATE: the date that this cost was submitted.", "22": "ROW CHANGED BY: Application login id of the user who last changed the row.", "23": "ROW CHANGED DATE: System date of the last time the row was changed.", "24": "ROW CREATED BY: System user who created this row of data.", "25": "ROW CREATED DATE: Date that the row was created on.", "26": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "27": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "28": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}