{"INT_SET_PARTNER": {"Column Name": {"0": "INTEREST_SET_ID", "1": "INTEREST_SET_SEQ_NO", "2": "PARTNER_BA_ID", "3": "PARTNER_OBS_NO", "4": "ACTIVE_IND", "5": "ADDRESS_OBS_NO", "6": "ADDRESS_SOURCE", "7": "BREACH_DESC", "8": "BREACH_IND", "9": "CHANGE_REASON", "10": "CONFIDENTIAL_IND", "11": "CONTRACT_ID", "12": "EFFECTIVE_DATE", "13": "ESCROW_DESC", "14": "ESCROW_IND", "15": "EXPIRY_DATE", "16": "GROSS_FRACT_INTEREST", "17": "GROSS_PERCENT_INTEREST", "18": "INACTIVE_DATE", "19": "INSTRUMENT_ID", "20": "INTEREST_SET_ROLE", "21": "NET_FRACT_INTEREST", "22": "NET_PERCENT_INTEREST", "23": "PENALTY_IND", "24": "PPDM_GUID", "25": "PROVISION_ID", "26": "REMARK", "27": "RIGHT_TO_EARN_DESC", "28": "RIGHT_TO_EARN_IND", "29": "SOURCE", "30": "TITLE_OWN_TYPE", "31": "UNIT_OPERATED_IND", "32": "ROW_CHANGED_BY", "33": "ROW_CHANGED_DATE", "34": "ROW_CREATED_BY", "35": "ROW_CREATED_DATE", "36": "ROW_EFFECTIVE_DATE", "37": "ROW_EXPIRY_DATE", "38": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "N", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y", "33": "Y", "34": "Y", "35": "Y", "36": "Y", "37": "Y", "38": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "NUMBER", "2": "VARCHAR2", "3": "NUMBER", "4": "VARCHAR2", "5": "NUMBER", "6": "VARCHAR2", "7": "VARCHAR2", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "DATE", "13": "VARCHAR2", "14": "VARCHAR2", "15": "DATE", "16": "VARCHAR2", "17": "NUMBER", "18": "DATE", "19": "VARCHAR2", "20": "VARCHAR2", "21": "VARCHAR2", "22": "NUMBER", "23": "VARCHAR2", "24": "VARCHAR2", "25": "VARCHAR2", "26": "VARCHAR2", "27": "VARCHAR2", "28": "VARCHAR2", "29": "VARCHAR2", "30": "VARCHAR2", "31": "VARCHAR2", "32": "VARCHAR2", "33": "DATE", "34": "VARCHAR2", "35": "DATE", "36": "DATE", "37": "DATE", "38": "VARCHAR2"}, "Length": {"0": "40", "1": "8", "2": "40", "3": "8", "4": "1", "5": "8", "6": "40", "7": "240", "8": "1", "9": "240", "10": "1", "11": "40", "12": "DATE", "13": "240", "14": "1", "15": "DATE", "16": "100", "17": "15,12", "18": "DATE", "19": "40", "20": "40", "21": "100", "22": "15,12", "23": "1", "24": "38", "25": "40", "26": "2000", "27": "240", "28": "1", "29": "40", "30": "40", "31": "1", "32": "30", "33": "DATE", "34": "30", "35": "DATE", "36": "DATE", "37": "DATE", "38": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": "P", "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN, "37": NaN, "38": NaN}, "Ref Table(s)": {"0": "INTEREST_SET", "1": "INTEREST_SET", "2": "BUSINESS_ASSOCIATE\rBA_ADDRESS", "3": NaN, "4": NaN, "5": "BA_ADDRESS", "6": "BA_ADDRESS", "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": "CONTRACT\rCONT_PROVISION", "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": "INSTRUMENT", "20": "R_INT_SET_ROLE", "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": "CONT_PROVISION", "26": NaN, "27": NaN, "28": NaN, "29": "R_SOURCE", "30": "R_TITLE_OWN_TYPE", "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN, "37": NaN, "38": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "INTEREST SET IDENTIFIER: unique identifier for the interest set.", "1": "BA INTEREST SET SEQUENCE NUMBER: unique sequencing component to allow\rverioning of the interest set over time.", "2": "PARTNER BUSINESS ASSOCIATE IDENTIFIER: Unique identifier for a business\rassociate, such as a person, company, regulatory agency, government or\rconsortium. Unique identifier for the business associate who is a partner in an\rinterest set.", "3": "PARTNER OBSERVATION NUMBER: This column is used when a business\rassociate holds more than one interest share of a specific interest type (working,\rproduction etc) in a partnership. This can happen as a result of corporate mergers or\rasset acquisitions. If a partner only holds one interest share, this number will always\rbe 1. Please note that this column should not be used to track multiple interest types;\rin this event, a new interest set must be created.", "4": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "5": "ADDRESS OBSERVATION NUMBER: A number used to uniquely identifying an\raddress for a Business Associate.", "6": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "7": "BREACH OF CONTRACT DESCRIPTION: a textual description describing the\rbreach of a term or condition of a contract the partner is involved in.", "8": "BREACH OF CONTRACT INDICATOR: a yes / no flag that indicates the partner is in\rbreach of a term or condition of the contract for this interest set.", "9": "CHANGE REASON: textual description of why the partners role or interest in the\rinterest set has changed.", "10": "CONFIDENTIAL INDICATOR: a yes / no flag indicating that the partners participation\rin this interest set is confidential to other partners.", "11": "CONTRACT ID: Unique identifier for the contract table.", "12": "EFFECTIVE DATE: the date on which this row of data first came into effect from a\rbusiness perspective.", "13": "EXCROW DESCRIPTION: Description of a deed, bond, money or a piece of property\rheld in trust by a third party for this partner to be turned over to the grantee only upon\rthe fulfillment of a condition.", "14": "ESCROW INDICATOR: a yes/no flag that indicates that this partner is in an escrow\rcondition", "15": "EXPIRY DATE: the date on which this row of data is no longer in effect from a\rbusiness perspective.", "16": "GROSS FRACTIONAL INTEREST: the gross interest the partner has in this interest\rset, described as a fractional, such as 1/2 of 1/8.", "17": "GROSS PERCENT INTEREST: the percent interest the partner has in the interest\rset, described as a percent, derived from the fractional interest.", "18": "INACTIVE DATE: The date that the row of data describing the partners participation\rin the interest set became inactive. Any change to partner information requires that a\rnew interest set be created.", "19": "INSTRUMENT ID: Unique identifier for the instrument. In this case, this FK is used to\rcapture the instrument that describes the partnership. Do not use it to capture\rinstruments that this partnership is in effect for - these relationships should be\rcaptured in either INT SET COMPONENT or INSTRUMENT COMPONENT.", "20": "INTEREST SET ROLE: the role played by a partner in the interest set. such as\roperator. When the role changes, a new Interest Set SEQ NO must be initiated for\rthe entire set, as by definition, this changes the partnership.", "21": "NET FRACTIONAL INTEREST: the interest result expressed as a fraction calculated\ras the gross fractional interest minus any encumbrance burden (also expressed as a\rfraction) (e.g. gross partner interest is 100/100 minus a gorr encumbrance of 15/100\r= net interest of 85/100)", "22": "NET PERCENT INTEREST: the interest result expressed as a percent calculated as\rthe gross percentage interest minus any encumbrance burden (also expressed as a\rpercent) (e.g. gross partner interest is 100% minus a gorr encumbrance of 15% = net\rinterest of 85%)", "23": "PENALTY INDICATOR: a yes / no flag indicating that the partner is in a penalty\rposition for this interest set. ( a forfeiture of a partner(s) interest for capital cost(s)\rexpenditures until payout of such costs are recovered by participating parties) (e.g. a\rpartner electing not to participate in the drilling, casing, completion and tie-in of a well\rwhen served with an independent operation notice.)", "24": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "25": "PROVISION ID: unique identifier for a contract provision", "26": "REMARK: Narrative remarks about this row of data.", "27": "RIGHT TO EARN DESCRIPTION: textual description of the work to be done in order\rto earn a specified interest..", "28": "RIGHT TO EARN INDICATOR: a yes / no flag indicating that the partner has a\rpotential to earn a specified interest upon the completion of work completed as\rspecified in terms and conditions of a contract. If desired, this concept can also be\rcaptured as an INTERE ST SET, with type RIGHT TO EARN. In this case, the\rinterest set can capture the potential interests for each party (e.g. after earning\rinterests).", "29": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "30": "R TITLE OWNERSHIP TYPE: used to refer to type of ownership for titles only. May\rbe life estate holder, joint tenant, tentan in common...", "31": "UNIT OPERATED INDICATOR: a yes / no flag indicating that the partner interest is\rderived through a unit agreement.", "32": "ROW CHANGED BY: Application login id of the user who last changed the row.", "33": "ROW CHANGED DATE: System date of the last time the row was changed.", "34": "ROW CREATED BY: System user who created this row of data.", "35": "ROW CREATED DATE: Date that the row was created on.", "36": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "37": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "38": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}