{"LAND_RIGHT_INSTRUMENT": {"Column Name": {"0": "LAND_RIGHT_SUBTYPE", "1": "LAND_RIGHT_ID", "2": "INSTRUMENT_ID", "3": "LR_INST_SEQ_NO", "4": "ACTIVE_IND", "5": "DISCHARGE_DATE", "6": "DISCHARGE_IND", "7": "DISCHARGE_INSTRUMENT_ID", "8": "DISCHARGE_NUM", "9": "EFFECTIVE_DATE", "10": "EXPIRY_DATE", "11": "PPDM_GUID", "12": "REMARK", "13": "SOURCE", "14": "ROW_CHANGED_BY", "15": "ROW_CHANGED_DATE", "16": "ROW_CREATED_BY", "17": "ROW_CREATED_DATE", "18": "ROW_EFFECTIVE_DATE", "19": "ROW_EXPIRY_DATE", "20": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "N", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "NUMBER", "4": "VARCHAR2", "5": "DATE", "6": "VARCHAR2", "7": "VARCHAR2", "8": "VARCHAR2", "9": "DATE", "10": "DATE", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "DATE", "16": "VARCHAR2", "17": "DATE", "18": "DATE", "19": "DATE", "20": "VARCHAR2"}, "Length": {"0": "30", "1": "40", "2": "40", "3": "8", "4": "1", "5": "DATE", "6": "1", "7": "40", "8": "30", "9": "DATE", "10": "DATE", "11": "38", "12": "2000", "13": "40", "14": "30", "15": "DATE", "16": "30", "17": "DATE", "18": "DATE", "19": "DATE", "20": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": "P", "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN}, "Ref Table(s)": {"0": "LAND_RIGHT", "1": "LAND_RIGHT", "2": "INSTRUMENT", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": "INSTRUMENT", "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": "R_SOURCE", "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "LAND RIGHT SUBTYPE: This column is used to enforce the relationship between\rLAND RIGHT and its subtypes. The value must be equal to the name of one of the\rvalid subtypes: LAND_AGREEMENT, LAND_AGREE_PART, LAND_LEASE,\rLAND_GRANTED_RIGHT, LAND_UNIT, LAND_UNIT_TRACT or LAND_TITLE.", "1": "LAND RIGHT ID: Unique Identifier for the land right. A land right is the rights you\rhave to land, regardless of how obtained. It may be owned outright, rented, aquired\rby agreement or contract.", "2": "INSTRUMENT ID: Unique number for the legal document registered such as a Cert.\rOf Title indicating interest in lands e.g. charge, lien, mortgage, caveat. May be\rnatural Key or system assigned, based on user needs and uniqueness of natural ids.", "3": "LAND RIGHT INSTRUMENT SEQUENCE NUMBER: unique identifier for the land\rright instrument cross reference.", "4": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "5": "DISCHARGE DATE: the data that for this land right, the instrument has been\rdischarged. When all of the land rights for an instrument have been discharged, the\rinstrument itself may be discharged.", "6": "DISCHARGE INDICATOR: A Y/N flag indicating that for this land right, the instrument\rhas been discharged. When all of the land rights for an instrument have been\rdischarged, the instrument itself may be discharged.", "7": "DISCHARGE INSTRUMENT IDENTIFIER: Unique identifer for the instrument that\rdischarged this one. If you use this column, please do not also use the DISCHARGE\rNUM column, as this creates data redundancy.", "8": "DISCHARGE NUMBER: the instrument number that, for this land right, documents\rthat the instrument has been discharged. If you have captured the discharge\rinstrument as a new row in the INSTRUMENT table, use the FK relationship to\rcapture this information and DO NOT use this column. When all of the land rights for\ran instrument have been discharged, the instrument itself may be discharged.", "9": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "10": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "11": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "12": "REMARK: Narrative remarks about this row of data.", "13": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "14": "ROW CHANGED BY: Application login id of the user who last changed the row.", "15": "ROW CHANGED DATE: System date of the last time the row was changed.", "16": "ROW CREATED BY: System user who created this row of data.", "17": "ROW CREATED DATE: Date that the row was created on.", "18": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "19": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "20": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}