{"LITH_POROSITY": {"Column Name": {"0": "LITHOLOGY_LOG_ID", "1": "LITH_LOG_SOURCE", "2": "DEPTH_OBS_NO", "3": "ROCK_TYPE", "4": "ROCK_TYPE_OBS_NO", "5": "POROSITY_GRADE", "6": "ACTIVE_IND", "7": "EFFECTIVE_DATE", "8": "EXPIRY_DATE", "9": "MATRIX_CLASS", "10": "PERCENT_OF_SAMPLE", "11": "POROSITY_SCALE", "12": "POROSITY_TYPE", "13": "PPDM_GUID", "14": "REMARK", "15": "SAMPLE_REL_ABUNDANCE", "16": "ROW_CHANGED_BY", "17": "ROW_CHANGED_DATE", "18": "ROW_CREATED_BY", "19": "ROW_CREATED_DATE", "20": "ROW_EFFECTIVE_DATE", "21": "ROW_EXPIRY_DATE", "22": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "N", "4": "N", "5": "N", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "NUMBER", "3": "VARCHAR2", "4": "NUMBER", "5": "NUMBER", "6": "VARCHAR2", "7": "DATE", "8": "DATE", "9": "VARCHAR2", "10": "NUMBER", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "DATE", "18": "VARCHAR2", "19": "DATE", "20": "DATE", "21": "DATE", "22": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "8", "3": "40", "4": "8", "5": "10,5", "6": "1", "7": "DATE", "8": "DATE", "9": "40", "10": "15,12", "11": "40", "12": "40", "13": "38", "14": "2000", "15": "40", "16": "30", "17": "DATE", "18": "30", "19": "DATE", "20": "DATE", "21": "DATE", "22": 40}, "Key": {"0": "P", "1": "P", "2": "P", "3": "P", "4": "P", "5": "P", "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN}, "Ref Table(s)": {"0": "LITH_ROCK_TYPE", "1": "LITH_ROCK_TYPE", "2": "LITH_ROCK_TYPE", "3": "LITH_ROCK_TYPE", "4": "LITH_ROCK_TYPE", "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": "R_POROSITY_TYPE", "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "LITHOLOGY LOG ID: A unique identifier for a descriptive record of lithology.", "1": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "2": "DEPTH OBSERVATION NUMBER: unique identifier for the depth interval for this lith\rinterval. Use LITH LOG to get the top and base depths.", "3": "LITHOLOGIC ROCK TYPE: Type of rock comprising a significant portion of the\rinterval. For example, the predominant rock type in the interval may be coal, or oolitic\rlimestone or calcareous sandstone.", "4": "ROCK TYPE OBSERVATION NUMBER: A unique sequence number enabling\rstorage of multiple descriptions for descriptive logs.", "5": "POROSITY GRADE: The porosity grade of the interval expressed as a percentage.", "6": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "7": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "8": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "9": "MATRIX CLASS: Classification of the matrix for porosity estimation. The type of\rmatrix is important in the calculation of porosity using Archies equation.", "10": "PERCENT OF SAMPLE: The percentage of the sample which shows this type of\rporosity", "11": "POROSITY SCALE: Identifies the source of the porosity scale used in the lithologic\rdescription. The classification of porosity maybe from the physical observation of the\rinterval and assigning the type of porosity from the Choquette and Pray\rnomenclature. The porosity may be calculated using Archies equation.", "12": "POROSITY TYPE: A description of the type of porosity observed. For example\rintergranular, sucrosic or cavernous.", "13": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "14": "REMARK: Narrative remarks about this row of data.", "15": "RELATIVE ABUNDANCE: Relative abundanceof each color rank (first, second, third:\r1, 2, 3) or as a ranked magnitude (abundant, common, rare).", "16": "ROW CHANGED BY: Application login id of the user who last changed the row.", "17": "ROW CHANGED DATE: System date of the last time the row was changed.", "18": "ROW CREATED BY: System user who created this row of data.", "19": "ROW CREATED DATE: Date that the row was created on.", "20": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "21": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "22": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}