{"OBLIGATION": {"Column Name": {"0": "OBLIGATION_ID", "1": "OBLIGATION_SEQ_NO", "2": "ACTIVE_IND", "3": "CALCULATION_METHOD", "4": "CONVERTIBLE_IND", "5": "CRITICAL_DATE", "6": "CURRENCY_CONVERSION", "7": "CURRENCY_OUOM", "8": "DESCRIPTION", "9": "EFFECTIVE_DATE", "10": "EXPIRY_DATE", "11": "FULFILLED_DATE", "12": "FULFILLED_IND", "13": "GROSS_OBLIGATION_COST", "14": "INSTRUMENT_ID", "15": "LIABILITY_RELEASE_DATE", "16": "NET_OBLIGATION_COST", "17": "NOTICE_PERIOD_LENGTH", "18": "NOTICE_PERIOD_OUOM", "19": "OBLIGATION_CATEGORY", "20": "OBLIGATION_DURATION", "21": "OBLIGATION_DURATION_OUOM", "22": "OBLIGATION_FREQUENCY", "23": "OBLIGATION_TYPE", "24": "PAYMENT_IND", "25": "PAYMENT_RESPONSIBILITY", "26": "PERCENTAGE", "27": "POTENTIAL_OBLIGATION_DESC", "28": "POTENTIAL_OBLIGATION_IND", "29": "PPDM_GUID", "30": "PREPAID_IND", "31": "REMARK", "32": "RESP_PARTY_BA_ID", "33": "REVIEW_FREQUENCY", "34": "ROYALTY_OWNER_BA_ID", "35": "ROYALTY_PAYOR_BA_ID", "36": "ROYALTY_TYPE", "37": "SOURCE", "38": "START_DATE", "39": "SUBSTANCE_ID", "40": "TRIGGER_METHOD", "41": "WORK_OBLIGATION_DESC", "42": "ROW_CHANGED_BY", "43": "ROW_CHANGED_DATE", "44": "ROW_CREATED_BY", "45": "ROW_CREATED_DATE", "46": "ROW_EFFECTIVE_DATE", "47": "ROW_EXPIRY_DATE", "48": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y", "33": "Y", "34": "Y", "35": "Y", "36": "Y", "37": "Y", "38": "Y", "39": "Y", "40": "Y", "41": "Y", "42": "Y", "43": "Y", "44": "Y", "45": "Y", "46": "Y", "47": "Y", "48": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "NUMBER", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "DATE", "6": "NUMBER", "7": "VARCHAR2", "8": "VARCHAR2", "9": "DATE", "10": "DATE", "11": "DATE", "12": "VARCHAR2", "13": "NUMBER", "14": "VARCHAR2", "15": "DATE", "16": "NUMBER", "17": "NUMBER", "18": "VARCHAR2", "19": "VARCHAR2", "20": "NUMBER", "21": "VARCHAR2", "22": "VARCHAR2", "23": "VARCHAR2", "24": "VARCHAR2", "25": "VARCHAR2", "26": "NUMBER", "27": "VARCHAR2", "28": "VARCHAR2", "29": "VARCHAR2", "30": "VARCHAR2", "31": "VARCHAR2", "32": "VARCHAR2", "33": "VARCHAR2", "34": "VARCHAR2", "35": "VARCHAR2", "36": "VARCHAR2", "37": "VARCHAR2", "38": "DATE", "39": "VARCHAR2", "40": "VARCHAR2", "41": "VARCHAR2", "42": "VARCHAR2", "43": "DATE", "44": "VARCHAR2", "45": "DATE", "46": "DATE", "47": "DATE", "48": "VARCHAR2"}, "Length": {"0": "40", "1": "8", "2": "1", "3": "40", "4": "1", "5": "DATE", "6": "10,5", "7": "40", "8": "240", "9": "DATE", "10": "DATE", "11": "DATE", "12": "1", "13": "12,2", "14": "40", "15": "DATE", "16": "12,2", "17": "10,5", "18": "40", "19": "40", "20": "10,5", "21": "40", "22": "20", "23": "40", "24": "1", "25": "40", "26": "15,12", "27": "240", "28": "1", "29": "38", "30": "1", "31": "2000", "32": "40", "33": "20", "34": "40", "35": "40", "36": "40", "37": "40", "38": "DATE", "39": "40", "40": "40", "41": "1024", "42": "30", "43": "DATE", "44": "30", "45": "DATE", "46": "DATE", "47": "DATE", "48": "40"}, "Key": {"0": "P", "1": "P", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN, "37": NaN, "38": NaN, "39": NaN, "40": NaN, "41": NaN, "42": NaN, "43": NaN, "44": NaN, "45": NaN, "46": NaN, "47": NaN, "48": NaN}, "Ref Table(s)": {"0": NaN, "1": NaN, "2": NaN, "3": "R_OBLIG_CALC_METHOD", "4": NaN, "5": NaN, "6": NaN, "7": "PPDM_UNIT_OF_MEASURE", "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": "INSTRUMENT", "15": NaN, "16": NaN, "17": NaN, "18": "PPDM_UNIT_OF_MEASURE", "19": "R_OBLIG_CATEGORY", "20": NaN, "21": "PPDM_UNIT_OF_MEASURE", "22": NaN, "23": "R_OBLIG_TYPE", "24": NaN, "25": "R_OBLIG_PAY_RESP", "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": "BUSINESS_ASSOCIATE", "33": NaN, "34": "BUSINESS_ASSOCIATE", "35": "BUSINESS_ASSOCIATE", "36": "R_ROYALTY_TYPE", "37": "R_SOURCE", "38": NaN, "39": "SUBSTANCE", "40": "R_OBLIG_TRIGGER", "41": NaN, "42": NaN, "43": NaN, "44": NaN, "45": NaN, "46": NaN, "47": NaN, "48": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "OBLIGATION ID: Unique identifier for each obligation", "1": "OBLIGATION SEQ NO: Unique identifier for each part or occurrence of an obligation", "2": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "3": "OBLIGATION CALCULATION METHOD: the method used to calculate the\robligation.", "4": "CONVERTIBLE INDICATOR: a yes / no flag indicating that the obligation is\rconvertable to a working interest.", "5": "CRITICAL DATE: Date which an obligation must be fulfilled", "6": "CURRENCY CONVERSION RATE: the rate applied to convert the currency from its\roriginal monetary UOM to the stored UOM. This value is valid for this row in this table\ronly. When this value is multiplied by the STORED currency value, the original value\rof the transaction in the original currency is obtained.", "7": "CURRENCY ORIGINAL UNITS OF MEASURE: the currency in which the funds were\rinitially received. When the Stored currency is multiplied by the CURRENCY\rCONVERSION, the value of the transaction in the original currency is obtained.", "8": "DESCRIPTION: Description of the obligation or commitment", "9": "EFFECTIVE DATE: the date on which this row of data first came into effect from a\rbusiness perspective.", "10": "EXPIRY DATE: the date on which this row of data is no longer in effect from a\rbusiness perspective.", "11": "FULFILLED DATE: Date on which obligation was fulfilled", "12": "FULFILLED IND: Indicated whether or not obligation has been fulfilled. This may be\rused in the case where all rental payments over a five year period have been made\rin advance, and indicates that there are no additional obligations to incur.", "13": "GROSS OBLIGATION COST: Total payment amount required to fulfill the obligation", "14": "INSTRUMENT ID: Unique identifier for the instrument.", "15": "LIABILITY RELEASE DATE: the date that you are released from liability for this\robligation.", "16": "NET OBLIGATION COST: the net cost of the obligation, based on working interest.", "17": "NOTICE PERIOD LENGTH: Length of notice period required if this obligation is to be\rterminated. If the notice period is not adhered to, the obligation cannot be terminated\rwithout fulfilling it.", "18": "NOTICE PERIOD ORIGINAL UNITS OF MEASURE: The original units used, usually\rdays, months or years", "19": "R OBLIG CATEGORY: may include non-payment obligation, rental, lease or royalty", "20": "OBLIGATION DURATION: Length of time for which obligation is applicable", "21": "OBLIGATION DURATION ORIGINAL UNITS OF MEASURE: The original units used,\rusually days, months or years", "22": "OBLIGATION FREQUENCY: Frequency with which this obligation will be due\r(annual, monthly, single)", "23": "OBLIGATION TYPE: the type of obligation incurred, such as termination notice,\rsurrender notice, annual rental", "24": "PAYMENT IND: Indicator to determine if obligation is payment or non-payment (Y=\rpayment obligation)", "25": "OBLIGATION PAYMENT RESPONSIBILITY: Indicates whether the obligation is paid\rout entirely by one partner, each partner is responsible for paying only their share, or\rwhether a third party has been retained to make payments and charge back to each\rpartner.", "26": "PERCENTAGE: The percentage of the Royalty payment obligation.", "27": "POTENTIAL OBLIGATION DESC: Description of the condition or event which\rtriggers the obligation. Could be an SQL query which queries the database to\rdetermine whether the condition has been met (typically related to cost and\rproduction re venue)", "28": "POTENTIAL OBLIGATION IND: Indicator to identify if it is a potential obligation.\rThese are not currently obligations, but will become so when the obligation\rdescription has been fulfilled. (Y= potential obligation)", "29": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "30": "PREPAID IND: Indicates that all royalty obligations have been prepaid", "31": "REMARK: Narrative remarks about this row of data.", "32": "BUSINESS ASSOCIATE: the business associate who is responsible for ensuring this\robligation is fulfilled, such as ensuring rents are paid, reports generated etc.", "33": "REVIEW FREQUENCY: the frequency with which the obligation is reviewed to\rdetermine whether it should be revised. Each revision increases the SEQ NO by one.", "34": "BUSINESS ASSOCIATE: The business associate who will be paid the royalty", "35": "BUSINESS ASSOCIATE: the business associate who is responsible for ensuring that\rthe royalty is paid. Each payor is tracked separately in OBLIGATION PAYMENT.", "36": "R ROYALTY TYPE: a type of royalty, such as gross overriding,", "37": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "38": "START DATE: the date on which work to fulfill an obligations started. This could be\rwhen a work program was initiated or when a financial obligation was first paid.", "39": "SUBSTANCE IDENTIFIER: Unique identifier for a substance that can be described\reither chemically or in terms of composition. Elements, ions, isotopes, isomers,\rminerals, chemicals, solvents, production substances, hydrocarbons etc are all listed.\rBe advised that many applications and agencies may use the same term, but the\rdefinition and composition details may not be the same. Use the SUBSTANCE XREF\rtable to capture relationships between substances, such as similar substances.", "40": "OBLIGATION TRIGGER METHOD: The means by which the obligation is triggered,\rand becomes active.", "41": "WORK OBLIGATION DESCRIPTION: Reports the numerical and functional\rcomponent of the work obligation commitment. May be DRILL 3 WELLS, SHOOT 5\rSEISMIC LINES, EXPEND $5,000,000 etc. This should be derived from the LAND\rOFFERING BIG, if the obligation incurred as a result of land acquisition through land\rsale.", "42": "ROW CHANGED BY: Application login id of the user who last changed the row.", "43": "ROW CHANGED DATE: System date of the last time the row was changed.", "44": "ROW CREATED BY: System user who created this row of data.", "45": "ROW CREATED DATE: Date that the row was created on.", "46": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "47": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "48": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}