{"PPDM_QUALITY_CONTROL": {"Column Name": {"0": "SYSTEM_ID", "1": "TABLE_NAME", "2": "QC_SEQ_NO", "3": "ACTIVE_IND", "4": "CHECKED_BY_BA_ID", "5": "COLUMN_NAME", "6": "CURRENT_DATE_VALUE", "7": "CURRENT_NUMERIC_VALUE", "8": "CURRENT_NUMERIC_VALUE_O", "9": "CURRENT_NUMERIC_VALUE_U", "10": "CURRENT_ROW_GUID", "11": "CURRENT_TEXT_VALUE", "12": "DATA_TYPE", "13": "DONE_BY_BA_ID", "14": "EFFECTIVE_DATE", "15": "EXPIRY_DATE", "16": "NULL_DESCRIPTION", "17": "PPDM_GUID", "18": "QC_DATETIME", "19": "QC_DESC", "20": "QC_STATUS", "21": "QC_TYPE", "22": "QUALITY_TYPE", "23": "REMARK", "24": "RETENTION_PERIOD", "25": "SOURCE", "26": "ROW_CHANGED_BY", "27": "ROW_CHANGED_DATE", "28": "ROW_CREATED_BY", "29": "ROW_CREATED_DATE", "30": "ROW_EFFECTIVE_DATE", "31": "ROW_EXPIRY_DATE", "32": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "OYM", "9": "MY", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "NUMBER", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "DATE", "7": "NUMBER", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "DATE", "15": "DATE", "16": "VARCHAR2", "17": "VARCHAR2", "18": "DATE", "19": "VARCHAR2", "20": "VARCHAR2", "21": "VARCHAR2", "22": "VARCHAR2", "23": "VARCHAR2", "24": "VARCHAR2", "25": "VARCHAR2", "26": "VARCHAR2", "27": "DATE", "28": "VARCHAR2", "29": "DATE", "30": "DATE", "31": "DATE", "32": "VARCHAR2"}, "Length": {"0": "40", "1": "30", "2": "8", "3": "1", "4": "40", "5": "30", "6": "DATE", "7": "0", "8": "40", "9": "40", "10": "38", "11": "2000", "12": "40", "13": "40", "14": "DATE", "15": "DATE", "16": "1024", "17": "38", "18": "DATE", "19": "1024", "20": "40", "21": "40", "22": "40", "23": "2000", "24": "40", "25": "40", "26": "30", "27": "DATE", "28": "30", "29": "DATE", "30": "DATE", "31": "DATE", "32": 40}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN}, "Ref Table(s)": {"0": "PPDM_TABLE\rPPDM_COLUMN", "1": "PPDM_TABLE\rPPDM_COLUMN", "2": NaN, "3": NaN, "4": "BUSINESS_ASSOCIATE", "5": "PPDM_COLUMN", "6": NaN, "7": NaN, "8": "PPDM_UNIT_OF_MEASURE", "9": "PPDM_UNIT_OF_MEASURE", "10": NaN, "11": NaN, "12": "R_PPDM_DATA_TYPE", "13": "BUSINESS_ASSOCIATE", "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": "R_PPDM_QC_STATUS", "21": "R_PPDM_QC_TYPE", "22": NaN, "23": NaN, "24": "R_RETENTION_PERIOD", "25": "R_SOURCE", "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SYSTEM IDENTIFIER: A unique identifier for a data storage system, such as a\rdatabase or XML schema.", "1": "TABLE NAME: The name of the table within the schema.", "2": "QUALITY CONTROL SEQUENCE NUMBER: a number that is used to order the\roccurence of rows.", "3": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "4": "CHECKED BY BUSINESS ASSOCIATE IDENTIFIER: Unique identifier for the\rbusiness associate who checked the work done by the data analyst to verify that the\rquality control has been done correctly. In some cases, this will be a business expert\rwho is reviewing the final contents of a data structure.", "5": "COLUMN NAME: Name of the column within a specific table found in the PPDM\rschema", "6": "CURRENT DATE VALUE: the current value of the column for this GUID identified\rrow of data, where the original data type was in date format. Since the stored value of\rthe column may change over time, the current value may be replicated here in order\rto keep track of the value that was being quality controlled. Over time, it is possible\rthat records in this table may refer to the QC process for multiple values in the same\rtable, row and column in the database. Only use this column if you are referring to a\rspecific column.", "7": "CURRENT NUMERIC VALUE: the current value of the column for this GUID\ridentified row of data, where the original data type was in number format. Since the\rstored value of the column may change over time, the current value may be\rreplicated here in order to keep track of the value that was being quality controlled.\rOver time, it is possible that records in this table may refer to the QC process for\rmultiple values in the same table, row and column in the database. Only use this\rcolumn if you are referring to a specific column.", "8": "CURRENT UNIT OF MEASURE", "9": "UNIT OF MEASURE", "10": "CURRENT QUALITY CONTROL ROW GUID: In order to use this table, you must\rhave the PPDM GUID columns in the table to be audited in use, with the NOT NULL\rconstraints turned on, and a unique index on the PPDM GUID column. In this table,\rthe CURRENT QC ROW GUID is the GUID for the row that is being validated. If the\rCOLUMN_NAME is also populated, the information relates to a specific column. If\rnot, the GUID points to the entire row.", "11": "CURRENT TEXT VALUE: the current value of the column for this GUID identified row\rof data, where the original data type was in textual format. Since the stored value of\rthe column may change over time, the current value may be replicated here in order\rto keep track of the value that was being quality controlled. Over time, it is possible\rthat records in this table may refer to the QC process for multiple values in the same\rtable, row and column in the database. Only use this column if you are referring to a\rspecific column.", "12": "DATATYPE: The database \"type\" for the column. Oracle uses DATE, NUMBER,\rVARCHAR2, LONG and so on.", "13": "DONE BY BUSINESS ASSOCIATE IDENTIFER: Unique identifier for the business\rassociate who was responsible for the creation of this information, usually the\rbusiness analyst or data analyst who is verifying data.", "14": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "15": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "16": "NULL DESCRIPTION: If this value is NULL, a narrative descrption about why it is null\r(not available, historical records damaged or lost etc).", "17": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should becreated.", "18": "QC DATETIME: the system or user date and time when this record is considered to\rbe in effect, used to correctly sequence events in time.", "19": "QC DESCRIPTION: Narrative descriptive comments about the quality control of the\rdata, such as comments about the source, questions about the information etc.", "20": "QUALITY CONTROL STATUS: A valid type of quality control or validation status,\rsuch as batch loaded, visual inspection, verified by data analyst, verified by business\ranalyst etc.", "21": "QUALITY CONTROL TYPE: The type of quality control that is being done, such as\rtable level or column level quality control.", "22": "QUALITY CONTROL QUALITY TYPE: A value that indicates the quality of the data,\rwhether the data is poor quality, fully verified, falls within expected range of values,\rrequires further investigation etc. Some companies have developed rigorous\rmethods for testing and scoring certain key information attributes.", "23": "REMARK: Narrative remarks about this row of data.", "24": "RETENTION PERIOD: The length of time records or materials should be kept in a\rcertain location or form for administrative, legal, fiscal, historical, or other purposes.\rRetention periods are determined by balancing the potential value ofthe information\rto the agency against the costs of storing the records containing that information.\rRetention periods are often set for record series, but specific records within that\rseries may need to be retained longer because they are required for litigation or\rbecause circumstances give those records unexpected archival value.", "25": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row. In this case, identifies the source of the AUDIT row\rof data.", "26": "ROW CHANGED BY: Application login id of the user who last changed the row.", "27": "ROW CHANGED DATE: System date of the last time the row was changed.", "28": "ROW CREATED BY: System user who created this row of data.", "29": "ROW CREATED DATE: Date that the row was created on.", "30": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "31": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "32": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}