{"PPDM_AUDIT_HISTORY": {"Column Name": {"0": "SYSTEM_ID", "1": "TABLE_NAME", "2": "COLUMN_NAME", "3": "AUDIT_ROW_GUID", "4": "AUDIT_SEQ_NO", "5": "ACTIVE_IND", "6": "AUDIT_AUTHORIZED_BY_BA_ID", "7": "AUDIT_CREATED_BY_BA_ID", "8": "AUDIT_DATETIME", "9": "AUDIT_DESC", "10": "AUDIT_REASON", "11": "AUDIT_SOURCE", "12": "AUDIT_TYPE", "13": "AUDIT_VERIFIED_BY_BA_ID", "14": "DATA_TYPE", "15": "EFFECTIVE_DATE", "16": "EXPIRY_DATE", "17": "NEW_DATE_VALUE", "18": "NEW_NUMERIC_VALUE", "19": "NEW_NUMERIC_VALUE_OUOM", "20": "NEW_NUMERIC_VALUE_UOM", "21": "NEW_TEXT_VALUE", "22": "NULL_DESCRIPTION", "23": "ORIGINAL_DATE_VALUE", "24": "ORIGINAL_NUMERIC_VALUE", "25": "ORIGINAL_NUMERIC_VALUE_O", "26": "ORIGINAL_NUMERIC_VALUE_U", "27": "ORIGINAL_TEXT_VALUE", "28": "PPDM_GUID", "29": "REMARK", "30": "RETENTION_PERIOD", "31": "SOURCE", "32": "ROW_CHANGED_BY", "33": "ROW_CHANGED_DATE", "34": "ROW_CREATED_BY", "35": "ROW_CREATED_DATE", "36": "ROW_EFFECTIVE_DATE", "37": "ROW_EXPIRY_DATE", "38": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "N", "4": "N", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "OYM", "26": "MY", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y", "33": "Y", "34": "Y", "35": "Y", "36": "Y", "37": "Y", "38": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "NUMBER", "5": "VARCHAR2", "6": "VARCHAR2", "7": "VARCHAR2", "8": "DATE", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "DATE", "16": "DATE", "17": "DATE", "18": "NUMBER", "19": "VARCHAR2", "20": "VARCHAR2", "21": "VARCHAR2", "22": "VARCHAR2", "23": "DATE", "24": "NUMBER", "25": "VARCHAR2", "26": "VARCHAR2", "27": "VARCHAR2", "28": "VARCHAR2", "29": "VARCHAR2", "30": "VARCHAR2", "31": "VARCHAR2", "32": "VARCHAR2", "33": "DATE", "34": "VARCHAR2", "35": "DATE", "36": "DATE", "37": "DATE", "38": "VARCHAR2"}, "Length": {"0": "40", "1": "30", "2": "30", "3": "38", "4": "8", "5": "1", "6": "40", "7": "40", "8": "DATE", "9": "1024", "10": "40", "11": "40", "12": "40", "13": "40", "14": "40", "15": "DATE", "16": "DATE", "17": "DATE", "18": "0", "19": "40", "20": "40", "21": "2000", "22": "1024", "23": "DATE", "24": "0", "25": "40", "26": "40", "27": "2000", "28": "38", "29": "2000", "30": "40", "31": "40", "32": "30", "33": "DATE", "34": "30", "35": "DATE", "36": "DATE", "37": "DATE", "38": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": "P", "4": "P", "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN, "37": NaN, "38": NaN}, "Ref Table(s)": {"0": "PPDM_COLUMN", "1": "PPDM_COLUMN", "2": "PPDM_COLUMN", "3": NaN, "4": NaN, "5": NaN, "6": "BUSINESS_ASSOCIATE", "7": "BUSINESS_ASSOCIATE", "8": NaN, "9": NaN, "10": "R_PPDM_AUDIT_REASON", "11": "R_SOURCE", "12": "R_PPDM_AUDIT_TYPE", "13": "BUSINESS_ASSOCIATE", "14": "R_PPDM_DATA_TYPE", "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": "PPDM_UNIT_OF_MEASURE", "20": "PPDM_UNIT_OF_MEASURE", "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": "PPDM_UNIT_OF_MEASURE", "26": "PPDM_UNIT_OF_MEASURE", "27": NaN, "28": NaN, "29": NaN, "30": "R_RETENTION_PERIOD", "31": "R_SOURCE", "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN, "37": NaN, "38": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SYSTEM IDENTIFIER: A unique identifier for a data storage system, such as a\rdatabase or XML schema.", "1": "TABLE NAME: The name of the table within the schema.", "2": "COLUMN NAME: Name of the column within a specific table found in the PPDM\rschema", "3": "AUDIT ROW GUID: In order to use this table, you must have the PPDM GUID\rcolumns in the table to be audited in use, with the NOT NULL constraints turned on,\rand a unique index on the PPDM GUID column. In this table, the AUDIT ROW GUID\ris the GUID for the row that is being audited.", "4": "AUDIT SEQUENCE NUMBER: a number that is used to order the occurence of\rauditable changes to values in the database.", "5": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "6": "AUDIT AUTHORIZED BY BUSINESS ASSOCIATE IDENTIFER: Unique identifier for\rthe business associate who authorized an auditable change to be made to a record\rin the database.", "7": "AUDIT CHANGE CREATED BY BUSINESS ASSOCIATE IDENTIFIER: Unique\ridentifier for the business associate who created the audit record.", "8": "AUDIT DATETIME: the system or user date and time when this audit is considered to\rbe in effect.", "9": "AUDIT DESCRIPTION: Narrative descriptive comments about the transaction that\rchanged the data, such as comments about the data source or method used, a\rbusiness rule used for the transaction etc.", "10": "AUDIT REASON: The reason why an auditable change was made to the data, such\ras data cleanup project, new data received, incorrect data corrected, missing data\rlocated etc.", "11": "AUDIT SOURCE: use this column to identify the source of the new information that\rresulted in the creation of this audit record.", "12": "AUDIT TYPE: The type of change that is being tracked in this row of audit data.\rDepending on the business rules in place, may track inserts, updates or deletes.", "13": "AUDIT VERIFIED BY BUSINESS ASSOCIATE IDENTIFIER: unique identifier who\rquality controlled and verified the auditable change to a value in the database.", "14": "DATATYPE: The database \"type\" for the column. Oracle uses DATE, NUMBER,\rVARCHAR2, LONG and so on.", "15": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "16": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "17": "NEW DATE VALUE: the new value of the column for this GUID identified row of data,\rwhere the original data type was in date format.", "18": "NEW NUMERIC VALUE: the new value of the column for this GUID identified row of\rdata, where the original data type was in number format.", "19": "ORIGINAL UNIT OF MEASURE", "20": "UNIT OF MEASURE", "21": "NEW TEXT VALUE: the new value of the column for this GUID identified row of data,\rwhere the original data type was in textual format.", "22": "NULL DESCRIPTION: If this value is NULL, a narrative descrption about why it is null\r(not available, historical records damaged or lost etc).", "23": "ORIGINAL DATE VALUE: the original value of the column for this GUID identified\rrow of data, where the original data type was in date format.", "24": "ORIGINAL NUMERIC VALUE: the original value of the column for this GUID\ridentified row of data, where the original data type was in number format.", "25": "ORIGINAL UNIT OF MEASURE", "26": "UNIT OF MEASURE", "27": "ORIGINAL TEXT VALUE: the original value of the column for this GUID identified row\rof data, where the original data type was in textual format.", "28": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "29": "REMARK: Narrative remarks about this row of data.", "30": "RETENTION PERIOD: The length of time records or materials should be kept in a\rcertain location or form for administrative, legal, fiscal, historical, or other purposes.\rRetention periods are determined by balancing the potential value of the information\rto the agency against the costs of storing the records containing that information.\rRetention periods are often set for record series, but specific records within that\rseries may need to be retained longer because they are required for litigation or\rbecause circumstances give those records unexpected archival value.", "31": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row. In this case, identifies the source of the AUDIT row\rof data.", "32": "ROW CHANGED BY: Application login id of the user who last changed the row.", "33": "ROW CHANGED DATE: System date of the last time the row was changed.", "34": "ROW CREATED BY: System user who created this row of data.", "35": "ROW CREATED DATE: Date that the row was created on.", "36": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "37": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "38": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}