{"PPDM_TABLE_HISTORY": {"Column Name": {"0": "SYSTEM_ID", "1": "TABLE_NAME", "2": "HISTORY_SEQ_NO", "3": "ACTIVE_IND", "4": "AUDIT_REASON", "5": "AUTHORIZED_BY_BA_ID", "6": "DELETE_RECORD", "7": "EFFECTIVE_DATE", "8": "EXPIRY_DATE", "9": "PPDM_GUID", "10": "REMARK", "11": "RETENTION_PERIOD", "12": "SOURCE", "13": "ROW_CHANGED_BY", "14": "ROW_CHANGED_DATE", "15": "ROW_CREATED_BY", "16": "ROW_CREATED_DATE", "17": "ROW_EFFECTIVE_DATE", "18": "ROW_EXPIRY_DATE", "19": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "NUMBER", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "BLOB", "7": "DATE", "8": "DATE", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "DATE", "15": "VARCHAR2", "16": "DATE", "17": "DATE", "18": "DATE", "19": "VARCHAR2"}, "Length": {"0": "40", "1": "30", "2": "8", "3": "1", "4": "40", "5": "40", "6": "0", "7": "DATE", "8": "DATE", "9": "38", "10": "2000", "11": "40", "12": "40", "13": "30", "14": "DATE", "15": "30", "16": "DATE", "17": "DATE", "18": "DATE", "19": 40}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN}, "Ref Table(s)": {"0": "PPDM_SYSTEM PPDM_TABLE", "1": "PPDM_TABLE", "2": NaN, "3": NaN, "4": "R_PPDM_AUDIT_REASON", "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": "R_RETENTION_PERIOD", "12": "R_SOURCE", "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SYSTEM IDENTIFIER: A unique identifier for a data storage system, such as a\rdatabase or XML schema.", "1": "TABLE NAME: The name of the table within the schema.", "2": "DELETION SEQUENCE NUMBER: a unique identifier for the data that has been\rdeleted.", "3": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "4": "AUDIT REASON: The reason why an auditable change was made to the data, such\ras data cleanup project, new data received, incorrect data corrected, missing data\rlocated etc.", "5": "AUTHORIZED BY BA ID: The unique identifier for the business associate who\rauthorized the change to the record of data.", "6": "DELETE RECORD: a binary object in which the data values that have been deleted\rcan be stored. Use a format that identifies the column name and its value, such as\rwith XML, where the column name is the tag name.", "7": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "8": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "9": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "10": "REMARK: A long description describing the information kept within the table in the\rPPDM schema.", "11": "RETENTION PERIOD: The length of time records or materials should be kept in a\rcertain location or form for administrative, legal, fiscal, historical, or other purposes.\rRetention periods are determined by balancing the potential value of the information\rto the agency against the costs of storing the records containing that information.\rRetention periods are often set for record series, but specific records within that\rseries may need to be retained longer because they are required for litigation or\rbecause circumstances give those records unexpected archival value.", "12": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "13": "ROW CHANGED BY: Application login id of the user who last changed the row.", "14": "ROW CHANGED DATE: System date of the last time the row was changed.", "15": "ROW CREATED BY: System user who created this row of data.", "16": "ROW CREATED DATE: Date that the row was created on.", "17": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "18": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "19": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}