{"PPDM_SCHEMA_ENTITY": {"Column Name": {"0": "SYSTEM_ID", "1": "SCHEMA_ENTITY_ID", "2": "ACTIVE_IND", "3": "DATA_TYPE", "4": "DEFAULT_UOM_ID", "5": "DELIMITER", "6": "DOMAIN", "7": "EFFECTIVE_DATE", "8": "ELEMENT_TYPE", "9": "ENTITY_COMMENT", "10": "ENTITY_PRECISION", "11": "ENTITY_SCALE", "12": "ENTITY_SEQ_NO", "13": "ENTITY_SIZE", "14": "EXPIRY_DATE", "15": "EXTENSION_IND", "16": "LAST_SYSTEM_KEY", "17": "NULLABLE_IND", "18": "POSITION_END", "19": "POSITION_START", "20": "PPDM_GUID", "21": "PREFERRED_NAME", "22": "REFERENCE_NUM", "23": "REMARK", "24": "SOURCE", "25": "SURROGATE_IND", "26": "ROW_CHANGED_BY", "27": "ROW_CHANGED_DATE", "28": "ROW_CREATED_BY", "29": "ROW_CREATED_DATE", "30": "ROW_EFFECTIVE_DATE", "31": "ROW_EXPIRY_DATE", "32": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "VARCHAR2", "7": "DATE", "8": "VARCHAR2", "9": "VARCHAR2", "10": "NUMBER", "11": "NUMBER", "12": "NUMBER", "13": "NUMBER", "14": "DATE", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "NUMBER", "19": "NUMBER", "20": "VARCHAR2", "21": "VARCHAR2", "22": "VARCHAR2", "23": "VARCHAR2", "24": "VARCHAR2", "25": "VARCHAR2", "26": "VARCHAR2", "27": "DATE", "28": "VARCHAR2", "29": "DATE", "30": "DATE", "31": "DATE", "32": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "1", "3": "40", "4": "40", "5": "20", "6": "40", "7": "DATE", "8": "40", "9": "2000", "10": "10", "11": "10", "12": "8", "13": "10", "14": "DATE", "15": "1", "16": "240", "17": "1", "18": "10", "19": "10", "20": "38", "21": "255", "22": "30", "23": "2000", "24": "40", "25": "1", "26": "30", "27": "DATE", "28": "30", "29": "DATE", "30": "DATE", "31": "DATE", "32": "40"}, "Key": {"0": "P", "1": "P", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN}, "Ref Table(s)": {"0": "PPDM_SYSTEM", "1": NaN, "2": NaN, "3": "R_PPDM_DATA_TYPE", "4": "PPDM_UNIT_OF_MEASURE", "5": NaN, "6": "PPDM_DOMAIN", "7": NaN, "8": "R_PPDM_SCHEMA_ENTITY", "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": "R_SOURCE", "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SYSTEM IDENTIFIER: A unique identifier for a data storage system, such as a\rdatabase or XML schema.", "1": "SCHEMA ENTITY IDENTIFIER: Unique identifier for an entity or object in an XML or\rEDI schema.", "2": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "3": "DATATYPE: The database \"type\" for the column. Oracle uses DATE, NUMBER,\rVARCHAR2, LONG and so on.", "4": "DEFAULT UNIT OF MEASURE SYMBOL: The units of measure used for this column\rby default. By Architectural Principle, only those columns which must contain variable\rUOM (such a production volumes) contain a table explicit UOM. Using a common\rUOM for a column avoids the need for full table scans or on-line data conversions\rduring queries.", "5": "DELIMITER: Store a copy of the delimiter that is used to seperate values in an EDI or\rtext based format, such as a comma or a slash.", "6": "DOMAIN: Name for the domain, or group of common features that make up this\rcolumn. For example, the width, scale, datatype, and unit of measure. The domain\rmay be one or more of these items.", "7": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "8": "ELEMENT TYPE: the type of schema element that is being described, such as\relement, attribute, element group etc.", "9": "ENTITY COMMENT: a narrative comment describing the use and function of this\rentity.", "10": "ENTITY PRECISION: The number of digits to the left of the decimal place in a\rnumber. The number of digits to the right of the decimal place is stored in SCALE.\rThe total number of digits is stored in SIZE.", "11": "ENTITY SCALE: The number of digits following the decimal place in a numeric field.", "12": "ENTITY SEQUENCE: A number indicating the position of this column relative to\rother columns in the table. The primary key components should be listed first in the\rsequence, with the most generallized key first, followed by increasingly specific\rcolumns. The remainder of the columns can be sorted as desired by the\rimplementor.", "13": "ENTITY SIZE: The size or length of the entity. It is the maximum length, or number of\rcharacters or digits that may be used.", "14": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "15": "EXTENSION INDICATOR: a yes/ no flag indicating whether this column is an\rextension to the standard PPDM structure.", "16": "LAST SYSTEM ASSIGNED KEY: the value of the last system assigned key for this\rcolumn in the database. Used for surrogate keys, but not for OBS_NO or SEQ_NO,\rboth of which should re-sequence to value 1 for each new parent.", "17": "NULLABLE INDICATOR: a column indicating whether the column is nullable in this\rimplementation. A value of Y indicates the the column is nullable (optional). PPDM\rdefinitions usually make the PK NOT NULL, and other columns nullable, but site\rimplementations may make additional columns manditory based on business\rrequirements.", "18": "POSITION END: The ending position in an EDI record where this particle of\rinformation is located.", "19": "POSITION START: The starting position in an EDI record where this particle of\rinformation is located.", "20": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "21": "PREFERRED NAME: the preferred name by which this entity is known. By\rpreference, all names for this entity should be stored in PPDM SCHEMA ENTITY\rALIAS, with a trigger to denormalize the preferred name into this column if you want\rto use it to improve performance.", "22": "SCHEMA ENTITY REFERENCE NUMBER: A reference number or code that the\rschema entity is usually known by, most commonly used for EDI schema. Note that\rreference number may also be stored as a PPDM SCHEMA ENTITY ALIAS, with a\rtrigger to populate this column, if you want to use it for query performance.", "23": "REMARK: Narrative remarks about this row of data.", "24": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "25": "SURROGATE INDICATOR: A Y/N flag indicating that this column is assigned a\rsurrogate value on creation.", "26": "ROW CHANGED BY: Application login id of the user who last changed the row.", "27": "ROW CHANGED DATE: System date of the last time the row was changed.", "28": "ROW CREATED BY: System user who created this row of data.", "29": "ROW CREATED DATE: Date that the row was created on.", "30": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "31": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "32": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}