{"PPDM_AUDIT_HISTORY_REM": {"Column Name": {"0": "SYSTEM_ID", "1": "TABLE_NAME", "2": "COLUMN_NAME", "3": "AUDIT_ROW_GUID", "4": "AUDIT_SEQ_NO", "5": "REMARK_SEQ_NO", "6": "ACTIVE_IND", "7": "AUDIT_DATETIME", "8": "EFFECTIVE_DATE", "9": "EXPIRY_DATE", "10": "PPDM_GUID", "11": "REMARK", "12": "REMARK_ABOUT_BA_ID", "13": "REMARK_BY_BA_ID", "14": "REMARK_FOR_BA_ID", "15": "REMARK_TYPE", "16": "REMARK_USE_TYPE", "17": "RETENTION_PERIOD", "18": "SOURCE", "19": "ROW_CHANGED_BY", "20": "ROW_CHANGED_DATE", "21": "ROW_CREATED_BY", "22": "ROW_CREATED_DATE", "23": "ROW_EFFECTIVE_DATE", "24": "ROW_EXPIRY_DATE", "25": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "N", "4": "N", "5": "N", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "NUMBER", "5": "NUMBER", "6": "VARCHAR2", "7": "DATE", "8": "DATE", "9": "DATE", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "VARCHAR2", "19": "VARCHAR2", "20": "DATE", "21": "VARCHAR2", "22": "DATE", "23": "DATE", "24": "DATE", "25": "VARCHAR2"}, "Length": {"0": "40", "1": "30", "2": "30", "3": "38", "4": "8", "5": "8", "6": "1", "7": "DATE", "8": "DATE", "9": "DATE", "10": "38", "11": "2000", "12": "40", "13": "40", "14": "40", "15": "40", "16": "40", "17": "40", "18": "40", "19": "30", "20": "DATE", "21": "30", "22": "DATE", "23": "DATE", "24": "DATE", "25": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": "P", "4": "P", "5": "P", "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN}, "Ref Table(s)": {"0": "PPDM_AUDIT_HISTORY", "1": "PPDM_AUDIT_HISTORY", "2": "PPDM_AUDIT_HISTORY", "3": "PPDM_AUDIT_HISTORY", "4": "PPDM_AUDIT_HISTORY", "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": "BUSINESS_ASSOCIATE", "13": "BUSINESS_ASSOCIATE", "14": "BUSINESS_ASSOCIATE", "15": "R_REMARK_TYPE", "16": "R_REMARK_USE_TYPE", "17": NaN, "18": "R_SOURCE", "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SYSTEM IDENTIFIER: A unique identifier for a data storage system, such as a\rdatabase or XML schema.", "1": "TABLE NAME: The name of the table within the schema.", "2": "COLUMN NAME: Name of the column within a specific table found in the PPDM\rschema", "3": "AUDIT ROW GUID: In order to use this table, you must have the PPDM GUID\rcolumns in the table to be audited in use, with the NOT NULL constraints turned on,\rand a unique index on the PPDM GUID column. In this table, the AUDIT ROW GUID\ris the GUID for the row that is being audited.", "4": "AUDIT SEQUENCE NUMBER: a number that is used to order the occurence of\rauditable changes to values in the database.", "5": "REMARK SEQUENCE NUMBER: Unique identifier for a remark about an audit\rrecord", "6": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "7": "AUDIT DATETIME: the system or user date and time when this audit is considered to\rbe in effect.", "8": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "9": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "10": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "11": "REMARK: Narrative remarks about this row of data.", "12": "REMARK ABOUT BUSINESS ASSOCIATE IDENTIFIER: unique identifier for the\rbusiness associate about whom this remark was made, such as a company that\rprovided original data, or a service that transcribed data.", "13": "REMARK BY BUSINESS ASSOCIATE IDENTIFER: Unique identifier for the\rbusiness associate who made a remark related to the audit of a record in the\rdatabase.", "14": "REMARK FOR BUSINESS ASSOCIATE IDENTIFIER: Unique identifier for the\rbusiness associate for whom the remark was made, such as a department or\rcompany.", "15": "REMARK TYPE: the kind of remark that has been made about this audit record.", "16": "REMARK USE TYPE: Indicates the type of use that a remark should be put to, such\ras for internal use only, for external publication etc.", "17": "RETENTION PERIOD: The length of time records or materials should be kept in a\rcertain location or form for administrative, legal, fiscal, historical, or other purposes.\rRetention periods are determined by balancing the potential value of the information\rto the agency against the costs of storing the records containing that information.\rRetention periods are often set for record series, but specific records within that\rseries may need to be retained longer because they are required for litigation or\rbecause circumstances give those records unexpected archival value.", "18": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row. In this case, identifies the source of the AUDIT row\rof data.", "19": "ROW CHANGED BY: Application login id of the user who last changed the row.", "20": "ROW CHANGED DATE: System date of the last time the row was changed.", "21": "ROW CREATED BY: System user who created this row of data.", "22": "ROW CREATED DATE: Date that the row was created on.", "23": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "24": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "25": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}