{"PPDM_RULE_XREF": {"Column Name": {"0": "DEPENDENCY_ID", "1": "RULE_ID", "2": "RULE_ID2", "3": "XREF_OBS_NO", "4": "ACTIVE_IND", "5": "DESCRIPTION", "6": "EFFECTIVE_DATE", "7": "EXPIRY_DATE", "8": "PPDM_GUID", "9": "REMARK", "10": "RULE_XREF_CONDITION", "11": "RULE_XREF_TYPE", "12": "SOURCE", "13": "ROW_CHANGED_BY", "14": "ROW_CHANGED_DATE", "15": "ROW_CREATED_BY", "16": "ROW_CREATED_DATE", "17": "ROW_EFFECTIVE_DATE", "18": "ROW_EXPIRY_DATE", "19": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "N", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "NUMBER", "4": "VARCHAR2", "5": "VARCHAR2", "6": "DATE", "7": "DATE", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "DATE", "15": "VARCHAR2", "16": "DATE", "17": "DATE", "18": "DATE", "19": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "40", "3": "8", "4": "1", "5": "2000", "6": "DATE", "7": "DATE", "8": "38", "9": "2000", "10": "40", "11": "40", "12": "40", "13": "30", "14": "DATE", "15": "30", "16": "DATE", "17": "DATE", "18": "DATE", "19": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": "P", "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN}, "Ref Table(s)": {"0": NaN, "1": "PPDM_RULE", "2": "PPDM_RULE", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": "R_PPDM_RULE_XREF_COND", "11": "R_PPDM_RULE_XREF_TYPE", "12": "R_SOURCE", "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "DEPENDENCY SET IDENTIFIER: A dependency set establishes a group of rules\rthat will be processed as a unit. For example, a set may be created to quality control\rwell locations using 3 rules. If RULE_ID 1 passes, proceed to RULE_ID 2. If it\rfails,proceed to RULE_ID 3.", "1": "RULE IDENTIFIER: Unique identifier for a rule. Rules may be policies, practices,\rprocedures or system business rules.", "2": "RULE IDENTIFIER: Unique identifier for a related rule. Rules may be policies,\rpractices, procedures or system business rules.", "3": "XREF OBSERVATION NUMBER: A unique number added to the PK so that rules\rmay be related to each other more than once, over time or for different business\rreasons.", "4": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "5": "DESCRIPTION: Narrative description of the cross reference between business rules.", "6": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "7": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "8": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "9": "REMARK: A long description describing the information kept within the table in the\rPPDM schema.", "10": "CROSS REFERENCE CONDITION: The type of condition that must be met before\rthis cross reference comes into effect, usually used when you need to create a\rbranched or dependent sequence of events. For example, one row of data will state\rthat if the rule indicated as RULE_ID is successful, go to RULE_ID2. In another row\rof data, you can state that if the first rule has failed, a different RULE_ID2 would be in\rforce.", "11": "PPDM RULE CROSS REFERENCE TYPE: The reason why a cross reference was\rcreated, such as an indication of a rule to be processed in the event that the first rule\rhas been processed and passed or failed. In this case, the reference XREF TYPE\rmay be RUN RULE ID2 if RULE ID passes (or fails). May also be used for rule\rmanagement, such as rule that replaces an old rule, rule that must be implemented\rbefore or after another rule a rule that is a component of another rule, or to build the\rrelationships between policies, practices, procedures and business rules.", "12": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "13": "ROW CHANGED BY: Application login id of the user who last changed the row.", "14": "ROW CHANGED DATE: System date of the last time the row was changed.", "15": "ROW CREATED BY: System user who created this row of data.", "16": "ROW CREATED DATE: Date that the row was created on.", "17": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "18": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "19": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}