{"PPDM_SYSTEM": {"Column Name": {"0": "SYSTEM_ID", "1": "ACTIVE_IND", "2": "BUSINESS_OWNER_BA_ID", "3": "CONNECT_STRING", "4": "CREATOR_BA_ID", "5": "EFFECTIVE_DATE", "6": "EXPIRY_DATE", "7": "OPERATING_SYSTEM", "8": "PPDM_GUID", "9": "PPDM_SYSTEM_TYPE", "10": "RDBMS_ID", "11": "REMARK", "12": "SOURCE", "13": "SYSTEM_LONG_NAME", "14": "TECHNICAL_OWNER_BA_ID", "15": "VERSION_NUM", "16": "ROW_CHANGED_BY", "17": "ROW_CHANGED_DATE", "18": "ROW_CREATED_BY", "19": "ROW_CREATED_DATE", "20": "ROW_EFFECTIVE_DATE", "21": "ROW_EXPIRY_DATE", "22": "ROW_QUALITY"}, "Null": {"0": "N", "1": "Y", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "DATE", "6": "DATE", "7": "VARCHAR2", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "DATE", "18": "VARCHAR2", "19": "DATE", "20": "DATE", "21": "DATE", "22": "VARCHAR2"}, "Length": {"0": "40", "1": "1", "2": "40", "3": "240", "4": "40", "5": "DATE", "6": "DATE", "7": "40", "8": "38", "9": "40", "10": "40", "11": "2000", "12": "40", "13": "255", "14": "40", "15": "30", "16": "30", "17": "DATE", "18": "30", "19": "DATE", "20": "DATE", "21": "DATE", "22": "40"}, "Key": {"0": "P", "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN}, "Ref Table(s)": {"0": NaN, "1": NaN, "2": "BUSINESS_ASSOCIATE", "3": NaN, "4": "BUSINESS_ASSOCIATE", "5": NaN, "6": NaN, "7": "R_PPDM_OPERATING_SYSTE\rM", "8": NaN, "9": "R_PPDM_SYSTEM_TYPE", "10": "R_PPDM_RDBMS", "11": NaN, "12": "R_SOURCE", "13": NaN, "14": "BUSINESS_ASSOCIATE", "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SYSTEM IDENTIFIER: A unique identifier for a data storage system, such as a\rdatabase or XML schema.", "1": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "2": "BUSINESS OWNER BUSINESS ASSOCIATE IDENTIFIER: the business associate\rwho is the owner of the business function of a system, such as the group who\rmanages the functions or business application of the system. Each system may be\rused by many applications. Appropriate contact information for each user system is\rstored in PPDM SYSTEM APPLICATION.", "3": "CONNECT STRING: String used to identify and connect to a remote database. For\rOracle, connect strings are defined in a TNSNAMES.ORA file, Oracle Names Server\ror LDAP directory. When you connect, specify the\rusername/password@connectstring.", "4": "CREATOR BUSINESS ASSOCIATE IDENTIFIER: Unique identifier for the business\rassociate who created this data storage definitions, such as the PPDM Association,\ror a vendor.", "5": "EFFECTIVE DATE: date on which the data in this row came into effect.", "6": "EXPIRY DATE: Date on which the data in this row of data was no longer in effect.", "7": "OPERATING SYSTEM: Also known as an \"OS,\" this is the software that\rcommunicates with computer hardware on the most basic level. Without an operating\rsystem, no software programs can run. The OS is what allocates memory, processes\rtasks, accesses disks and peripherals, and serves as the user interface. (Sharpened\rGlossary)", "8": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "9": "SYSTEM TYPE: A list of valid types of systems, such as Relational Database, XML\rSchema, EDI, etc.", "10": "PPDM RELATIONAL DATA BASE MANAGEMENT SYSTEM: RDBMS, short for\rrelational database management system and pronounced as separate letters, a type\rof database management system (DBMS) that stores data in the form of related\rtables. Relational databases are powerful because they require few assumptions\rabout how data is related or how it will be extracted from the database. As a result,\rthe same database can be viewed in many different ways. An important feature of\rrelational systems is that a single database can be spread across several tables. This\rdiffers from flat-file databases, in which each database is self-contained in a single\rtable. (ISP Glossary)", "11": "REMARK: Narrative remarks about this row of data.", "12": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "13": "SYSTEM LONG NAME: A long descriptive name assigned to a data store.", "14": "TECHNICAL OWNER BUSINESS ASSOCIATE IDENTIFIER: Unique identifier for\rthe business associate who is the technical or system owner or custodian of this data\rstorage system. Usually the group that administers the database itself.", "15": "VERSION NUMBER: The referenced version number of the system, such as 3.8 (for\rPPDM 3.8).", "16": "ROW CHANGED BY: Application login id of the user who last changed the row.", "17": "ROW CHANGED DATE: System date of the last time the row was changed.", "18": "ROW CREATED BY: System user who created this row of data.", "19": "ROW CREATED DATE: Date that the row was created on.", "20": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "21": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "22": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}