{"PPDM_COLUMN": {"Column Name": {"0": "SYSTEM_ID", "1": "TABLE_NAME", "2": "COLUMN_NAME", "3": "ACTIVE_IND", "4": "COLUMN_COMMENT", "5": "COLUMN_KEY_METHOD", "6": "COLUMN_PRECISION", "7": "COLUMN_SCALE", "8": "COLUMN_SEQUENCE", "9": "COLUMN_SIZE", "10": "CONTROL_COLUMN_IND", "11": "CONTROL_COLUMN_NAME", "12": "DATA_TYPE", "13": "DEFAULT_IND_VALUE", "14": "DEFAULT_UOM_ID", "15": "DEFAULT_VALUE_METHOD", "16": "DISTINCT_VALUE_COUNT", "17": "DISTINCT_VALUE_COUNT_DAT", "18": "DOMAIN", "19": "EFFECTIVE_DATE", "20": "EXPIRY_DATE", "21": "EXTENSION_IND", "22": "LAST_SYSTEM_KEY", "23": "NULLABLE_IND", "24": "OUOM_COLUMN_NAME", "25": "PPDM_GUID", "26": "PRIMARY_KEY_SEQUENCE", "27": "REMARK", "28": "SOURCE", "29": "SURROGATE_IND", "30": "UOM_COLUMN_NAME", "31": "ROW_CHANGED_BY", "32": "ROW_CHANGED_DATE", "33": "ROW_CREATED_BY", "34": "ROW_CREATED_DATE", "35": "ROW_EFFECTIVE_DATE", "36": "ROW_EXPIRY_DATE", "37": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y", "33": "Y", "34": "Y", "35": "Y", "36": "Y", "37": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "NUMBER", "7": "NUMBER", "8": "NUMBER", "9": "NUMBER", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "NUMBER", "17": "DATE", "18": "VARCHAR2", "19": "DATE", "20": "DATE", "21": "VARCHAR2", "22": "VARCHAR2", "23": "VARCHAR2", "24": "VARCHAR2", "25": "VARCHAR2", "26": "NUMBER", "27": "VARCHAR2", "28": "VARCHAR2", "29": "VARCHAR2", "30": "VARCHAR2", "31": "VARCHAR2", "32": "DATE", "33": "VARCHAR2", "34": "DATE", "35": "DATE", "36": "DATE", "37": "VARCHAR2"}, "Length": {"0": 40, "1": 30, "2": 30, "3": 1, "4": 2000, "5": 40, "6": 0, "7": 0, "8": 8, "9": 0, "10": 1, "11": 30, "12": 40, "13": 1, "14": 40, "15": "40", "16": "0", "17": "DATE", "18": "40", "19": "DATE", "20": "DATE", "21": "1", "22": "240", "23": "1", "24": "30", "25": "38", "26": "8", "27": "2000", "28": "40", "29": "1", "30": "30", "31": "30", "32": "DATE", "33": "30", "34": "DATE", "35": "DATE", "36": "DATE", "37": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN, "37": NaN}, "Ref Table(s)": {"0": "PPDM_TABLE\rPPDM_COLUMN\rPPDM_COLUMN\rPPDM_COLUMN", "1": "PPDM_TABLE\rPPDM_COLUMN\rPPDM_COLUMN\rPPDM_COLUMN", "2": NaN, "3": NaN, "4": NaN, "5": "R_PPDM_CREATE_METHOD", "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": "PPDM_COLUMN", "12": "R_PPDM_DATA_TYPE", "13": NaN, "14": "PPDM_UNIT_OF_MEASURE", "15": "R_PPDM_DEFAULT_VALUE", "16": NaN, "17": NaN, "18": "PPDM_DOMAIN", "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": "PPDM_COLUMN", "25": NaN, "26": NaN, "27": NaN, "28": "R_SOURCE", "29": NaN, "30": "PPDM_COLUMN", "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN, "37": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SYSTEM IDENTIFIER: A unique identifier for a data storage system, such as a\rdatabase or XML schema.", "1": "TABLE NAME: The name of the table within the schema.", "2": "COLUMN NAME: Name of the column within a specific table found in the schema", "3": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "4": "COLUMN COMMENT: The DDL comments for the comments as provided by\rdesigners.", "5": "PPDM COLUMN KEY METHOD TYPE: The type of method that is used to create the\rvalue in this column. The method could include manual selection and key entry,\rautomated random generation, concatenation of values etc.", "6": "COLUMN PRECISION: The number of digits to the left of the decimal place in a\rnumber. The number of digits to the right of the decimal place is stored in COLUMN\rSCALE. The total number of digits is stored in COLUMN SIZE.", "7": "COLUMN SCALE: The number of digits following the decimal place in a numeric\rfield.", "8": "COLUMN SEQUENCE: A number indicating the position of this column relative to\rother columns in the table. The primary key components should be listed first in the\rsequence, with the most generalized key first, followed by increasingly specific\rcolumns. The remainder of the columns can be sorted as desired by the\rimplementor.", "9": "COLUMN SIZE: The size or length of the column. It is the maximum length, or\rnumber of characters or digits that may be used.", "10": "CONTROL COLUMN INDICATOR: A Y/N flag indicating that this column controls the\rbehavior of vertical components in this table. For example, in the table\rEQUIPMENT_SPEC the column SPEC_TYPE may be used to control which columns\rshould be used (and how they are to be used) for each kind of specification in\rR_EQUIP_SPEC.", "11": "PPDM CONTROL COLUMN NAME: The name of the column in this table that\rcontrols the vertical behavior of the column. For example, in EQUIPMENT_SPEC,\rthe control column name is SPEC_TYPE. The behavior of each kind of specification\rcan be defined as you create the reference values in R_EQUIP_SPEC.", "12": "DATATYPE: The database \"type\" for the column. Oracle uses DATE, NUMBER,\rVARCHAR2, LONG and so on.", "13": "DEFAULT INDICATOR VALUE: in the case where the column is an INDICATOR (a\rY/N flag), the default value for the column, may be Y or N or null.", "14": "DEFAULT UNIT OF MEASURE SYMBOL: The units of measure used for this column\rby default. By Architectural Principle, only those columns which must contain variable\rUOM (such a production volumes) contain a table explicit UOM. Using a common\rUOM for a column avoids the need for full table scans or on-line data conversions\rduring queries.", "15": "DEFAULT VALUE METHOD: The method used to assign a default value to this\rcolumn, in the event that a default value is allowed. May include things like a\rSYSTEM DATE, USERID, null, or some other value. Please note that default values\rshould be used with great caution and documentation of business rules. Default\rvalues can leave users confused, or may be misleading if they are not carefully\rimplemented.", "16": "DISTINCT VALUES COUNT: the number of distinct values that are in this column of\ra table.", "17": "DISTINCT VALUE COUNT DATE: The date that the count of distinct values was last\rcalculated.", "18": "DOMAIN: Name for the domain, or group of common features that make up this\rcolumn. For example, the width, scale, data type, and unit of measure. The domain\rmay be one or more of these items.", "19": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "20": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "21": "EXTENSION INDICATOR: a yes/ no flag indicating whether this column is an\rextension to the standard PPDM structure.", "22": "LAST SYSTEM ASSIGNED KEY: the value of the last system assigned key for this\rcolumn in the database. Used for surrogate keys, but not for OBS_NO or SEQ_NO,\rboth of which should re-sequence to value 1 for each new parent.", "23": "NULLABLE INDICATOR: a column indicating whether the column is nullable in this\rimplementation. A value of Y indicates the column is nullable (optional). PPDM\rdefinitions usually make the PK NOT NULL, and other columns nullable, but site\rimplementations may make additional columns mandatory based on business\rrequirements.", "24": "ORIGINAL UNIT OF MEASURE COLUMN NAME: Name of the column in this table\rthat contains the original unit of measure for the value of this column.", "25": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "26": "PRMARY KEY SEQUENCE: a number which permits ordering of components of the\rPrimary Key, particularly when multiple components are required.", "27": "REMARK: Narrative remarks relating to this row of data.", "28": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "29": "SURROGATE INDICATOR: A Y/N flag indicating that this column is assigned a\rsurrogate value on creation.", "30": "UNIT OF MEASURE COLUMN NAME: Name of the column in this table that contains\rthe unit of measure for the value of this column.", "31": "ROW CHANGED BY: Application login id of the user who last changed the row.", "32": "ROW CHANGED DATE: System date of the last time the row was changed.", "33": "ROW CREATED BY: System user who created this row of data.", "34": "ROW CREATED DATE: Date that the row was created on.", "35": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "36": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "37": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}