{"PPDM_PROPERTY_COLUMN": {"Column Name": {"0": "PROPERTY_SET_ID", "1": "PROPERTY_OBS_NO", "2": "ACTIVE_IND", "3": "COLUMN_PRECISION", "4": "COLUMN_SCALE", "5": "COLUMN_SIZE", "6": "DATA_TYPE", "7": "DOMAIN", "8": "EFFECTIVE_DATE", "9": "EXPIRY_DATE", "10": "PPDM_GUID", "11": "PREFERRED_CURRENCY_UOM", "12": "PREFERRED_UOM", "13": "QUANTITY_TYPE", "14": "REFERENCED_SYSTEM_ID", "15": "REFERENCED_TABLE_NAME", "16": "REMARK", "17": "SOURCE", "18": "USE_COLUMN_NAME", "19": "USE_INDICATOR_IND", "20": "USE_SYSTEM_ID", "21": "USE_TABLE_NAME", "22": "ROW_CHANGED_BY", "23": "ROW_CHANGED_DATE", "24": "ROW_CREATED_BY", "25": "ROW_CREATED_DATE", "26": "ROW_EFFECTIVE_DATE", "27": "ROW_EXPIRY_DATE", "28": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "NUMBER", "2": "VARCHAR2", "3": "NUMBER", "4": "NUMBER", "5": "NUMBER", "6": "VARCHAR2", "7": "VARCHAR2", "8": "DATE", "9": "DATE", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "VARCHAR2", "19": "VARCHAR2", "20": "VARCHAR2", "21": "VARCHAR2", "22": "VARCHAR2", "23": "DATE", "24": "VARCHAR2", "25": "DATE", "26": "DATE", "27": "DATE", "28": "VARCHAR2"}, "Length": {"0": "40", "1": "8", "2": "1", "3": "10,5", "4": "10,5", "5": "10,5", "6": "40", "7": "40", "8": "DATE", "9": "DATE", "10": "38", "11": "40", "12": "40", "13": "40", "14": "40", "15": "30", "16": "2000", "17": "40", "18": "30", "19": "1", "20": "40", "21": "30", "22": "30", "23": "DATE", "24": "30", "25": "DATE", "26": "DATE", "27": "DATE", "28": "40"}, "Key": {"0": "P", "1": "P", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN}, "Ref Table(s)": {"0": "PPDM_PROPERTY_SET", "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": "R_PPDM_DATA_TYPE", "7": "PPDM_DOMAIN", "8": NaN, "9": NaN, "10": NaN, "11": "PPDM_UNIT_OF_MEASURE", "12": "PPDM_UNIT_OF_MEASURE", "13": "PPDM_QUANTITY", "14": "PPDM_TABLE", "15": "PPDM_TABLE", "16": NaN, "17": "R_SOURCE", "18": "PPDM_COLUMN", "19": NaN, "20": "PPDM_COLUMN", "21": "PPDM_COLUMN", "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "TABLE PROPERTY CONTROL IDENTIFIER: Unique identifier for the property\rcontrol information. This can be used to help you control how a vertical table is\rimplemented, by determining preferred units of measure, data entry types and other\rspecifications for each kind of property that is defined.", "1": "PROPERTY SET OBSERVATION NUMBER: Unique identifier for this instance of the\rusage of a property set.", "2": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "3": "COLUMN PRECISION: The number of digits to the left of the decimal place in a\rnumber. The number of digits to the right of the decimal place is stored in COLUMN\rSCALE. The total number of digits is stored in COLUMN SIZE.", "4": "COLUMN SCALE: The number of digits following the decimal place in a numeric\rfield.", "5": "COLUMN SIZE: The size or length of the column. It is the maximum length, or\rnumber of characters or digits that may be used.", "6": "DATATYPE: The database \"type\" for the column. Oracle uses DATE, NUMBER,\rVARCHAR2, LONG and so on.", "7": "DOMAIN: Name for the domain, or group of common features that make up this\rcolumn. For example, the width, scale, datatype, and unit of measure. The domain\rmay be one or more of these items.", "8": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "9": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "10": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should becreated.", "11": "UNIT OF MEASURE", "12": "DEFAULT UNIT OF MEASURE SYMBOL: The units of measure used for this column\rby default. By Architectural Principle, only those columns which must contain variable\rUOM (such a production volumes) contain a table explicit UOM. Using a common\rUOM for a column avoids the need for full table scans or on-line data conversions\rduring queries.", "13": "QUANTITY: Describes the type of value that is being measured, The Conventions of\rASTM/IEEE SI-10 are used wherever possible. For example, length, luminance,\rmass density, power.", "14": "SYSTEM IDENTIFIER: A unique identifier for a data storage system, such as a\rdatabase or XML schema.", "15": "REFERENCED TABLE NAME: The name of the reference table that contains the\rvalues to be used for this value. Note that referential integrity cannot be applied to\rthis type of validation, so great care must be taken to be sure that corrupt data does\rnot enter the system.", "16": "REMARK: Narrative remarks about this row of data.", "17": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "18": "USE COLUMN NAME: The name of the column in the business table for which\rstorage parameters are being defined. For example, if a parameter (property type) is\rdiameter, you may choose to store the minimum and maximum diameter in\rmillimeters. In that case, you will need to use four columns (MIN VALUE and its\rpreferred unit of measure, MAX VALUE and its preferred unit of measure),", "19": "USE INDICATOR INDICATOR: This column is flagged when the stored value in a\rproperty table is a Y/N flag.", "20": "SYSTEM IDENTIFIER: A unique identifier for a data storage system, such as a\rdatabase or XML schema.", "21": "USE TABLE NAME: The name of the business table that contains the stored values\rof the parameters. For example, if a reference table is R EQUIP CAT SPEC, the\rused table could be EQUP CATALOGUE SPEC.", "22": "ROW CHANGED BY: Application login id of the user who last changed the row.", "23": "ROW CHANGED DATE: System date of the last time the row was changed.", "24": "ROW CREATED BY: System user who created this row of data.", "25": "ROW CREATED DATE: Date that the row was created on.", "26": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "27": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "28": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}