{"R_WELL_STATUS_SYMBOL": {"Column Name": {"0": "PLOT_SYMBOL", "1": "PLOT_SYMBOL_OBS_NO", "2": "ACTIVE_IND", "3": "EFFECTIVE_DATE", "4": "EXPIRY_DATE", "5": "PPDM_GUID", "6": "QUALIFIER_VALUE", "7": "REMARK", "8": "SOURCE", "9": "STATUS", "10": "STATUS_FACET_COUNT", "11": "STATUS_QUALIFIER", "12": "STATUS_TYPE", "13": "ROW_CHANGED_BY", "14": "ROW_CHANGED_DATE", "15": "ROW_CREATED_BY", "16": "ROW_CREATED_DATE", "17": "ROW_EFFECTIVE_DATE", "18": "ROW_EXPIRY_DATE", "19": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "NUMBER", "2": "VARCHAR2", "3": "DATE", "4": "DATE", "5": "VARCHAR2", "6": "VARCHAR2", "7": "VARCHAR2", "8": "VARCHAR2", "9": "VARCHAR2", "10": "NUMBER", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "DATE", "15": "VARCHAR2", "16": "DATE", "17": "DATE", "18": "DATE", "19": "VARCHAR2"}, "Length": {"0": "40", "1": "8", "2": "1", "3": "DATE", "4": "DATE", "5": "38", "6": "40", "7": "2000", "8": "40", "9": "40", "10": "10", "11": "40", "12": "40", "13": "30", "14": "DATE", "15": "30", "16": "DATE", "17": "DATE", "18": "DATE", "19": "40"}, "Key": {"0": "P", "1": "P", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN}, "Ref Table(s)": {"0": "R_PLOT_SYMBOL", "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": "R_WELL_STATUS_QUAL_VAL\rUE", "7": NaN, "8": "R_SOURCE", "9": "R_WELL_STATUS R_WELL_ST\rATUS_QUAL_VALUE", "10": NaN, "11": "R_WELL_STATUS_QUAL_VAL\rUE", "12": "R_WELL_STATUS R_WELL_ST\rATUS_QUAL_VALUE", "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "WELL STATUS PLOT SYMBOL: Thiscolumn contains the reference to a plot symbol\rwith the appropriate facet definition or definitions that contribute to its construction.\rAs described in Well Status http://www.ppdm.org/standards/wellstatus, the plot\rsymbols may be based on one or more facet definitions that are used IN\rCOMBINATION to create a symbol.", "1": "PLOT SYMBOL OBSERVATION NUMBER: Unique sequencer.", "2": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "3": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "4": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "5": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "6": "WELL STATUS QUALIFIER VALUE: This column contains the valid values for each\rof the well status qualifiers defined by the well status workgroup\rhttp://www.ppdm.org/standards/wellstatus. This column should only be used to store\rthe values for qualifiers, and not for well status values themselves. For example, in\rthe well status facet FLUID TYPE, a valid qualifier is ABUNDENCE (goes in\rSTATUS_QUALIFIER). This column will capture the values PRIMARY,\rSECONDARY, SHOW and TRACE.", "7": "REMARK: Narrative remarks about this row of data.", "8": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "9": "WELL STATUS: This reference table defines the status of the well. For example:\rcased, spudded, licensed, dry, abandoned oil, gas, ...", "10": "STATUS FACET COUNT: This column tells you how many different well status\rfacets are used IN COMBINATION to specify the use of a plot symbol. Although most\rsymbols will only require the use of one facet, some may require more than one.", "11": "WELL STATUS QUALIFIER This column contains the valid type of well status\rqualifiers defined by the well status workgroup\rhttp://www.ppdm.org/standards/wellstatus. For example, in the well status facet\rFLUID TYPE, valid qualifiers are ABUNDENCE and COMPONENT FLUID DETAIL.", "12": "WELL STATUS TYPE: The type of status reported for the well. Can include\rconstruction status, operating status, producing status, abandonment status etc.", "13": "ROW CHANGED BY: Application login id of the user who last changed the row.", "14": "ROW CHANGED DATE: System date of the last time the row was changed.", "15": "ROW CREATED BY: System user who created this row of data.", "16": "ROW CREATED DATE: Date that the row was created on.", "17": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "18": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "19": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}