{"REPORT_HIER_USE": {"Column Name": {"0": "REPORT_HIERARCHY_ID", "1": "COMPONENT_ID", "2": "HIERARCHY_USE_OBS_NO", "3": "ACTIVE_IND", "4": "CONTRIBUTION_PERCENT", "5": "EFFECTIVE_DATE", "6": "EXPIRY_DATE", "7": "PDEN_ID", "8": "PDEN_SOURCE", "9": "PDEN_SUBTYPE", "10": "PPDM_GUID", "11": "REMARK", "12": "REPORT_IND", "13": "RESENT_ID", "14": "SOURCE", "15": "SUBSTANCE_ID", "16": "ROW_CHANGED_BY", "17": "ROW_CHANGED_DATE", "18": "ROW_CREATED_BY", "19": "ROW_CREATED_DATE", "20": "ROW_EFFECTIVE_DATE", "21": "ROW_EXPIRY_DATE", "22": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "NUMBER", "3": "VARCHAR2", "4": "NUMBER", "5": "DATE", "6": "DATE", "7": "VARCHAR2", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "DATE", "18": "VARCHAR2", "19": "DATE", "20": "DATE", "21": "DATE", "22": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "8", "3": "1", "4": "15,12", "5": "DATE", "6": "DATE", "7": "40", "8": "40", "9": "30", "10": "38", "11": "2000", "12": "1", "13": "40", "14": "40", "15": "40", "16": "30", "17": "DATE", "18": "30", "19": "DATE", "20": "DATE", "21": "DATE", "22": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN}, "Ref Table(s)": {"0": "REPORT_HIER_LEVEL", "1": "REPORT_HIER_LEVEL", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": "PDEN", "8": "PDEN", "9": "PDEN", "10": NaN, "11": NaN, "12": NaN, "13": "RESERVE_ENTITY", "14": "R_SOURCE", "15": "SUBSTANCE", "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "REPORTING HIERARCHY IDENTIFIER: Unique identifier for the reporting reserves\rhierarchy that has been defined.", "1": "COMPONENT IDENTIFIER: Unique identifier for the component associated with this\rhierarchy level.", "2": "RESERVE ENTITY HIERARCHY USE OBSERVATION NUMBER: Unique\rcomponent added to the primary key that allows you to associate a hierarchy with a\rproduction entity or a reserves entity. For convenience, this table remains part of the\rreserves module, but users should be aware that it can be shared. More than one\rentity may be associated with a specific level of the hierarchy.", "3": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "4": "CONTRIBUTION PERCENT: the percent contribution for a substance that is used for\rreporting, such as 50% of NGL.", "5": "EFFECTIVE DATE: date on which the data in this row came into effect.", "6": "EXPIRY DATE: Date on which the data in this row of data was no longer in effect.", "7": "PRODUCTION ENTITY IDENTIFIER: An identifier that is unique within a specific\rproduction entity source and type.", "8": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "9": "PRODUCTION ENTITY SUBTYPE: the type of production entity may be equal to one\rof the table names of the PDEN subtype tables, such as PDEN_WELL,\rPDEN_COUNTY or PDEN_FIELD. Validated by check constraint.", "10": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "11": "REMARK: Narrative remarks about this row of data.", "12": "REPORT IND: A Y/N flag added to allow users to keep track of rows that should be\rincluded in reporting.", "13": "RESERVES ENTITY IDENTIFIER: unique identifier for a reserves entity. A reserves\rentity may be comprised of a single business object (such as a well) or a group of\rbusiness objects (such as all the completions producing from a pool).", "14": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "15": "SUBSTANCE IDENTIFIER: Unique identifier for a substance that can be described\reither chemically or in terms of composition. Elements, ions, isotopes, isomers,\rminerals, chemicals, solvents, production substances, hydrocarbons etc are all listed.\rBe advised that many applications and agencies may use the same term, but the\rdefinition and composition details may not be the same. Use the SUBSTANCE XREF\rtable to capture relationships between substances, such as similar substances.", "16": "ROW CHANGED BY: Application login id of the user who last changed the row.", "17": "ROW CHANGED DATE: System date of the last time the row was changed.", "18": "ROW CREATED BY: System user who created this row of data.", "19": "ROW CREATED DATE: Date that the row was created on.", "20": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "21": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "22": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}