{"RESENT_ECO_RUN": {"Column Name": {"0": "RESENT_ID", "1": "RESERVE_CLASS_ID", "2": "ECONOMICS_RUN_ID", "3": "ACTIVE_IND", "4": "CURRENCY_CONVERSION", "5": "CURRENCY_OUOM", "6": "CURRENCY_UOM", "7": "ECONOMIC_FORECAST", "8": "ECONOMIC_SCENARIO", "9": "EFFECTIVE_DATE", "10": "EXPIRY_DATE", "11": "GROSS_IND", "12": "INTEREST_SET_ID", "13": "INTEREST_SET_SEQ_NO", "14": "NET_IND", "15": "NET_PRESENT_VALUE", "16": "PARTNER_BA_ID", "17": "PARTNER_OBS_NO", "18": "PPDM_GUID", "19": "REMARK", "20": "RESERVE_LIFE_INDEX", "21": "SOURCE", "22": "TECH_FORECAST", "23": "ROW_CHANGED_BY", "24": "ROW_CHANGED_DATE", "25": "ROW_CREATED_BY", "26": "ROW_CREATED_DATE", "27": "ROW_EFFECTIVE_DATE", "28": "ROW_EXPIRY_DATE", "29": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "NUMBER", "5": "VARCHAR2", "6": "VARCHAR2", "7": "NUMBER", "8": "VARCHAR2", "9": "DATE", "10": "DATE", "11": "VARCHAR2", "12": "VARCHAR2", "13": "NUMBER", "14": "VARCHAR2", "15": "NUMBER", "16": "VARCHAR2", "17": "NUMBER", "18": "VARCHAR2", "19": "VARCHAR2", "20": "NUMBER", "21": "VARCHAR2", "22": "NUMBER", "23": "VARCHAR2", "24": "DATE", "25": "VARCHAR2", "26": "DATE", "27": "DATE", "28": "DATE", "29": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "40", "3": "1", "4": "10,5", "5": "40", "6": "40", "7": "8,2", "8": "40", "9": "DATE", "10": "DATE", "11": "1", "12": "40", "13": "8", "14": "1", "15": "12,2", "16": "40", "17": "8", "18": "38", "19": "2000", "20": "8,2", "21": "40", "22": "8,2", "23": "30", "24": "DATE", "25": "30", "26": "DATE", "27": "DATE", "28": "DATE", "29": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN}, "Ref Table(s)": {"0": "RESENT_CLASS", "1": "RESENT_CLASS", "2": NaN, "3": NaN, "4": NaN, "5": "PPDM_UNIT_OF_MEASURE", "6": "PPDM_UNIT_OF_MEASURE", "7": NaN, "8": "R_ECONOMIC_SCENARIO", "9": NaN, "10": NaN, "11": NaN, "12": "INT_SET_PARTNER", "13": "INT_SET_PARTNER", "14": NaN, "15": NaN, "16": "INT_SET_PARTNER", "17": "INT_SET_PARTNER", "18": NaN, "19": NaN, "20": NaN, "21": "R_SOURCE", "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "RESERVES ENTITY IDENTIFIER: unique identifier for a reserves entity. A reserves\rentity may be comprised of a single business object (such as a well) or a group of\rbusiness objects (such as all the completions producing from a pool).", "1": "RESERVE CLASS IDENTIFIER: The reserve classed for identifying the confidence\rlevel and producing status of the reserve volumes.", "2": "RESERVES ENTITY ECONOMICS RUN IDENTIFIER: a unique identifer for an\reconomics run", "3": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "4": "CURRENCY CONVERSION: A number which, when multipled by the stored value,\rwill re-create the original value in the original currency used.", "5": "CURRENCY ORIGINAL UNITS OF MEASURE: The units of measure in which the\rcurrency was originally received.", "6": "PREFERRED CURRENCY: Indicates for the business associate, the type of\rcurrency preferred for this type of transaction. Note that different preferences can be\rset for various types of transactions.", "7": "ECONOMIC FORECAST LIFE: Years remaining in the economic reserve forecast.", "8": "ECONOMIC SCENARIO: A set of assumptions regarding future pricing, operating\rcosts, inflation factors etc. which are used to run economic evaluations.", "9": "EFFECTIVE DATE: date on which the data in this row came into effect.", "10": "EXPIRY DATE: Date on which the data in this row of data was no longer in effect.", "11": "GROSS SUMMARY INDICATOR: A Y/N flag indicating whether this row of data\rrelates to gross values, as opposed to net values.", "12": "INTEREST SET IDENTIFIER: unique identifier for the interest set.", "13": "BA INTEREST SET SEQUENCE NUMBER: unique sequencing component to allow\rverioning of the interest set over time.", "14": "NET SUMMARY INDICATOR: A Y/N flag indicating whether this row of data relates\rto net values, as opposed to gross values.", "15": "NET PRESENT VALUE: This reflects the discounting of all future cash received,\rdiscounted at the DISCOUNT_RATE.", "16": "PARTNER BUSINESS ASSOCIATE IDENTIFIER: Unique identifier for a business\rassociate, such as a person, company, regulatory agency, government or\rconsortium. Unique identifier for the business associate who is a partner in an\rinterest set.", "17": "PARTNER OBSERVATION NUMBER: This column is used when a business\rassociate holds more than one interest share of a specific interest type (working,\rproduction etc) in a partnership. This can happen as a result of corporate mergers or\rasset acquisitions. If a partner only holds one interest share, this number will always\rbe 1. Please note that this column should not be used to track multiple interest types;\rin this event, a new interest set must be created.", "18": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "19": "REMARK: Narrative remarks about this row of data.", "20": "RESERVE LIFE INDEX: Remaining reserves volume divided by previous years\rproduction volume. Measured in years.", "21": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "22": "TECHNICAL FORECAST LIFE: Years remaining in the technical reserve forecast.", "23": "ROW CHANGED BY: Application login id of the user who last changed the row.", "24": "ROW CHANGED DATE: System date of the last time the row was changed.", "25": "ROW CREATED BY: System user who created this row of data.", "26": "ROW CREATED DATE: Date that the row was created on.", "27": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "28": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "29": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}