{"RESTRICTION": {"Column Name": {"0": "RESTRICTION_ID", "1": "RESTRICTION_VERSION", "2": "ACTIVE_IND", "3": "DESCRIPTION", "4": "EFFECTIVE_DATE", "5": "END_DATE", "6": "END_DATE_EVENT", "7": "EXPIRY_DATE", "8": "PPDM_GUID", "9": "REGULATORY_ACT", "10": "REMARK", "11": "RESTRICTION_CLASS", "12": "RESTRICTION_NAME", "13": "RESTRICTION_TYPE", "14": "REST_DURATION_TYPE", "15": "SOURCE", "16": "SOURCE_DOCUMENT_ID", "17": "START_DATE", "18": "START_DATE_EVENT", "19": "ROW_CHANGED_BY", "20": "ROW_CHANGED_DATE", "21": "ROW_CREATED_BY", "22": "ROW_CREATED_DATE", "23": "ROW_EFFECTIVE_DATE", "24": "ROW_EXPIRY_DATE", "25": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "NUMBER", "2": "VARCHAR2", "3": "VARCHAR2", "4": "DATE", "5": "DATE", "6": "DATE", "7": "DATE", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "DATE", "18": "DATE", "19": "VARCHAR2", "20": "DATE", "21": "VARCHAR2", "22": "DATE", "23": "DATE", "24": "DATE", "25": "VARCHAR2"}, "Length": {"0": "40", "1": "8", "2": "1", "3": "2000", "4": "DATE", "5": "DATE", "6": "DATE", "7": "DATE", "8": "38", "9": "240", "10": "2000", "11": "40", "12": "255", "13": "40", "14": "40", "15": "40", "16": "40", "17": "DATE", "18": "DATE", "19": "30", "20": "DATE", "21": "30", "22": "DATE", "23": "DATE", "24": "DATE", "25": "40"}, "Key": {"0": "P", "1": "P", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN}, "Ref Table(s)": {"0": NaN, "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": "REST_CLASS", "12": NaN, "13": "R_REST_TYPE", "14": "R_REST_DURATION", "15": "R_SOURCE", "16": "SOURCE_DOCUMENT", "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "RESTRICTION ID: Unique identifier for the restriction.", "1": "RESTRICTION VERSION: The version number of the restriction. In some areas,\rchanges to the detailed requirements of a restriction result in versioning.", "2": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "3": "DESCRIPTION: A textual description of the surface restriction, as found in the\rregulatory documentation.", "4": "EFFECTIVE DATE: the date that the restriction first came into effect. Start and end\rdates for individual cycles are tracked as START and END DATE.", "5": "END DATE: The date the restriction is no longer in effect", "6": "END DATE EVENT: A textual description of the time when the restriction is no longer\rin effect, such as December, after the ranger determines that moose mating season\ris over.", "7": "EXPIRY DATE: the date on which this row of data is no longer in effect from a\rbusiness perspective.", "8": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "9": "REGULATORY ACT or LEGISLATION: The name or title of an act, peice of\rlegislation or a regulation that has been set up to manage a restricted area such as a\rbird sanctuary, migration route, fishery or logging reserve.", "10": "REMARK: general remark about the surface restriction. Detailed remarks may be\rtracked in the table LD SURF REST REMARK.", "11": "SURFACE RESTRICTION CLASSIFICATION: the code or type of the surface\rrestriction classification. For example, Bird Sactuaries in Alberta have a Class code\rBSA.", "12": "RESTRICTION NAME: The name of the restricted area, or the restriction.", "13": "RESTRICTION TYPE: The type of restriction, such as environmental, heritiage,\rendangered species protection etc.", "14": "RESTRICTION DURATION TYPE: whether the restriction is active for durations that\rare seasonal, permanent, variable, event driven, date driven etc.", "15": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "16": "SOURCE DOCUMENT: A list of documents that are used as the source for supplying\rdata. Source documents may include government and regulatory forms, operator\rreports or scout tickets, publications, news letters, books or jounals.", "17": "START DATE: The state date the restriction becomes effective", "18": "START DATE EVENT: A textual description of the start date of the restriction, such\ras from the date the roads thaw in spring.", "19": "ROW CHANGED BY: Application login id of the user who last changed the row.", "20": "ROW CHANGED DATE: System date of the last time the row was changed.", "21": "ROW CREATED BY: System user who created this row of data.", "22": "ROW CREATED DATE: Date that the row was created on.", "23": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "24": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "25": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}