{"RM_INFO_ITEM_MAINT": {"Column Name": {"0": "INFO_ITEM_SUBTYPE", "1": "INFORMATION_ITEM_ID", "2": "MAINTAIN_ID", "3": "ACTIVE_IND", "4": "EFFECTIVE_DATE", "5": "EXPIRY_DATE", "6": "INSTRUCTION", "7": "MAINT_BA_ID", "8": "MAINT_COMPLETE_DATE", "9": "MAINT_DUE_DATE", "10": "MAINT_PERIOD", "11": "MAINT_PERIOD_TYPE", "12": "PPDM_GUID", "13": "REMARK", "14": "SCHEDULED_IND", "15": "SOURCE", "16": "ROW_CHANGED_BY", "17": "ROW_CHANGED_DATE", "18": "ROW_CREATED_BY", "19": "ROW_CREATED_DATE", "20": "ROW_EFFECTIVE_DATE", "21": "ROW_EXPIRY_DATE", "22": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "DATE", "5": "DATE", "6": "VARCHAR2", "7": "VARCHAR2", "8": "DATE", "9": "DATE", "10": "NUMBER", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "DATE", "18": "VARCHAR2", "19": "DATE", "20": "DATE", "21": "DATE", "22": "VARCHAR2"}, "Length": {"0": "30", "1": "40", "2": "40", "3": "1", "4": "DATE", "5": "DATE", "6": "2000", "7": "40", "8": "DATE", "9": "DATE", "10": "10,5", "11": "40", "12": "38", "13": "2000", "14": "1", "15": "40", "16": "30", "17": "DATE", "18": "30", "19": "DATE", "20": "DATE", "21": "DATE", "22": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN}, "Ref Table(s)": {"0": "RM_INFORMATION_ITEM", "1": "RM_INFORMATION_ITEM", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": "BUSINESS_ASSOCIATE", "8": NaN, "9": NaN, "10": NaN, "11": "R_PERIOD_TYPE", "12": NaN, "13": NaN, "14": NaN, "15": "R_SOURCE", "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "INFORMATION ITEM SUBTYPE: the type of information item. May be one of The\rvalid types of Information item as defined by check constraints.", "1": "INFORMATION ITEM ID: Unique identifier for the information item.", "2": "MAINTAINANCE IDENTIFIER: Unique identifier for the maintenance schedule\ridentifier.", "3": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "4": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "5": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "6": "INSTRUCTIONS: Use this column to capture instructions about how to deal with the\rbusiness associate, or what process should be followed for the maintenance.", "7": "MAINTENANCE BUSINESS ASSOCIATE ID: Validated business associate id for the\rBUSINESS ASSOCIATE who conducted or was responsible for the maintenance.\rNote that additional contact information may be captured in RM INFO ITEM BA", "8": "MAINTENANCE COMPLETED DATE: the date when the last maintenance event\rwas completed.", "9": "MAINTENANCE DUE DATE: the date when the next maintenance event is due.", "10": "MAINENANCE PERIOD VALUE: the number of periods that elapse between\rscheduled maintenance cycles, such as the interval between updates of a dataset.", "11": "MAINTENANCE PERIOD: The type of frequency of or period between typical\rmaintenance occurences, such as the period between updates of a file. Usually days\ror months.", "12": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "13": "REMARK: Narrative remarks relating to this row of data.", "14": "SCHEDULED INDICATOR: A Y/N flag indicating that the maintence of this\rinformtaion is scheduled by a service agreement. Y indicates that there is a\rscheduled agreement in place. N indicates that no scheduled agreement is in place;\rin this case, updates would be aquired on an as requested basis.", "15": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "16": "ROW CHANGED BY: Application login id of the user who last changed the row.", "17": "ROW CHANGED DATE: System date of the last time the row was changed.", "18": "ROW CREATED BY: System user who created this row of data.", "19": "ROW CREATED DATE: Date that the row was created on.", "20": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "21": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "22": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}