{"RM_INFO_ITEM_BA": {"Column Name": {"0": "INFO_ITEM_SUBTYPE", "1": "INFORMATION_ITEM_ID", "2": "CONTACT_ID", "3": "ACTIVE_IND", "4": "CONTACT_BA_ID", "5": "CONTACT_BA_TYPE", "6": "CONTACT_FULL_NAME", "7": "CONTACT_TYPE", "8": "EFFECTIVE_DATE", "9": "EXPIRY_DATE", "10": "FIRST_NAME", "11": "INSTRUCTION", "12": "LAST_NAME", "13": "MIDDLE_NAME", "14": "PPDM_GUID", "15": "REMARK", "16": "SOURCE", "17": "ROW_CHANGED_BY", "18": "ROW_CHANGED_DATE", "19": "ROW_CREATED_BY", "20": "ROW_CREATED_DATE", "21": "ROW_EFFECTIVE_DATE", "22": "ROW_EXPIRY_DATE", "23": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "VARCHAR2", "7": "VARCHAR2", "8": "DATE", "9": "DATE", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "DATE", "19": "VARCHAR2", "20": "DATE", "21": "DATE", "22": "DATE", "23": "VARCHAR2"}, "Length": {"0": "30", "1": "40", "2": "40", "3": "1", "4": "40", "5": "40", "6": "255", "7": "40", "8": "DATE", "9": "DATE", "10": "255", "11": "2000", "12": "255", "13": "255", "14": "38", "15": "2000", "16": "40", "17": "30", "18": "DATE", "19": "30", "20": "DATE", "21": "DATE", "22": "DATE", "23": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN}, "Ref Table(s)": {"0": "RM_INFORMATION_ITEM", "1": "RM_INFORMATION_ITEM", "2": NaN, "3": NaN, "4": "BUSINESS_ASSOCIATE", "5": "R_BA_TYPE", "6": NaN, "7": "R_RMII_CONTACT_TYPE", "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": "R_SOURCE", "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "INFORMATION ITEM SUBTYPE: the type of information item. May be one of The\rvalid types of Information item as defined by check constraints.", "1": "INFORMATION ITEM ID: Unique identifier for the information item.", "2": "CONTACT ID: Unique identifier for the contact or other business associated related\rto this information item. This is not a FK from the Business associate table, as not all\rimplementations will wish to validate all authors against that module. For validation to\rBA, use CONTACT_BA_ID. For unvalidated names, use NAME fields.", "3": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "4": "CONTACT BUSINESS ASSOCIATE ID: Validated business associate id for the ba\rwho is a contact or other BA associated with this information item.", "5": "CONTACT BUSINESS ASSOCIATE TYPE: The type of business associate who is\rthe contact, such as PERSON, COMPANY or GOVERNMENT.", "6": "CONTACT NAME: the full name of a company or person as it appears on\rdocumentation, to be used in the case where the user does not wish to include the\rcontact in the list of valid business associates (BUSINESS ASSOCIATE). Please\rnote that useof this field will make searches more difficult and may result in degraded\rdata quality.", "7": "CONTACT TYPE: The type of contact for an information item, other than authorship.\rFor example, you may need to capture the contact for purchase, the contact for\rauthorization to access the information or the contact for obtaining updates.", "8": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "9": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "10": "FIRST NAME: first name or initial of the author, used only when the authorship is not\rvalidated against the Business Associate tables.", "11": "INSTRUCTIONS: Use this column to capture instructions about how to deal with the\rbusiness associate, or what process should be followed.", "12": "LAST NAME: last name of the author, used only when the authorship is not validated\ragainst the Business Associate tables.", "13": "MIDDLE NAME: Middle name or initials of the author, used only when the authorship\ris not validated against the Business Associate tables.", "14": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "15": "REMARK: Narrative remarks relating to this row of data.", "16": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "17": "ROW CHANGED BY: Application login id of the user who last changed the row.", "18": "ROW CHANGED DATE: System date of the last time the row was changed.", "19": "ROW CREATED BY: System user who created this row of data.", "20": "ROW CREATED DATE: Date that the row was created on.", "21": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "22": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "23": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}