{"RM_INFORMATION_ITEM": {"Column Name": {"0": "INFO_ITEM_SUBTYPE", "1": "INFORMATION_ITEM_ID", "2": "ABSTRACT", "3": "ACCEPTED_DATE", "4": "ACCESS_CONDITION", "5": "ACTIVE_IND", "6": "AVAILABLE_DATE", "7": "COORD_ACQUISITION_ID", "8": "COPYRIGHT_DATE", "9": "EFFECTIVE_DATE", "10": "EXPIRY_DATE", "11": "GEOG_COORD_SYSTEM_ID", "12": "GROUP_IND", "13": "ISSUE_DATE", "14": "ITEM_CATEGORY", "15": "ITEM_SUB_CATEGORY", "16": "LOCAL_COORD_SYSTEM_ID", "17": "MAP_COORD_SYSTEM_ID", "18": "MAX_LATITUDE", "19": "MAX_LONGITUDE", "20": "MIN_LATITUDE", "21": "MIN_LONGITUDE", "22": "MODIFIED_DATE", "23": "ORIGIN_DATE", "24": "PPDM_GUID", "25": "PUBLISH_DATE", "26": "PURPOSE", "27": "REFERENCE_NUM", "28": "REMARK", "29": "SECURITY_DESC", "30": "SOURCE", "31": "SOURCE_DOCUMENT_ID", "32": "SUBMIT_DATE", "33": "TIME_PERIOD_DESC", "34": "TITLE", "35": "USE_CONDITION", "36": "VERSION_NUM", "37": "ROW_CHANGED_BY", "38": "ROW_CHANGED_DATE", "39": "ROW_CREATED_BY", "40": "ROW_CREATED_DATE", "41": "ROW_EFFECTIVE_DATE", "42": "ROW_EXPIRY_DATE", "43": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y", "33": "Y", "34": "Y", "35": "Y", "36": "Y", "37": "Y", "38": "Y", "39": "Y", "40": "Y", "41": "Y", "42": "Y", "43": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "DATE", "4": "VARCHAR2", "5": "VARCHAR2", "6": "DATE", "7": "VARCHAR2", "8": "DATE", "9": "DATE", "10": "DATE", "11": "VARCHAR2", "12": "VARCHAR2", "13": "DATE", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "NUMBER", "19": "NUMBER", "20": "NUMBER", "21": "NUMBER", "22": "DATE", "23": "DATE", "24": "VARCHAR2", "25": "DATE", "26": "VARCHAR2", "27": "VARCHAR2", "28": "VARCHAR2", "29": "VARCHAR2", "30": "VARCHAR2", "31": "VARCHAR2", "32": "DATE", "33": "VARCHAR2", "34": "VARCHAR2", "35": "VARCHAR2", "36": "VARCHAR2", "37": "VARCHAR2", "38": "DATE", "39": "VARCHAR2", "40": "DATE", "41": "DATE", "42": "DATE", "43": "VARCHAR2"}, "Length": {"0": "30", "1": "40", "2": "2000", "3": "DATE", "4": "2000", "5": "1", "6": "DATE", "7": "40", "8": "DATE", "9": "DATE", "10": "DATE", "11": "40", "12": "1", "13": "DATE", "14": "40", "15": "40", "16": "40", "17": "40", "18": "14,9", "19": "14,9", "20": "14,9", "21": "14,9", "22": "DATE", "23": "DATE", "24": "38", "25": "DATE", "26": "2000", "27": "240", "28": "2000", "29": "240", "30": "40", "31": "40", "32": "DATE", "33": "240", "34": "240", "35": "2000", "36": "30", "37": "30", "38": "DATE", "39": "30", "40": "DATE", "41": "DATE", "42": "DATE", "43": "40"}, "Key": {"0": "P", "1": "P", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN, "37": NaN, "38": NaN, "39": NaN, "40": NaN, "41": NaN, "42": NaN, "43": NaN}, "Ref Table(s)": {"0": NaN, "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": "CS_COORD_ACQUISITION", "8": NaN, "9": NaN, "10": NaN, "11": "CS_COORDINATE_SYSTEM", "12": NaN, "13": NaN, "14": "R_ITEM_CATEGORY\rR_ITEM_SUB_CATEGORY", "15": "R_ITEM_SUB_CATEGORY", "16": "CS_COORDINATE_SYSTEM", "17": "CS_COORDINATE_SYSTEM", "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": "R_SOURCE", "31": "SOURCE_DOCUMENT", "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN, "37": NaN, "38": NaN, "39": NaN, "40": NaN, "41": NaN, "42": NaN, "43": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "INFORMATION ITEM SUBTYPE: the type of information item. May be one of The\rvalid types of Information item as defined by check constraints.", "1": "INFORMATION ITEM ID: The unique identifier for an information item.", "2": "ABSTRACT: A short textual description about the information contained in this\rinformation item, often as provided in accompanying meta data.", "3": "ACCEPTED DATE: The date of acceptance of the resource (e.g. thesis by university,\ror article by journal etc.). Equivalent to the Dublin Core element dc:dateAccepted.", "4": "ACCESS CONDITION DESCRIPTION: a textual description of the access conditions\rthat must be met in order to gain access to the information content or a physical\rrepresentation of an object. For example, written permission from the author or\rasupervisor may be required, or a form filled out and approved. This may also\rcapture conditions applied because of legislation or privacy requirements.", "5": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "6": "AVAILABLE DATE: Date that the resource will become or did become available.\rEquivalent to the Dublin Core element dc:available.", "7": "COORD ACQUISITION: identifies an assembly of coordinate data that must be\rgrouped together. It should be acquired together at the same time, from the same\rsource, using the same method and at the same accuracy. May be used to indicate\rthe level of accuracy of a set of coordinates.", "8": "COPYRIGHT DATE: The date that statement of copyright was received on this\rresource. Equivalent to the Dublin Core element dc:dateCopyrighted.", "9": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "10": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "11": "GEOGRAPHIC COORDINATE SYSTEM IDENTIFIER: Unique identifier for the\rgeographic coordinate system that the spatial component of this information item is\rrelated to.", "12": "GROUP INDICATOR: A Y/N flag indicating that this information item is included in at\rleast one information item group. Use this flag to improve query performance and\ravoid outer joins.", "13": "ISSUE DATE: The date that this resource was formally issued, particularly a\rdocument or map, although applicable to other kinds of information item as well.\rEquivalent to the Dublin Core element dc:issued.", "14": "INFORMATION ITEM CATEGORY: the category of information item, such as May be\rAcquisition support products, trace products etc.", "15": "ITEM SUB CATEGORY: THE SUB CATEGORY OF INFORMATION OR PHYSICAL\rITEM. MAY BE ACQUISITION SUPPORT DATA ETC.", "16": "LOCAL COORDINATE SYSTEM IDENTIFIER: Unique identifier for the local\rcoordinate system, such as a local grid system (ATS, STS, MTS etc) to which these\rcoordinates have been referenced. Coordinates that are referenced to a local\rcoordinate system are usually surveyed relative to the local system using metes and\rbounds or local survey references; maintaining the position of each point relative to\rits referenced local system is very important to survey accuracy.", "17": "MAP COORDINATE SYSTEM IDENTIFIER: Unique identifier for the mapping\rcoordinate system that the spatial component of this information item is related to.", "18": "MAXIMUM LATITUDE: The maximum latitude of the bounding box enclosing the\rinformation item.", "19": "MAXIMUM LONGITUDE: The max longitude of the bounding box enclosing the\rinformation item", "20": "MINIMUM LATITUDE: The minimum latitude of the bounding box enclosing the\rinformation item.", "21": "MINIMUM LONGITUDE: The minimum longitude of the bounding box enclosing g the\rinformation item.", "22": "MODIFIED DATE: the last date on which the resource was modified. Equivalent to\rthe Dublin Core element dc:modified.", "23": "ORIGIN DATE on which the item was originated (created)", "24": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "25": "PUBLISHED DATE: the date that this information item was published. Can be stored\rto date or time level, as needed.", "26": "PURPOSE: a narrative description of the purpose for the information item, usually as\rprovided in accompanying meta data.", "27": "REFERENCE NUMBER: a reference number by which this item may be known by,\rsuch as a file number assigned by a department or agency.", "28": "REMARK: Narrative remarks about this row of data.", "29": "SECURITY DESCRIPTION: A narrative description of the additional information\rabout restrictions on handing data. May relate to national security or legal restriction\rrequirements. For more detailed and specific information about who can access the\rdata or information, use the Entitlements module.", "30": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "31": "SOURCE DOCUMENT: Where relevant, the source document that provided the\rorigin for this object. For example, could be the source document for a thesaurus of\rterms.", "32": "SUBMITTED DATE: The date that a resource was submitted (such as a thesis or\rarticle). Equivalent to the Dublin Core element dc:dateSubmitted.", "33": "TIME PERIOD DESCRIPTION: A narrative description of the time period for this\rinformation item.", "34": "TITLE: The title of the item", "35": "USE CONDITIONS: Restrictions and legal prerequisites for using the data set after\raccess has been granted. These include any use constraints applied to ensure the\rprotection of privacy or intellectual property and any special restrictions or limitations\ron using the dataset.", "36": "VERSION NUMBER: The version number of the information item, in the event that\rmultiple versions of the same information item may be captured. use the table RM\rINFO ITEM ORIGIN to track the lineage between versions (to do this, each version\rmust be stored as an information item).", "37": "ROW CHANGED BY: Application login id of the user who last changed the row.", "38": "ROW CHANGED DATE: System date of the last time the row was changed.", "39": "ROW CREATED BY: System user who created this row of data.", "40": "ROW CREATED DATE: Date that the row was created on.", "41": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "42": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "43": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}