{"SAMPLE_LITH_DESC": {"Column Name": {"0": "SAMPLE_ID", "1": "DESCRIPTION_ID", "2": "ACTIVE_IND", "3": "COLOR_INTENSITY", "4": "COLOR_TYPE", "5": "CONTAMINANT", "6": "DEPOSITIONAL_ENVIRONMENT", "7": "DIAGENESIS_TYPE", "8": "ECOZONE_ID", "9": "EFFECTIVE_DATE", "10": "EXPIRY_DATE", "11": "LITHOLOGY", "12": "OIL_STAIN", "13": "PERCENT", "14": "PERMEABILITY_TYPE", "15": "POROSITY_TYPE", "16": "PPDM_GUID", "17": "REMARK", "18": "ROCK_MATRIX", "19": "ROCK_TYPE", "20": "SOURCE", "21": "STRAT_NAME_SET_ID", "22": "STRAT_UNIT_ID", "23": "ROW_CHANGED_BY", "24": "ROW_CHANGED_DATE", "25": "ROW_CREATED_BY", "26": "ROW_CREATED_DATE", "27": "ROW_EFFECTIVE_DATE", "28": "ROW_EXPIRY_DATE", "29": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "VARCHAR2", "7": "VARCHAR2", "8": "VARCHAR2", "9": "DATE", "10": "DATE", "11": "VARCHAR2", "12": "VARCHAR2", "13": "NUMBER", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "VARCHAR2", "19": "VARCHAR2", "20": "VARCHAR2", "21": "VARCHAR2", "22": "VARCHAR2", "23": "VARCHAR2", "24": "DATE", "25": "VARCHAR2", "26": "DATE", "27": "DATE", "28": "DATE", "29": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "1", "3": "40", "4": "40", "5": "40", "6": "40", "7": "40", "8": "40", "9": "DATE", "10": "DATE", "11": "40", "12": "40", "13": "15,12", "14": "40", "15": "40", "16": "38", "17": "2000", "18": "40", "19": "40", "20": "40", "21": "40", "22": "40", "23": "30", "24": "DATE", "25": "30", "26": "DATE", "27": "DATE", "28": "DATE", "29": "40"}, "Key": {"0": "P", "1": "P", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN}, "Ref Table(s)": {"0": "SAMPLE", "1": NaN, "2": NaN, "3": "R_LITH_INTENSITY", "4": "R_LITH_COLOR", "5": "R_SAMPLE_CONTAMINANT", "6": "R_LITH_DEP_ENV", "7": "R_LITH_DIAGENESIS", "8": "ECOZONE", "9": NaN, "10": NaN, "11": "R_LITHOLOGY", "12": "R_LITH_OIL_STAIN", "13": NaN, "14": "R_PERMEABILITY_TYPE", "15": "R_POROSITY_TYPE", "16": NaN, "17": NaN, "18": "R_LITH_ROCK_MATRIX", "19": "R_LITH_ROCK_TYPE", "20": "R_SOURCE", "21": "STRAT_UNIT", "22": "STRAT_UNIT", "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SAMPLE IDENTIFIER: Unique identifier for a sample used in technical analysis.", "1": "DESCRIPTION IDENTIFIER: Unique identifier for the description of this lithologic\rsample", "2": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "3": "LITHOLOGIC INTENSITY: Rock color intensity. The color intensity is used to\rdescribe the amount of color associated with the sample. For example, the color\rintensity may range from high to low.", "4": "LITHOLOGIC COLOR: Basic color or color adjective of lithologic components such\ras red, grey, blue etc. Used in Lithology", "5": "LITHOLOGIC CONTAMINANT: A contaminant in a lithologic sample that may affect\rlater analysis. Drilling mud may be considered to be a contaminant.", "6": "LITHOLOGIC DEPOSITIONAL ENVIRONMENT: Type of interpreted environment of\rthe deposition. A depositional environment is the physical environment in which\rsediments were deposited. For example, a high-energy river channel or a carbonate\rbarrier reef.", "7": "LITHOLOGIC DIAGENESIS TYPE: Type of diagenesis or diagenetic mineral which is\rfound in the described interval. Common types of diagenesis are compaction,\rcementation, recrystallization or dolomitization. Diagenetic minerals may include\rdolomite, glauconite, olivine, etc.", "8": "ECOZONE IDENTIFIER: Unique identifier for a sedimentary rock unit or environment\rin which fossil deposition occurs. Often, these ecozones are marine or fresh water.\rMarine ecozones include the category of marine benthic zones, namely shelf, slope,\rand abyssal zones. The ecozone is defined by the organisms that are found in it.", "9": "EFFECTIVE DATE: date on which the data in this row came into effect.", "10": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "11": "LITHOLOGY: This reference table describes the major lithologic types. For example\rsandstone, limestone, dolomite or shale.", "12": "OIL STAIN: the type of oil stain observed in the rock sample. For example, the oil\rstain can be described as fair live oil, questionable, etc", "13": "PERCENT: The percentage of hydrocarbons measured in the rock sample.", "14": "PERMEABILITY QUALIFICATION: Permeability class based on qualitative visual\restimate", "15": "POROSITY TYPE: This reference table describes the type of porosity observed. For\rexample intergranular, sucrosic or cavernous.", "16": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "17": "REMARK: Narrative remarks about this row of data.", "18": "LITHOLOGIC ROCK MATRIX: Type of fine grain material filling voids between larger\rgrains. The grained particles in a poorly sorted sedimentary rock. Matrix can be fine\rgrained sandstone, siltstone, shale, etc.", "19": "LITHOLOGIC ROCK TYPE: Type of rock comprising a significant portion of the\rinterval. For example, the predominant rock type in the interval may be coal, or oolitic\rlimestone or calcareous sandstone.", "20": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "21": "STRATIGRAPHIC NAME SET IDENTIFIER: Unique identifier for the stratigraphic\rname set.", "22": "STRATIGRAPHIC UNIT IDENTIFIER: unique identifier for the stratigraphic unit.", "23": "ROW CHANGED BY: Application login id of the user who last changed the row.", "24": "ROW CHANGED DATE: System date of the last time the row was changed.", "25": "ROW CREATED BY: System user who created this row of data.", "26": "ROW CREATED DATE: Date that the row was created on.", "27": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "28": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "29": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}