{"SEIS_SET": {"Column Name": {"0": "SEIS_SET_SUBTYPE", "1": "SEIS_SET_ID", "2": "ACQTN_DESIGN_ID", "3": "ACTIVE_IND", "4": "AREA_ID", "5": "AREA_SIZE", "6": "AREA_SIZE_OUOM", "7": "AREA_TYPE", "8": "COORD_ACQUISITION_ID", "9": "CURRENT_SEIS_STATUS", "10": "EFFECTIVE_DATE", "11": "END_DATE", "12": "EXPIRY_DATE", "13": "FINANCE_ID", "14": "GEOGRAPHIC_COORD_SYSTE", "15": "LOCAL_COORD_SYSTEM_ID", "16": "MAX_LATITUDE", "17": "MAX_LONGITUDE", "18": "MIN_LATITUDE", "19": "MIN_LONGITUDE", "20": "PPDM_GUID", "21": "PREFERRED_NAME", "22": "REMARK", "23": "SOURCE", "24": "START_DATE", "25": "XY_COORD_SYSTEM_ID", "26": "ROW_CHANGED_BY", "27": "ROW_CHANGED_DATE", "28": "ROW_CREATED_BY", "29": "ROW_CREATED_DATE", "30": "ROW_EFFECTIVE_DATE", "31": "ROW_EXPIRY_DATE", "32": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "_IDY", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "NUMBER", "6": "VARCHAR2", "7": "VARCHAR2", "8": "VARCHAR2", "9": "VARCHAR2", "10": "DATE", "11": "DATE", "12": "DATE", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "NUMBER", "17": "NUMBER", "18": "NUMBER", "19": "NUMBER", "20": "VARCHAR2", "21": "VARCHAR2", "22": "VARCHAR2", "23": "VARCHAR2", "24": "DATE", "25": "VARCHAR2", "26": "VARCHAR2", "27": "DATE", "28": "VARCHAR2", "29": "DATE", "30": "DATE", "31": "DATE", "32": "VARCHAR2"}, "Length": {"0": "30", "1": "40", "2": "40", "3": "1", "4": "40", "5": "20,10", "6": "40", "7": "40", "8": "40", "9": "40", "10": "DATE", "11": "DATE", "12": "DATE", "13": "40", "14": "40", "15": "40", "16": "14,9", "17": "14,9", "18": "14,9", "19": "14,9", "20": "38", "21": "255", "22": "2000", "23": "40", "24": "DATE", "25": "40", "26": "30", "27": "DATE", "28": "30", "29": "DATE", "30": "DATE", "31": "DATE", "32": "40"}, "Key": {"0": "P", "1": "P", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN}, "Ref Table(s)": {"0": "SEIS_SET_AREA", "1": "SEIS_SET_AREA", "2": "SEIS_ACQTN_DESIGN", "3": NaN, "4": "SEIS_SET_AREA", "5": NaN, "6": "PPDM_UNIT_OF_MEASURE", "7": "SEIS_SET_AREA", "8": "CS_COORD_ACQUISITION", "9": "R_SEIS_STATUS", "10": NaN, "11": NaN, "12": NaN, "13": "FINANCE", "14": "CS_COORDINATE_SYSTEM", "15": "CS_COORDINATE_SYSTEM", "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": "R_SOURCE", "24": NaN, "25": "CS_COORDINATE_SYSTEM", "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SEISMIC SET SUBTYPE: The seismic set type column is used to enforce a\rrelationship between the SEIS SET supertype and its valid sub types. Values for this\rcolumn must be the name of the table that is the valid sub type for this row of data.\rValid entries include SEIS_LINE, SEIS_SEGMENT, SEIS_SURVEY, SEIS_PLAN,\rSEIS_WELL, SEIS_PROC_SET, SEIS_INTERP_SET or SEIS_3D.", "1": "SEISMIC SET: A seismic set is a super type of various types of seismic collections.\rValid types of seismic sets include SEIS_LINE, SEIS_3D, SEIS_SEGMENT and\rSEIS_SURVEY.", "2": "NOMINAL ACQUISITION DESIGN ID: the unique id for the acquisition design that\rwas nominally intended to be associated with the seismic set. If desired, actual\rdesigns can be captured at the record level.", "3": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "4": "AREA ID: Unique identifier for any named area such as a country, province, project\rarea, area of interest, offshore area, district etc.", "5": "PARCEL SIZE: The areal size of a parcel, usually for a set that is three dimensional.\rlinear lengths should be stored in LINE LENGTH.", "6": "ORIGINAL UNIT OF MEASURE", "7": "AREA TYPE: Unique identifier for the type of area, such as country, state, AOI etc.", "8": "COORDINATE ACQUISITION ID: Identifies the coordinate acquisition, including the\rmethod used, level of accuracy and quality of the data.", "9": "CURRENT SEISMIC STATUS: current, most important status for the seismic set.\rOften, this will be the current ownership status of the seismic set. Denormalized from\rSEIS SET STATUS", "10": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "11": "END DATE: The date that recording on this seismic set ended.", "12": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "13": "FINANCE SUIMMARY IDENTIFIER: Summary information about a financial\rreference, such as an AFE for an activity, such as seismic acquisition or processing.\rCould be a cost center or any other reference number.", "14": "GEOGRAPHIC COORDINATE SYSTEM: a supertype representing all the types of\rcoordinate systems allowed in PPDM. This represents the coordinate system used\rfor latitude and longitude in SEIS POINT.", "15": "LOCAL COORDINATE SYSTEM IDENTIFIER: Unique identifier for the local\rcoordinate system, such as a local grid system (ATS, STS, MTS etc) to which these\rcoordinates have been referenced. Coordinates that are referenced to a local\rcoordinate system are usually surveyed relative to the local system using metes and\rbounds or local survey references; maintaining the position of each point relative to\rits referenced local system is very important to survey accuracy.", "16": "MAXIMUM LATITUDE: The NW latitude of the seis set bounding box", "17": "MAXIMUM LONGITUDE: The NW longitude of the seis set bounding box", "18": "MINIMUM LATTUDE: The SE latitude of the seis set bounding box", "19": "MINIMUM LONGITUDE: The SE longitude of the seis set bounding box", "20": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "21": "PREFERRED NAME: the name by which this seismic set should be referred to.\rShould be denormalized by script from SEIS ALIAS.", "22": "REMARK: Narrative remarks about this row of data.", "23": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "24": "START DATE: the date that recording on this seismic set began.", "25": "XY COORDINATE SYSTEM: a supertype representing all the types of coordinate\rsystems allowed in PPDM. This represents the coordinate system used for X and Y\rcoordinates (such as UTM) in SEIS POINT.", "26": "ROW CHANGED BY: Application login id of the user who last changed the row.", "27": "ROW CHANGED DATE: System date of the last time the row was changed.", "28": "ROW CREATED BY: System user who created this row of data.", "29": "ROW CREATED DATE: Date that the row was created on.", "30": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "31": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "32": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}