{"SF_BA_CREW": {"Column Name": {"0": "SF_SUBTYPE", "1": "SUPPORT_FACILITY_ID", "2": "CREW_COMPANY_BA_ID", "3": "CREW_ID", "4": "SF_BA_CREW_OBS_NO", "5": "ACTIVE_IND", "6": "EFFECTIVE_DATE", "7": "EXPIRY_DATE", "8": "PPDM_GUID", "9": "REMARK", "10": "SOURCE", "11": "ROW_CHANGED_BY", "12": "ROW_CHANGED_DATE", "13": "ROW_CREATED_BY", "14": "ROW_CREATED_DATE", "15": "ROW_EFFECTIVE_DATE", "16": "ROW_EXPIRY_DATE", "17": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "N", "4": "N", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "NUMBER", "5": "VARCHAR2", "6": "DATE", "7": "DATE", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "DATE", "13": "VARCHAR2", "14": "DATE", "15": "DATE", "16": "DATE", "17": "VARCHAR2"}, "Length": {"0": "30", "1": "40", "2": "40", "3": "40", "4": "8", "5": "1", "6": "DATE", "7": "DATE", "8": "38", "9": "2000", "10": "40", "11": "30", "12": "DATE", "13": "30", "14": "DATE", "15": "DATE", "16": "DATE", "17": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": "P", "4": "P", "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN}, "Ref Table(s)": {"0": "SF_SUPPORT_FACILITY", "1": "SF_SUPPORT_FACILITY", "2": "BA_CREW", "3": "BA_CREW", "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": "R_SOURCE", "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SUPPORT FACILITY SUBTYPE: The type of support facility that is described by this\rrow of data. These values are managed by check constraint, and may only be the\rname of a valid sub type of support facility.", "1": "SUPPORT FACILITY IDENTIFIER: Unique identifier for the support facility. A support\rfacility provides operational support for activities. These facilities may include roads,\rtransmission towers, airstrips, vessels, docks and so on. Sub tyes are used to\rmaintain integration with the rest of the model.", "2": "CREW COMPANY BUSINESS ASSOCIATE IDENTIFIER: Unique identifier for the\rcompany that runs this crew. Not all members of a crew may be employees, but may\rbe contractors or seconded to the crew by another company.", "3": "CREW IDENTIFIER: Unique identifier for the crew.", "4": "SUPPORT FACILITY CREW OBSERVATION NUMBER: Unique identifier that allows\ra crew to be affilliated with a facility more than once over time.", "5": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "6": "EFFECTIVE DATE: the date on which this row of data first came into effect from a\rbusiness perspective.", "7": "EXPIRY DATE: the date on which this row of data is no longer in effect from a\rbusiness perspective.", "8": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "9": "REMARK: Narrative remarks relating to this row of data.", "10": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "11": "ROW CHANGED BY: Application login id of the user who last changed the row.", "12": "ROW CHANGED DATE: System date of the last time the row was changed.", "13": "ROW CREATED BY: System user who created this row of data.", "14": "ROW CREATED DATE: Date that the row was created on.", "15": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "16": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "17": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}