{"SF_RIG": {"Column Name": {"0": "SF_SUBTYPE", "1": "RIG_ID", "2": "ACTIVE_IND", "3": "BOILER_MANUFACTURER", "4": "BOILER_POWER", "5": "BOILER_POWER_OUOM", "6": "CHOKE_MANIFOLD_PRESS", "7": "CHOKE_MANIFOLD_PRESS_OU", "8": "CHOKE_MANIFOLD_SIZE", "9": "CHOKE_MANIFOLD_SIZE_OUO", "10": "CLEAR_WORK_HEIGHT", "11": "CLEAR_WORK_HEIGHT_OUOM", "12": "COMMISSION_DATE", "13": "DECOMMISSION_DATE", "14": "DESANDER_TYPE", "15": "DESILTER_TYPE", "16": "DRAWWORKS_TYPE", "17": "EFFECTIVE_DATE", "18": "EXPIRY_DATE", "19": "HOOKBLOCK_RATING", "20": "HOOKBLOCK_RATING_OUOM", "21": "HOOKBLOCK_TYPE", "22": "HOOK_LOAD_CAPACITY", "23": "HOOK_LOAD_CAPACITY_OUOM", "24": "KB_GROUND_DIST", "25": "KB_GROUND_DIST_OUOM", "26": "MAST_HEIGHT", "27": "MAST_HEIGHT_OUOM", "28": "MAST_TYPE", "29": "MAX_DEPTH", "30": "MAX_DEPTH_OUOM", "31": "MUD_TANK_COUNT", "32": "MUD_TANK_SIZE", "33": "MUD_TANK_SIZE_OUOM", "34": "OPERATOR_BA_ID", "35": "OWNER_BA_ID", "36": "PPDM_GUID", "37": "REMARK", "38": "RIG_CATEGORY", "39": "RIG_CLASS", "40": "RIG_CODE", "41": "RIG_NAME", "42": "RIG_TYPE", "43": "ROTARY_TABLE_CAP", "44": "ROTARY_TABLE_CAP_OUOM", "45": "ROTARY_TABLE_SIZE", "46": "ROTARY_TABLE_SIZE_OUOM", "47": "SOURCE", "48": "SUBSTRUCTURE_TYPE", "49": "SUBSTRUCT_CASING_CAP", "50": "SUBSTRUCT_CASING_CAP_OU", "51": "SUBSTRUCT_SETBACK_CAP", "52": "SUBSTRUCT_SETBACK_CAP_O", "53": "SWIVEL_RATING", "54": "SWIVEL_RATING_OUOM", "55": "SWIVEL_TYPE", "56": "TOP_DRIVE_MODEL", "57": "TOP_DRIVE_RATING", "58": "TOP_DRIVE_RATING_OUOM", "59": "WATER_DEPTH_CAPACITY", "60": "WATER_DEPTH_DATUM", "61": "WATER_DEPTH_OUOM", "62": "WORKING_PRESSURE", "63": "WORKING_PRESSURE_OUOM", "64": "ROW_CHANGED_BY", "65": "ROW_CHANGED_DATE", "66": "ROW_CREATED_BY", "67": "ROW_CREATED_DATE", "68": "ROW_EFFECTIVE_DATE", "69": "ROW_EXPIRY_DATE", "70": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "MY", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y", "33": "Y", "34": "Y", "35": "Y", "36": "Y", "37": "Y", "38": "Y", "39": "Y", "40": "Y", "41": "Y", "42": "Y", "43": "Y", "44": "Y", "45": "Y", "46": "Y", "47": "Y", "48": "Y", "49": "Y", "50": "MY", "51": "Y", "52": "OYM", "53": "Y", "54": "Y", "55": "Y", "56": "Y", "57": "Y", "58": "Y", "59": "Y", "60": "Y", "61": "Y", "62": "Y", "63": "Y", "64": "Y", "65": "Y", "66": "Y", "67": "Y", "68": "Y", "69": "Y", "70": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "NUMBER", "5": "VARCHAR2", "6": "NUMBER", "7": "VARCHAR2", "8": "NUMBER", "9": "VARCHAR2", "10": "NUMBER", "11": "VARCHAR2", "12": "DATE", "13": "DATE", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "DATE", "18": "DATE", "19": "NUMBER", "20": "VARCHAR2", "21": "VARCHAR2", "22": "NUMBER", "23": "VARCHAR2", "24": "NUMBER", "25": "VARCHAR2", "26": "NUMBER", "27": "VARCHAR2", "28": "VARCHAR2", "29": "NUMBER", "30": "VARCHAR2", "31": "NUMBER", "32": "NUMBER", "33": "VARCHAR2", "34": "VARCHAR2", "35": "VARCHAR2", "36": "VARCHAR2", "37": "VARCHAR2", "38": "VARCHAR2", "39": "VARCHAR2", "40": "VARCHAR2", "41": "VARCHAR2", "42": "VARCHAR2", "43": "NUMBER", "44": "VARCHAR2", "45": "NUMBER", "46": "VARCHAR2", "47": "VARCHAR2", "48": "VARCHAR2", "49": "NUMBER", "50": "VARCHAR2", "51": "NUMBER", "52": "VARCHAR2", "53": "NUMBER", "54": "VARCHAR2", "55": "VARCHAR2", "56": "VARCHAR2", "57": "NUMBER", "58": "VARCHAR2", "59": "NUMBER", "60": "VARCHAR2", "61": "VARCHAR2", "62": "NUMBER", "63": "VARCHAR2", "64": "VARCHAR2", "65": "DATE", "66": "VARCHAR2", "67": "DATE", "68": "DATE", "69": "DATE", "70": "VARCHAR2"}, "Length": {"0": "30", "1": "40", "2": "1", "3": "240", "4": "10,5", "5": "40", "6": "8,2", "7": "40", "8": "10,5", "9": "40", "10": "10,5", "11": "40", "12": "DATE", "13": "DATE", "14": "40", "15": "40", "16": "40", "17": "DATE", "18": "DATE", "19": "15,5", "20": "40", "21": "40", "22": "15,5", "23": "40", "24": "10,3", "25": "40", "26": "15,5", "27": "40", "28": "40", "29": "15,5", "30": "40", "31": "10", "32": "10,5", "33": "40", "34": "40", "35": "40", "36": "38", "37": "2000", "38": "40", "39": "40", "40": "40", "41": "255", "42": "40", "43": "15,5", "44": "40", "45": "15,5", "46": "40", "47": "40", "48": "40", "49": "15,5", "50": "40", "51": "15,5", "52": "40", "53": "15,5", "54": "40", "55": "40", "56": "255", "57": "15,5", "58": "40", "59": "15,5", "60": "40", "61": "40", "62": "10,5", "63": "40", "64": "30", "65": "DATE", "66": "30", "67": "DATE", "68": "DATE", "69": "DATE", "70": "40"}, "Key": {"0": "P", "1": "P", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN, "37": NaN, "38": NaN, "39": NaN, "40": NaN, "41": NaN, "42": NaN, "43": NaN, "44": NaN, "45": NaN, "46": NaN, "47": NaN, "48": NaN, "49": NaN, "50": NaN, "51": NaN, "52": NaN, "53": NaN, "54": NaN, "55": NaN, "56": NaN, "57": NaN, "58": NaN, "59": NaN, "60": NaN, "61": NaN, "62": NaN, "63": NaN, "64": NaN, "65": NaN, "66": NaN, "67": NaN, "68": NaN, "69": NaN, "70": NaN}, "Ref Table(s)": {"0": "SF_SUPPORT_FACILITY", "1": "SF_SUPPORT_FACILITY", "2": NaN, "3": NaN, "4": NaN, "5": "PPDM_UNIT_OF_MEASURE", "6": NaN, "7": "PPDM_UNIT_OF_MEASURE", "8": NaN, "9": "PPDM_UNIT_OF_MEASURE", "10": NaN, "11": "PPDM_UNIT_OF_MEASURE", "12": NaN, "13": NaN, "14": "R_RIG_DESANDER_TYPE", "15": "R_RIG_DESILTER_TYPE", "16": "R_RIG_DRAWWORKS", "17": NaN, "18": NaN, "19": NaN, "20": "PPDM_UNIT_OF_MEASURE", "21": "R_RIG_HOOKBLOCK_TYPE", "22": NaN, "23": "PPDM_UNIT_OF_MEASURE", "24": NaN, "25": "PPDM_UNIT_OF_MEASURE", "26": NaN, "27": "PPDM_UNIT_OF_MEASURE", "28": "R_RIG_MAST", "29": NaN, "30": "PPDM_UNIT_OF_MEASURE", "31": NaN, "32": NaN, "33": "PPDM_UNIT_OF_MEASURE", "34": "BUSINESS_ASSOCIATE", "35": "BUSINESS_ASSOCIATE", "36": NaN, "37": NaN, "38": "R_RIG_CATEGORY", "39": "R_RIG_CLASS", "40": "R_RIG_CODE", "41": NaN, "42": "R_RIG_TYPE", "43": NaN, "44": "PPDM_UNIT_OF_MEASURE", "45": NaN, "46": "PPDM_UNIT_OF_MEASURE", "47": "R_SOURCE", "48": "R_RIG_SUBSTRUCTURE", "49": NaN, "50": "PPDM_UNIT_OF_MEASURE", "51": NaN, "52": "PPDM_UNIT_OF_MEASURE", "53": NaN, "54": "PPDM_UNIT_OF_MEASURE", "55": "R_RIG_SWIVEL_TYPE", "56": NaN, "57": NaN, "58": "PPDM_UNIT_OF_MEASURE", "59": NaN, "60": NaN, "61": "PPDM_UNIT_OF_MEASURE", "62": NaN, "63": "PPDM_UNIT_OF_MEASURE", "64": NaN, "65": NaN, "66": NaN, "67": NaN, "68": NaN, "69": NaN, "70": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SUPPORT FACILITY SUBTYPE: The type of support facility that is described by this\rrow of data. These values are managed by check constraint, and may only be the\rname of a valid sub type of support facility.", "1": "RIG IDENTIFIER: Unique identifier assigned to the rig. Rigs may be drilling rigs or\rother kinds of service rigs assigned to a well site.", "2": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "3": "BOILER MANUFACTURER: Unvalidated column for the manufacturer information for\rthe boiler. For validated manufacturer information, go to the EQUIPMENT tables.", "4": "BOILDER POWER: Power rating for the boiler.", "5": "ORIGINAL UNIT OF MEASURE", "6": "CHOKE MANIFOLD PRESSURE: A set of high-pressure valves and associated\rpiping that usually includes at least two adjustable chokes, arranged such that one\radjustable choke may be isolated and taken out of service for repair and\rrefurbishment while well flow is directed through the other one. (Schlumberger\rOilfield Glossary).", "7": "ORIGINAL UNIT OF MEASURE", "8": "CHOKE MANIFOLD SIZE: A set of high-pressure valves and associated piping that\rusually includes at least two adjustable chokes, arranged such that one adjustable\rchoke may be isolated and taken out of service for repair and refurbishment while\rwell flow is directed through the other one. (Schlumerger Oilfield Glossary)", "9": "ORIGINAL UNIT OF MEASURE", "10": "CLEAR WORKING HEIGHT: the amount of clear working height space on the rig.", "11": "ORIGINAL UNIT OF MEASURE", "12": "COMMISSION DATE: The date that the rig was put into commission.", "13": "DECOMMISSION DATE: The date that the rig was decommissioned.", "14": "DESANDER TYPE:A hydrocyclone device that removes large drill solids from the\rwhole mud system. The desander should be located downstream of the shale\rshakers and degassers, but before the desilters or mud cleaners. A volume of mud is\rpumped into the wide upper section of the hydrocylone at an angle roughly tangent to\rits circumference. As the mud flows around and gradually down the inside of the\rcone shape, solids are separated from the liquid by centrifugal forces. The solids\rcontinue around and down until they exit the bottom of the hydrocyclone (along with\rsmall amounts of liquid) and are discarded. The cleaner and lighter density liquid\rmud travels up through a vortex in the center of the hydrocyclone, exits through\rpiping at the top of the hydrocyclone and is then routed to the mud tanks and the next\rmud-cleaning device, usually a desilter. Various size desander and desilter cones are\rfunctionally identical, with the size of the cone determining the size of particles the\rdevice removes from the mud system. (Schlumberger Oilfield Glossary).", "15": "DESILTER TYPE: A hydrocyclone much like a desander except that its design\rincorporates a greater number of smaller cones. As with the desander, its purpose is\rto remove unwanted solids from the mud system. The smaller cones allow the\rdesilter to efficiently remove smaller diameter drill solids than a desander does. For\rthat reason, the desilter is located downstream from the desander in the surface mud\rsystem. (Schlumberger Oilfield Glossary).", "16": "DRAWWORKS TYPE: The machine on the rig consisting of a large-diameter steel\rspool, brakes, a power source and assorted auxiliary devices. The primary function of\rthe drawworks is to reel out and reel in the drilling line, a large diameter wire rope, in\racontrolled fashion. The drilling line is reeled over the crown block and traveling block\rto gain mechanical advantage in a \"block and tackle\" or \"pulley\" fashion. This reeling\rout and in of the drilling line causes the traveling block, and whatever may be\rhanging underneath it, to be lowered into or raised out of the wellbore. The reeling\rout of the drilling line is powered by gravity and reeling in by an electric motor or\rdiesel engine.(Schlumberger Oilfield Glossary). A link to the specific piece of\requipment that has been used may be captured in the table SF EQUIPMENT.", "17": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "18": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "19": "HOOKBLOCK RATING: The rating for the hookblock, as the amount of force it is\rrated for.", "20": "ORIGINAL UNIT OF MEASURE", "21": "HOOK or HOOKBLOCK TYPE: The high-capacity J-shaped equipment used to hang\rvarious other equipment, particularly the swivel and kelly, the elevator bails or\rtopdrive units. The hook is attached to the bottom of the traveling block and provides\ra way to pick up heavy loads with the traveling block. The hook is either locked (the\rnormal condition) or free to rotate, so that it may be mated or decoupled with items\rpositioned around the rig floor, not limited to a single direction. (Schlumberger Oilfield\rGlossary)", "22": "HOOK LOAD CAPACITY: The maximum hook load rated for this rig. Hook load is the\rtotal force pulling down on the hook. This total force includes the weight of the\rdrillstring in air, the drill collars and any ancillary equipment, reduced by any force\rthat tends to reduce that weight. Some forces that might reduce the weight include\rfriction along the wellbore wall (especially in deviated wells) and, importantly, buoyant\rforces on the drillstring caused by its immersion in drilling fluid. If the BOPs are\rclosed, any pressure in the wellbore acting on the cross-sectional area of the\rdrillstring in the BOPs will also exert an upward force. (Schlumberger Oilfield\rGlossary)", "23": "ORIGINAL UNIT OF MEASURE", "24": "KELLY BUSHING TO GROUND DISTANCE: the distance from the kelly bushing to\rthe ground on the rig.", "25": "ORIGINAL UNIT OF MEASURE", "26": "MAST HEIGHT: The height of the mast.", "27": "ORIGINAL UNIT OF MEASURE", "28": "MAST TYPE: The structure used to support the crown blocks and the drillstring.\rMasts are usually rectangular or trapezoidal in shape and offer a very good stiffness,\rimportant to land rigs whose mast is laid down when the rig is moved. They suffer\rfrom being heavier than conventional derricks and consequently are not usually\rfound in offshore environments, where weight is more of a concern than in land\roperations. (Schlumberger Oilfield Glossary). In order to capture a relationship to a\rspecific piece of equipment or the manufacturer of the equipment,please use SF\rEQUIPMENT.", "29": "MAXIMUM DEPTH: The maximum depth that the rig is able to drill to.", "30": "ORIGINAL UNIT OF MEASURE", "31": "MUD TANK COUNT: The number of mud tanks for the rig.", "32": "MUD TANK SIZE: The size of the mud tanks on the rig.", "33": "ORIGINAL UNIT OF MEASURE", "34": "OPERATOR BUSINESS ASSOCIATE IDENTIFIER: Unique identifier for the\rbusiness associate who operates the rig.", "35": "OWNER BUSINESS ASSOCIATE IDENTIFIER: Unique identifier for the business\rassociate who owns the rig. Note that partner shares can be handled through the\rINTEREST SET module, via the foreign key in SF COMPONENT.", "36": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "37": "REMARK: Narrative remarks about this row of data.", "38": "RIG CATEGORY: The category of the rig, describing its basic purpose. Typical\rexamples include drilling rig, service rig, wireline rig, workover rig, rathole rig etc.", "39": "RIG CLASS: Indicates the class of rig, such as single, super single, double, triple.", "40": "RIG CODE: This reference table defines the unique codes assigned to each rig or\rinstallation. For example, the code \"GA\" may be assigned to the drilling rig Glomar\rArctic III.", "41": "RIG NAME: Full name of the rig. Usually denormalized from the table SF ALIAS,\rbased on the PREFERRED IND flag.", "42": "RIG TYPE: A reference table describing the type of rig installation. For example land,\rbarge, submersible, platform, jackup, drillship, semisub or artificial island.", "43": "ROTARY TABLE CAPACITY: the carrying capacity of the rotary table, often in tons.", "44": "ORIGINAL UNIT OF MEASURE", "45": "ROTARY TABLE SIZE: The revolving or spinning section of the drillfloor that\rprovides power to turn the drillstring in a clockwise direction (as viewed from above).\rThe rotary motion and power are transmitted through the kelly bushing and the kelly\rto the drillstring. When the drillstring is rotating, the drilling crew commonly describes\rthe operation as simply, \"rotating to the right,\" \"turning to the right,\" or, \"rotating on\rbottom.\" Almost all rigs today have a rotary table, either as primary or backup system\rfor rotating the drillstring. Topdrive technology, which allows continuous rotation of\rthe drillstring, has replaced the rotary table in certain operations. A few rigs are being\rbuilt today with topdrive systems only, and lack the traditional kelly system.\r(Schlumberger Oilfield Glossary)", "46": "ORIGINAL UNIT OF MEASURE", "47": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "48": "SUBSTRUCTURE: Foundation on which the derrick and engines sit. Contains space\rfor storage and well control equipment. (http://www.oilonline.com/info/glossary.asp).\rFor details about specific equipment used or manufacturers, please use the SF\rEQUIPMENTtable.", "49": "SUBSTRUCTURE CASING CAPACITY: The maximum capacity of the substructure\rto hold casings removed from the well bore, including those that are hung from the\roverhead equjpment.", "50": "ORIGINAL UNIT OF MEASURE", "51": "SUSTRUCTURE SET BACK CAPACITY: The amount of force the substructure can\rhandle as wieght on the derrick and rack in addition to the normal rig equipment.", "52": "ORIGINAL UNIT OF MEASURE", "53": "SWIVEL RATING: The rating for the swivel, usually the weight it is able to hold. The\rswivel is a rotary device hanging from the hook and the travellling block. Its function\ris to allow the drill stem to rotate freely from the apparatus.", "54": "SWIVEL RATING ORIGINAL UNITS OF MEASURE: The units of measure in which\rthe swivel rating was originally received.", "55": "SWIVEL TYPE: A mechanical device that must simultaneously suspend the weight of\rthe drillstring, provide for rotation of the drillstring beneath it while keeping the upper\rportion stationary, and permit high-volume flow of high-pressure drilling mud from the\rfixed portion to the rotating portion without leaking. (Schlumberger Oilfield Glossary)", "56": "TOP DRIVE MODEL: unvalidated information about the make and model of the top\rdrive. In order to validate this information, please use SF EQUIPMENT.", "57": "TOP DRIVE RATING: the rating for the top drive. The top drive is used to rotate the\rdrill stem, and may be used in place of the rotary table. The top drive may include the\rswivel, elevator, tongs and hook.", "58": "TOP DRIVE RATING ORIGINAL UNITS OF MEASURE: The units of measure in\rwhich the top drive rating was originally received.", "59": "WATER DEPTH CAPACITY: Depth of the water that the rig can operate in.", "60": "WATER DEPTH DATUM: Identifies the point near or on the rig from where the water\rdepths are to be measured.", "61": "WATER DEPTH OUOM: Water depth original unit of measure.", "62": "WORKING PRESSURE: The working pressure for the rig.", "63": "ORIGINAL UNIT OF MEASURE", "64": "ROW CHANGED BY: Application login id of the user who last changed the row.", "65": "ROW CHANGED DATE: System date of the last time the row was changed.", "66": "ROW CREATED BY: System user who created this row of data.", "67": "ROW CREATED DATE: Date that the row was created on.", "68": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "69": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "70": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}