{"SF_RIG_BOP": {"Column Name": {"0": "SF_SUBTYPE", "1": "RIG_ID", "2": "BOP_ID", "3": "ACTIVE_IND", "4": "ANNULAR_COUNT", "5": "BOP_COUNT", "6": "BOP_DIAMETER", "7": "BOP_DIAMETER_OUOM", "8": "BOP_NACE_CERTIFIED_IND", "9": "BOP_POSITION_DESC", "10": "BOP_PRESSURE_RATING", "11": "BOP_PRESSURE_RATING_OUO", "12": "BOP_TYPE", "13": "CAPACITY", "14": "CAPACITY_OUOM", "15": "CATALOGUE_EQUIP_ID", "16": "DOUBLE_COUNT", "17": "EFFECTIVE_DATE", "18": "EQUIPMENT_ID", "19": "EXPIRY_DATE", "20": "INPUT_TYPE", "21": "INSTALL_DATE", "22": "PPDM_GUID", "23": "REFERENCE_NUM", "24": "REMARK", "25": "REMOVE_DATE", "26": "SINGLE_COUNT", "27": "SOURCE", "28": "ROW_CHANGED_BY", "29": "ROW_CHANGED_DATE", "30": "ROW_CREATED_BY", "31": "ROW_CREATED_DATE", "32": "ROW_EFFECTIVE_DATE", "33": "ROW_EXPIRY_DATE", "34": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y", "33": "Y", "34": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "NUMBER", "5": "NUMBER", "6": "NUMBER", "7": "VARCHAR2", "8": "VARCHAR2", "9": "VARCHAR2", "10": "NUMBER", "11": "VARCHAR2", "12": "VARCHAR2", "13": "NUMBER", "14": "VARCHAR2", "15": "VARCHAR2", "16": "NUMBER", "17": "DATE", "18": "VARCHAR2", "19": "DATE", "20": "VARCHAR2", "21": "DATE", "22": "VARCHAR2", "23": "VARCHAR2", "24": "VARCHAR2", "25": "DATE", "26": "NUMBER", "27": "VARCHAR2", "28": "VARCHAR2", "29": "DATE", "30": "VARCHAR2", "31": "DATE", "32": "DATE", "33": "DATE", "34": "VARCHAR2"}, "Length": {"0": "30", "1": "40", "2": "40", "3": "1", "4": "10", "5": "10", "6": "10,5", "7": "40", "8": "1", "9": "240", "10": "10,5", "11": "40", "12": "40", "13": "10,5", "14": "40", "15": "40", "16": "10", "17": "DATE", "18": "40", "19": "DATE", "20": "40", "21": "DATE", "22": "38", "23": "20", "24": "2000", "25": "DATE", "26": "10", "27": "40", "28": "30", "29": "DATE", "30": "30", "31": "DATE", "32": "DATE", "33": "DATE", "34": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": NaN}, "Ref Table(s)": {"0": "SF_RIG", "1": "SF_RIG", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": "PPDM_UNIT_OF_MEASURE", "8": NaN, "9": NaN, "10": NaN, "11": "PPDM_UNIT_OF_MEASURE", "12": "R_RIG_BLOWOUT_PREVENTE\rR", "13": NaN, "14": "PPDM_UNIT_OF_MEASURE", "15": "CAT_EQUIPMENT", "16": NaN, "17": NaN, "18": "EQUIPMENT", "19": NaN, "20": "R_INPUT_TYPE", "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": "R_SOURCE", "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SUPPORT FACILITY SUBTYPE: The type of support facility that is described by this\rrow of data. These values are managed by check constraint, and may only be the\rname of a valid sub type of support facility.", "1": "RIG IDENTIFIER: Unique identifier assigned to the rig. Rigs may be drilling rigs or\rother kinds of service rigs assigned to a well site.", "2": "BLOWOUT PREVENTER IDENTIFIER: unique identifier for the component of the\rblowout preventor.", "3": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "4": "ANNULAR COUNT: the number of annular BOP. These are usually rubber\rdiaphrams or bags that are used to seal the system off in the event of a reverse\rpressure.", "5": "BLOW OUT PREVENTOR COUNT: the number of blow out preventorsof this type,\rdescribed in this row of data, on the rig.", "6": "BLOWOUT PREVENTOR DIAMETER: the diameter of the blowout preventor.", "7": "ORIGINAL UNIT OF MEASURE", "8": "BLOWOUT PREVENTER NACE CERTIFICATION INDICATOR; A Y/N indicator that\rthe BOP has been certified by NACE (www.nace.org)", "9": "BOP POSITION DESCRIPTION: Desctiption of the position of the BOP on the rig.", "10": "BLOWOUT PREVENTER PRESSURE RATING: The pressure rating for the BOP.", "11": "ORIGINAL UNIT OF MEASURE", "12": "BLOWOUT PREVENTOR TYPE: A large valve at the top of a well that may be\rclosed if the drilling crew loses control of formation fluids. By closing this valve\r(usually operated remotely via hydraulic actuators), the drilling crew usually regains\rcontrol of the reservoir, and procedures can then be initiated to increase the mud\rdensity until it is possible to open the BOP and retain pressure control of the\rformation. BOPs come in a variety of styles, sizes and pressure ratings. Some can\reffectively close over an open wellbore, some are designed to seal around tubular\rcomponents in the well (drillpipe, casing or tubing) and others are fitted with\rhardened steel shearing surfaces that can actually cut through drillpipe. Since BOPs\rare critically important to the safety of the crew, the rig and the wellbore itself, BOPs\rare inspected, tested and refurbished at regular intervals determined by a\rcombination of risk assessment, local practice, well type and legal requirements.\rBOP tests vary from daily function testing on critical wells to monthly or less frequent\rtesting on wells thought to have low probability of well control problems.\r(Schlumberger Oilfield Glossary). Usual values include single, double, shear, ram,\rdiverter, gate, single gate etc. .", "13": "CAPACITY: the capacity of the equipment.", "14": "ORIGINAL UNIT OF MEASURE", "15": "EQUIPMENT CATALOGUE IDENTIFIER: Unique identifier for the list of kinds of\requipment. Think of this as a catalogue or brochure that shows all the kinds of\requipment that you may use, but may or may not actually have. Actual peices of\requipment that exist are defined in the table EQUIPMENT. Use this table to define\rthe make and model number of a piece of equipment without identifying the specific\rpiece of equipment.", "16": "DOUBLE COUNT: The number of double ram, annulus or shear devices on the BOP.", "17": "EFFECTIVE DATE: date on which the data in this row came into effect.", "18": "EQUIPMENT IDENTIFIER: Unique identifier for a specific peice of equipment.", "19": "EXPIRY DATE: Date on which the data in this row of data was no longer in effect.", "20": "INPUT TYPE: The type of input into an electrical device. Usually measured in Watts.", "21": "INSTALL DATE: the date this piece of equipment was installed on the rig.", "22": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "23": "REFERENCE NUMBER: Reference number for the BOP.", "24": "REMARK: Narrative remarks about this row of data.", "25": "REMOVE DATE: The date that this piece of equipment was removed from the rig.", "26": "SINGLE COUNT: The number of single ram, annular or shear devices on the BOP.", "27": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "28": "ROW CHANGED BY: Application login id of the user who last changed the row.", "29": "ROW CHANGED DATE: System date of the last time the row was changed.", "30": "ROW CREATED BY: System user who created this row of data.", "31": "ROW CREATED DATE: Date that the row was created on.", "32": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "33": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "34": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}