{"SP_MINERAL_ZONE": {"Column Name": {"0": "SPATIAL_DESCRIPTION_ID", "1": "SPATIAL_OBS_NO", "2": "MINERAL_ZONE_ID", "3": "ACTIVE_IND", "4": "BASE_QUALIFIER", "5": "BASE_ZONE_DEFINITION_ID", "6": "DEEP_RIGHT_REVERSION_IND", "7": "EFFECTIVE_DATE", "8": "EXPIRY_DATE", "9": "INACTIVATION_DATE", "10": "METES_AND_BOUNDS", "11": "PPDM_GUID", "12": "REMARK", "13": "SOURCE", "14": "TOP_QUALIFIER", "15": "TOP_ZONE_DEFINITION_ID", "16": "ROW_CHANGED_BY", "17": "ROW_CHANGED_DATE", "18": "ROW_CREATED_BY", "19": "ROW_CREATED_DATE", "20": "ROW_EFFECTIVE_DATE", "21": "ROW_EXPIRY_DATE", "22": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "NUMBER", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "VARCHAR2", "7": "DATE", "8": "DATE", "9": "DATE", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "DATE", "18": "VARCHAR2", "19": "DATE", "20": "DATE", "21": "DATE", "22": "VARCHAR2"}, "Length": {"0": "40", "1": "8", "2": "40", "3": "1", "4": "40", "5": "40", "6": "1", "7": "DATE", "8": "DATE", "9": "DATE", "10": "2000", "11": "38", "12": "2000", "13": "40", "14": "40", "15": "40", "16": "30", "17": "DATE", "18": "30", "19": "DATE", "20": "DATE", "21": "DATE", "22": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN}, "Ref Table(s)": {"0": "SPATIAL_DESCRIPTION", "1": "SPATIAL_DESCRIPTION", "2": NaN, "3": NaN, "4": "R_STRAT_UNIT_QUALIFIER", "5": "SP_ZONE_DEFINITION", "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": "R_SOURCE", "14": "R_STRAT_UNIT_QUALIFIER", "15": "SP_ZONE_DEFINITION", "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SPATIAL DESCRIPTION: The surface and sub-surface description of any object that\roccupies an area, such as a land right, field, facility or area of interest. The surface\rdescription may be stated in terms of a legal survey system, metes and bounds or\rpolygon. The mineral zone description describes the minerals (substances) and\rsubsurface definition (zones/formations) that are included in the definition. For land\rrights, continuations may be described by generating a new Spatial description.", "1": "SPATIAL DESCRIPTION OBSERVATION NUMBER: a unique series number for the\rspatial description, allowing the spatial description to be versioned over time.", "2": "MINERAL ZONE ID: unique identifier for the mineral zone", "3": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "4": "BASE QUALIFIER: qualifier, such as top or base, that describes the part of the zone\rdefinition that is to be used. Allows you to state whether the top or the base of the\rzone definition is used for the BASE ZONE DEFINITION ID. e.g the base of the zone\ris defined by the base of this zone definition.", "5": "ZONE DEFINITION IDENTIFIER: unique identifier for a mineral zone definition that is\rcreated and maintained by a regulatory or other agency as one of a set of standards.\rMay also be an ad hoc definition for the land zone that is created by an owner or\radministrator. In the case where the same zone definition is used for both the top and\rbase of the definition of the granted rights, populate the same value for both the TOP\rand BASE ZONE DEFINITION ID columns.", "6": "DEEP RIGHTS REVERSION INDICATOR: a yes / no flag that indicates that this\rzone definition is for deeper rights reversion designation (for the Crown of Alberta)", "7": "EFFECTIVE DATE: the date on which this row of data first came into effect from a\rbusiness perspective.", "8": "EXPIRY DATE: the date on which this row of data is no longer in effect from a\rbusiness perspective.", "9": "INACTIVATION DATE: Date on which the Mineral Zone was actually inactivated. Not\rthe same as expiry date, which is the date on which the primary term of the\ragreement ends.", "10": "METES AND BOUNDS: a textual description of the mineral zone definition which is\rgranted through the agreement. May include a description of the formation, zone,\rdepth or the areal extent for which this zone is valid.", "11": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "12": "REMARK: Narrative remarks about this row of data.", "13": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "14": "TOP QUALIFIER: qualifier, such as top or base, that describes the part of the zone\rdefinition that is to be used. Allows you to state whether the top or the base of the\rzone definition is used for the TOP ZONE DEFINITION ID.", "15": "ZONE DEFINITION IDENTIFIER: unique identifier for a mineral zone definition that is\rcreated and maintained by a regulatory or other agency as one of a set of standards.\rMay also be an ad hoc definition for the land zone that is createdby an owner or\radministrator. In the case where the same zone definition is used for both the top and\rbase of the definition of the granted rights, populate the same value for both the TOP\rand BASE ZONE DEFINITION ID columns.", "16": "ROW CHANGED BY: Application login id of the user who last changed the row.", "17": "ROW CHANGED DATE: System date of the last time the row was changed.", "18": "ROW CREATED BY: System user who created this row of data.", "19": "ROW CREATED DATE: Date that the row was created on.", "20": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "21": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "22": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}