{"SP_POINT": {"Column Name": {"0": "POINT_ID", "1": "ACTIVE_IND", "2": "COORD_ACQUISITION_ID", "3": "COORD_SYSTEM_ID", "4": "DATUM_ELEV", "5": "DATUM_ELEV_OUOM", "6": "EFFECTIVE_DATE", "7": "ELEVATION", "8": "ELEVATION_OUOM", "9": "EXPIRY_DATE", "10": "LATITUDE", "11": "LOCAL_COORD_SYSTEM_ID", "12": "LOCATION_QUALITY", "13": "LOCATION_TYPE", "14": "LONGITUDE", "15": "MEASURED_DEPTH", "16": "MEASURED_DEPTH_OUOM", "17": "POINT_LABEL", "18": "POINT_NO", "19": "POINT_POSITION", "20": "POINT_SEQ_NO", "21": "PPDM_GUID", "22": "REFERENCE_DATUM", "23": "REMARK", "24": "SOURCE", "25": "SPATIAL_DESCRIPTION_ID", "26": "SPATIAL_OBS_NO", "27": "ROW_CHANGED_BY", "28": "ROW_CHANGED_DATE", "29": "ROW_CREATED_BY", "30": "ROW_CREATED_DATE", "31": "ROW_EFFECTIVE_DATE", "32": "ROW_EXPIRY_DATE", "33": "ROW_QUALITY"}, "Null": {"0": "N", "1": "Y", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y", "33": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "NUMBER", "5": "VARCHAR2", "6": "DATE", "7": "NUMBER", "8": "VARCHAR2", "9": "DATE", "10": "NUMBER", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "NUMBER", "15": "NUMBER", "16": "VARCHAR2", "17": "VARCHAR2", "18": "NUMBER", "19": "VARCHAR2", "20": "NUMBER", "21": "VARCHAR2", "22": "VARCHAR2", "23": "VARCHAR2", "24": "VARCHAR2", "25": "VARCHAR2", "26": "NUMBER", "27": "VARCHAR2", "28": "DATE", "29": "VARCHAR2", "30": "DATE", "31": "DATE", "32": "DATE", "33": "VARCHAR2"}, "Length": {"0": "40", "1": "1", "2": "40", "3": "40", "4": "10,5", "5": "40", "6": "DATE", "7": "10,5", "8": "40", "9": "DATE", "10": "14,9", "11": "40", "12": "40", "13": "40", "14": "14,9", "15": "15,5", "16": "40", "17": "30", "18": "12,2", "19": "40", "20": "8", "21": "38", "22": "40", "23": "2000", "24": "40", "25": "40", "26": "8", "27": "30", "28": "DATE", "29": "30", "30": "DATE", "31": "DATE", "32": "DATE", "33": "40"}, "Key": {"0": "P", "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN}, "Ref Table(s)": {"0": NaN, "1": NaN, "2": "CS_COORD_ACQUISITION", "3": "CS_COORDINATE_SYSTEM", "4": NaN, "5": "PPDM_UNIT_OF_MEASURE", "6": NaN, "7": NaN, "8": "PPDM_UNIT_OF_MEASURE", "9": NaN, "10": NaN, "11": "CS_COORDINATE_SYSTEM", "12": "R_LOCATION_QUALITY", "13": "R_LOCATION_TYPE", "14": NaN, "15": NaN, "16": "PPDM_UNIT_OF_MEASURE", "17": NaN, "18": NaN, "19": "R_NODE_POSITION", "20": NaN, "21": NaN, "22": "R_SEIS_REF_DATUM", "23": NaN, "24": "R_SOURCE", "25": "SPATIAL_DESCRIPTION", "26": "SPATIAL_DESCRIPTION", "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "POINT IDENTIFIER: A unique identifier for a spatial description point.", "1": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "2": "COORD ACQUISITION: identifies an assembly of coordinate data that must be\rgrouped together. It should be acquired together at the same time, from the same\rsource, using the same method and at the same accuracy. Is typically used to\rindicate the level of accuracy of a set of coordinates.", "3": "COORDINATE SYSTEM ID: unique identifier for the coordinate system.", "4": "DATUM ELEVATION: The elevation of the vertical datum used to measure the\rposition of downhole positions, such as geophones.", "5": "ORIGINAL UNIT OF MEASURE", "6": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "7": "ELEVATION: The elevation of the point relative to the survey system or the TVD\r(vertial depth) of a pont that is in the subsurface. Most commonly, this will be used for\rwell related seismic, where source or receiver points may be located in the bore hole.", "8": "ORIGINAL UNIT OF MEASURE", "9": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "10": "LATITUDE: The \"selected\" latitude for this node relative to the Equator.", "11": "LOCAL COORDINATE SYSTEM IDENTIFIER: Unique identifier for the local\rcoordinate system, such as a local grid system (ATS, STS, MTS etc) to which these\rcoordinates have been referenced. Coordinates that are referenced to a local\rcoordinate systemare usually surveyed relative to the local system using metes and\rbounds or local survey references; maintaining the position of each point relative to\rits referenced local system is very important to survey accuracy.", "12": "LOCATION QUALITY: Indicates the quality or degree of reliablity of a location.", "13": "LOCATION TYPE: A reference table identifying the type of obj ect being given a legal\rlocation. For example, node, well, ...", "14": "LONGITUDE: The \"selected\" longitude for this node relative to the prime meridian of\rthe Geodetic Datum.", "15": "MEASURED DEPTH: the Measured Depth of a position, such as the shot or receiver\rplacement, below ground or sea level.", "16": "ORIGINAL UNIT OF MEASURE", "17": "POINT LABEL: the label to be associated with the point when mapping or reporting,\rsuch as a well identifier, seismic point name, facility name etc.", "18": "POINT NUMBER: A numeric value associated with a point, such as a number\rassigned to a seismic point by processors.", "19": "NODE POSITION: The position of a point, often the position of a node in a well bore,\ror some other node in a system. For example: surface point, bottomhole point,\rkick-off point, ....", "20": "POINT SEQUENCE NUMBER: In the case where a point is one of a sequence, you\rcan use this column to order the points in spatial sequence.", "21": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "22": "REFERNCE DATUM: the datum to which the elevations or depths have been\rreferenced, such as Mean Sea Level.", "23": "REMARK: Narrative remarks about this row of data.", "24": "SOURCE: The individual, company, agency, application or other source designated\ras the source of information for this row.", "25": "SPATIAL DESCRIPTION: The surface and sub-surface description of any object that\roccupies an area, such as a land right, field, facility or area of interest. The surface\rdescription may be stated in terms of a legal survey system, metes and bounds or\rpolygon. The mineral zone description describes the minerals (substances) and\rsubsurface definition (zones/formations) that are included in the definition. For land\rrights, continuations may be described by generating a new Spatial description.", "26": "SPATIAL DESCRIPTION OBSERVATION NUMBER: a unique series number for the\rspatial description, allowing the spatial description to be versioned over time.", "27": "ROW CHANGED BY: Application login id of the user who last changed the row.", "28": "ROW CHANGED DATE: System date of the last time the row was changed.", "29": "ROW CREATED BY: System user who created this row of data.", "30": "ROW CREATED DATE: Date that the row was created on.", "31": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "32": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "33": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}