{"SP_PARCEL_DLS": {"Column Name": {"0": "PARCEL_DLS_ID", "1": "ACTIVE_IND", "2": "AREA_ID", "3": "AREA_TYPE", "4": "COORD_SYSTEM_ID", "5": "DESCRIPTION", "6": "DLS_LEGAL_SUBDIVISION", "7": "DLS_MERIDIAN", "8": "DLS_MERIDIAN_DIRECTION", "9": "DLS_QUARTER_SECTION", "10": "DLS_QUARTER_SECTION_QUA", "11": "DLS_RANGE", "12": "DLS_RANGE_MODIFIER", "13": "DLS_SECTION", "14": "DLS_TOWNSHIP", "15": "DLS_TOWNSHIP_MODIFIER", "16": "EFFECTIVE_DATE", "17": "EXPIRY_DATE", "18": "LOCAL_COORD_SYSTEM_ID", "19": "PPDM_GUID", "20": "PRINCIPAL_MERIDIAN", "21": "REFERENCE_PLAN_NUM", "22": "REMARK", "23": "SOURCE", "24": "SPATIAL_DESCRIPTION_ID", "25": "SPATIAL_OBS_NO", "26": "ROW_CHANGED_BY", "27": "ROW_CHANGED_DATE", "28": "ROW_CREATED_BY", "29": "ROW_CREATED_DATE", "30": "ROW_EFFECTIVE_DATE", "31": "ROW_EXPIRY_DATE", "32": "ROW_QUALITY"}, "Null": {"0": "N", "1": "Y", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "TEYR", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "NUMBER", "7": "NUMBER", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "NUMBER", "12": "VARCHAR2", "13": "NUMBER", "14": "NUMBER", "15": "VARCHAR2", "16": "DATE", "17": "DATE", "18": "VARCHAR2", "19": "VARCHAR2", "20": "VARCHAR2", "21": "VARCHAR2", "22": "VARCHAR2", "23": "VARCHAR2", "24": "VARCHAR2", "25": "NUMBER", "26": "VARCHAR2", "27": "DATE", "28": "VARCHAR2", "29": "DATE", "30": "DATE", "31": "DATE", "32": "VARCHAR2"}, "Length": {"0": "40", "1": "1", "2": "40", "3": "40", "4": "40", "5": "1024", "6": "2", "7": "2", "8": "1", "9": "4", "10": "16", "11": "2", "12": "1", "13": "2", "14": "3", "15": "1", "16": "DATE", "17": "DATE", "18": "40", "19": "38", "20": "40", "21": "30", "22": "2000", "23": "40", "24": "40", "25": "8", "26": "30", "27": "DATE", "28": "30", "29": "DATE", "30": "DATE", "31": "DATE", "32": "40"}, "Key": {"0": "P", "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN}, "Ref Table(s)": {"0": NaN, "1": NaN, "2": "AREA", "3": "AREA", "4": "CS_COORDINATE_SYSTEM", "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": "CS_COORDINATE_SYSTEM", "19": NaN, "20": "CS_PRINCIPAL_MERIDIAN", "21": NaN, "22": NaN, "23": "R_SOURCE", "24": "SPATIAL_DESCRIPTION", "25": "SPATIAL_DESCRIPTION", "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SPATIAL PARCEL DOMINION LAND SURVEY: an ennumerated list of the parcels\rincluded in the DLS survey system. These parcels may be referenced when\rdescribing the spatial extent of a business object such as a land right, field or pool.", "1": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "2": "AREA ID: Unique identifier for any named area such as a country, province, project\rarea, area of interest, offshore area, district etc.", "3": "AREA TYPE ID: Unique identifier for the type of area, such as country, state, AOI etc.", "4": "COORDINATE SYSTEM ID: unique identifier for the coordinate system.", "5": "DESCRIPTION: Describes areas which are only partially included in the land parcel\rsmallest unit described (such as quarter LSD for DLS survey system)", "6": "LEGAL SUBDIVISION: Number for the Legal Subdivision (LSD) within a Can adian\rsection. Sections are divided into 16 legal subdivisions.", "7": "MERIDIAN: DLS meridian number. Values lie between 1-6.", "8": "MERIDIAN DIRECTION: E(ast) or W(est) indicating the direction of the principal\rmeridian.", "9": "DLS QUARTER SECTION: identifies the quarter of a section, as SE, SW, NW, NE\rquarters.", "10": "DLS QUARTER SECTION QUARTER: Identifies the quarter of a section quarter\rassigned in the land right document. Each quarter section is divided into 4 quarters\r(LSD), each of which is further subdivided into quarters.", "11": "RANGE: Number identifying the whole or partial range. Values lie between 1 - 34.", "12": "RANGE MODIFIER: The letter A differentiates duplicate range numbers (located only\rin Saskatchewan). Occurs when DLS survey systems 1 and 3 overlap causing\rduplicate Range numbers.", "13": "SECTION: Number designating the section within a township (1-36).", "14": "TOWNSHIP: Number identifying a whole or partial township. Values lie between\r1-120.", "15": "TOWNSHIP MODIFIER: The letter A differentiates duplicate township numbers\r(located only in Saskatchewan). Occurs where DLS survey systems 1 and 3 overlap\rcreating duplicate township numbers.", "16": "EFFECTIVE DATE: Date on which the land parcel became effective", "17": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "18": "LOCAL COORDINATE REFERENCE SYSTEM IDETNFIER: unique identifier for a\rlocally referenced coordinate system that was used to define a land parcel, such as\rATS or STS.", "19": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "20": "PRINICPAL MERIDIAN CODE: A reference table identifying the valid principal\rmeridians used for legal survey descriptions. This is the f irst meridian in the survey\rfrom which all other meridians are numbere d. For example Black Hi lls 1878, Boise\r1867, Chicksaw 1833, ...", "21": "REFERENCE PLAN NUM: Reference to a map prepared by a surveyor which shows\rthe land block in question", "22": "REMARK: Narrative remarks about this row of data.", "23": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "24": "SPATIAL DESCRIPTION: The surface and sub-surface description of any object that\roccupies an area, such as a land right, field, facility or area of interest. The surface\rdescription may be stated in terms of a legal survey system, metes and bounds or\rpolygon. The mineral zone description describes the minerals (substances) and\rsubsurface definition (zones/formations) that are included in the definition. For land\rrights, continuations may be described by generating a new Spatial description.\rNOTE: In this table, the FK is added to allow you to describe the polygonal outline for\ra parcel.", "25": "SPATIAL DESCRIPTION OBSERVATION NUMBER: a unique series number for the\rspatial description, allowing the spatial description to be versioned over time.", "26": "ROW CHANGED BY: Application login id of the user who last changed the row.", "27": "ROW CHANGED DATE: System date of the last time the row was changed.", "28": "ROW CREATED BY: System user who created this row of data.", "29": "ROW CREATED DATE: Date that the row was created on.", "30": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "31": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "32": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}