{"SP_POLYGON": {"Column Name": {"0": "POLYGON_ID", "1": "ACQUISITION_ID", "2": "ACTIVE_IND", "3": "BOUNDARY_DIRECTION", "4": "CONTAINED_BY_POLYGON_ID", "5": "COORD_SYSTEM_ID", "6": "DATUM_ELEV", "7": "DATUM_ELEV_OUOM", "8": "EFFECTIVE_DATE", "9": "EXCLUSION_IND", "10": "EXPIRY_DATE", "11": "INCLUSION_IND", "12": "LOCAL_COORD_SYSTEM_ID", "13": "LOCATION_TYPE", "14": "MAX_PLOT_SCALE", "15": "MIN_PLOT_SCALE", "16": "POLYGON_SET_ID", "17": "PPDM_GUID", "18": "PREFERRED_IND", "19": "REFERENCE_DATUM", "20": "REMARK", "21": "SOURCE", "22": "SPATIAL_DESCRIPTION_ID", "23": "SPATIAL_OBS_NO", "24": "ROW_CHANGED_BY", "25": "ROW_CHANGED_DATE", "26": "ROW_CREATED_BY", "27": "ROW_CREATED_DATE", "28": "ROW_EFFECTIVE_DATE", "29": "ROW_EXPIRY_DATE", "30": "ROW_QUALITY"}, "Null": {"0": "N", "1": "Y", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "NUMBER", "7": "VARCHAR2", "8": "DATE", "9": "VARCHAR2", "10": "DATE", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "VARCHAR2", "19": "VARCHAR2", "20": "VARCHAR2", "21": "VARCHAR2", "22": "VARCHAR2", "23": "NUMBER", "24": "VARCHAR2", "25": "DATE", "26": "VARCHAR2", "27": "DATE", "28": "DATE", "29": "DATE", "30": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "1", "3": "20", "4": "40", "5": "40", "6": "10,5", "7": "40", "8": "DATE", "9": "1", "10": "DATE", "11": "1", "12": "40", "13": "40", "14": "20", "15": "20", "16": "40", "17": "38", "18": "1", "19": "40", "20": "2000", "21": "40", "22": "40", "23": "8", "24": "30", "25": "DATE", "26": "30", "27": "DATE", "28": "DATE", "29": "DATE", "30": "40"}, "Key": {"0": "P", "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN}, "Ref Table(s)": {"0": NaN, "1": "CS_COORD_ACQUISITION", "2": NaN, "3": NaN, "4": "SP_POLYGON", "5": "CS_COORDINATE_SYSTEM", "6": NaN, "7": "PPDM_UNIT_OF_MEASURE", "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": "CS_COORDINATE_SYSTEM", "13": "R_LOCATION_TYPE", "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": "R_SEIS_REF_DATUM", "20": NaN, "21": "R_SOURCE", "22": "SPATIAL_DESCRIPTION", "23": "SPATIAL_DESCRIPTION", "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "POLYGON ID: Unique identifier to track the polygonal outline of a spatial object.\rComplex polygons are permitted.", "1": "ACQUISITION IDENTIFIER: Unique Identifier for the coordinate acquisition.", "2": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "3": "BOUNDARY DIRECTION: Direction from starting point to connect boundary points in\rpolygon. May be clockwise or counter clockwise.", "4": "CONTAINED BY POLYGON IDENTIFIER: the unique identifier of a polygon that\rcontains this one. Usually used in the case where the inner polygon represents an\rarea of exclusion to the outer polygon. The outer polygon may contain one or more\rsuch exclusions.", "5": "COORDINATE SYSTEM ID: unique identifier for the coordinate system.", "6": "DATUM ELEVATION: The elevation of the vertical datum used to measure the\rposition of downhole positions such as well points or geophones.", "7": "ORIGINAL UNIT OF MEASURE", "8": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "9": "EXCLUSION IND: EXCLUSION IND: Indicates whether the polygon is an area of\rexclusion (Y= the area is an exclusion)", "10": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "11": "INCLUSION INDICATOR: A Y/N flag indicating that this polygon represents an area\rof inclusion. Areas of exclusion can be indicated using the column EXCLUSION IND.", "12": "LOCAL COORDINATE SYSTEM IDENTIFIER: Unique identifier for the local\rcoordinate system, such as a local grid system (ATS, STS, MTS etc) to which these\rcoordinates have been referenced. Coordinates that are referenced to a local\rcoordinate system are usually surveyed relative to the local system using metes and\rbounds or local survey references; maintaining the position of each point relative to\rits referenced local system is very important to survey accuracy.", "13": "LOCATION TYPE: A reference table identifying the type of obj ect being given a legal\rlocation. For example, node, well, ...", "14": "MAXIMUM PLOT SCALE: The maximum scale that this polygon should be used for.", "15": "MINIMUM PLOT SCALE: The minimum scale that this polygon should be used for.", "16": "POLYGON SET IDENTIFIER: Use this column when a spatial description requires\rmultiple polygons and more than one set of the polygons may be stored for use (such\ras at different scales). Each set is grouped by the SET ID.", "17": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "18": "PREFERRED INDICATOR; A Y/N flag indicating that this polygon is part of the set\rthat should be mapped by preference.", "19": "REFERENCE DATUM: the datum to which the elevations or depths have been\rreferenced, such as Mean Sea Level.", "20": "REMARK: narrative remark about the polygon", "21": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "22": "SPATIAL DESCRIPTION: The surface and sub-surface description of any object that\roccupies an area, such as a land right, field, facility or area of interest. The surface\rdescription may be stated in terms of a legal survey system, metes and bounds or\rpolygon. The mineral zone description describes the minerals (substances) and\rsubsurface definition (zones/formations) that are included in the definition. For land\rrights, continuations may be described by generating a new Spatial description.", "23": "SPATIAL DESCRIPTION OBSERVATION NUMBER: a unique series number for the\rspatial description, allowing the spatial description to be versioned over time.", "24": "ROW CHANGED BY: Application login id of the user who last changed the row.", "25": "ROW CHANGED DATE: System date of the last time the row was changed.", "26": "ROW CREATED BY: System user who created this row of data.", "27": "ROW CREATED DATE: Date that the row was created on.", "28": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "29": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "30": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}