{"SP_PARCEL_OHIO": {"Column Name": {"0": "PARCEL_OHIO_ID", "1": "ACTIVE_IND", "2": "AREA_ID", "3": "AREA_TYPE", "4": "COORD_SYSTEM_ID", "5": "DESCRIPTION", "6": "EFFECTIVE_DATE", "7": "EXPIRY_DATE", "8": "JURISDICTION", "9": "MAP_QUAD_MIN", "10": "MAP_QUAD_NAME", "11": "OHIO_ALLOTMENT", "12": "OHIO_DIVISION", "13": "OHIO_FRACTION", "14": "OHIO_LAND_SUBDIVISION_NAM", "15": "OHIO_OTHER_SUBDIVISION", "16": "OHIO_QUARTER_TOWNSHIP", "17": "OHIO_RANGE", "18": "OHIO_RANGE_DIR", "19": "OHIO_TOWNSHIP", "20": "OHIO_TOWNSHIP_DIR", "21": "OHIO_TOWNSHIP_NAME", "22": "OHIO_TRACT", "23": "OHIO_TWP_LOT_CODE", "24": "OHIO_TWP_SECTION_CODE", "25": "PPDM_GUID", "26": "PRINCIPAL_MERIDIAN", "27": "REFERENCE_PLAN_NUM", "28": "REMARK", "29": "SOURCE", "30": "SPATIAL_DESCRIPTION_ID", "31": "SPATIAL_OBS_NO", "32": "SPOT_CODE", "33": "ROW_CHANGED_BY", "34": "ROW_CHANGED_DATE", "35": "ROW_CREATED_BY", "36": "ROW_CREATED_DATE", "37": "ROW_EFFECTIVE_DATE", "38": "ROW_EXPIRY_DATE", "39": "ROW_QUALITY"}, "Null": {"0": "N", "1": "Y", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y", "33": "Y", "34": "Y", "35": "Y", "36": "Y", "37": "Y", "38": "Y", "39": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "DATE", "7": "DATE", "8": "VARCHAR2", "9": "NUMBER", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "NUMBER", "18": "VARCHAR2", "19": "NUMBER", "20": "VARCHAR2", "21": "VARCHAR2", "22": "VARCHAR2", "23": "VARCHAR2", "24": "VARCHAR2", "25": "VARCHAR2", "26": "VARCHAR2", "27": "VARCHAR2", "28": "VARCHAR2", "29": "VARCHAR2", "30": "VARCHAR2", "31": "NUMBER", "32": "VARCHAR2", "33": "VARCHAR2", "34": "DATE", "35": "VARCHAR2", "36": "DATE", "37": "DATE", "38": "DATE", "39": "VARCHAR2"}, "Length": {"0": "40", "1": "1", "2": "40", "3": "40", "4": "40", "5": "1024", "6": "DATE", "7": "DATE", "8": "40", "9": "10,5", "10": "255", "11": "60", "12": "60", "13": "60", "14": "60", "15": "60", "16": "2", "17": "5,1", "18": "40", "19": "6,1", "20": "40", "21": "255", "22": "60", "23": "60", "24": "40", "25": "38", "26": "40", "27": "30", "28": "2000", "29": "40", "30": "40", "31": "8", "32": "40", "33": "30", "34": "DATE", "35": "30", "36": "DATE", "37": "DATE", "38": "DATE", "39": "40"}, "Key": {"0": "P", "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN, "37": NaN, "38": NaN, "39": NaN}, "Ref Table(s)": {"0": NaN, "1": NaN, "2": "AREA", "3": "AREA", "4": "CS_COORDINATE_SYSTEM", "5": NaN, "6": NaN, "7": NaN, "8": "BUSINESS_ASSOCIATE", "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": "R_EW_DIRECTION", "19": NaN, "20": "R_NS_DIRECTION", "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": "CS_PRINCIPAL_MERIDIAN", "27": NaN, "28": NaN, "29": "R_SOURCE", "30": "SPATIAL_DESCRIPTION", "31": "SPATIAL_DESCRIPTION", "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN, "37": NaN, "38": NaN, "39": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SPATIAL PARCELOHIO LOCATION: an ennumerated list of the parcels included in\rthe Ohio Survey system. These parcels may be referenced when describing the\rspatial extent of a business object such as a land right, field or pool.", "1": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "2": "AREA ID: Unique identifier for any named area such as a country, province, project\rarea, area of interest, offshore area, district etc.", "3": "AREA TYPE ID: Unique identifier for the type of area, such as country, state, AOI etc.", "4": "COORDINATE SYSTEM ID: unique identifier for the coordinate system.", "5": "DESCRIPTION: Describes areas which are only partially included in the land parcel\rsmallest unit described (such as quarter LSD for DLS survey system)", "6": "EFFECTIVE DATE: Date on which the land parcel became effective", "7": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "8": "BUSINESS ASSOCIATE: Unique identifier for a business associate, such as a\rperson, company, regulatory agency, government or consortium.", "9": "MAP QUADRANGLE: USGS map quadrangle scale, either 7.5 or 15 minute area\rsizes.", "10": "MAP QUADRANGLE NAME: Name of the USGS quadrangle in which the well\rlocation falls.", "11": "OHIO ALLOTMENT: Allotment irregular subdivision. Found in the CONNECTICUT\rWESTERN RESERVE, DONATION TRACT and UNITED STATES MILITARY\rDISTRICT Land Subdivision areas.", "12": "OHIO DIVISION: Division irregular subdivision. Found in the CONNECTICUT\rWESTERN RESERVE and UNITED STATES MILITARY DISTRICT Land\rSubdivision areas.", "13": "OHIO FRACTION: Fraction irregular subdivision, including direction if available.\rFound in various Land Subdivision areas.", "14": "OHIO LAND SUBDIVISION NAME: Ohio Original Land Subdivision name. There are\r44 distinct Land Subdivisions in the Ohio Department of Natural Resources (ODNR)\rORIGINAL LAND SUBDIVISIONS OF OHIO, MG-2 CD ROM digital dataset. 16 of\rthese encompass the majority of area, the remaining 28 are much smaller\rgeographic areas.", "15": "OHIO OTHER SUBDIVISION: Other irregular subdivision. Found in various Land\rSubdivision areas.", "16": "OHIO QUARTER TOWNSHIP: Quarter township irregular subdivision. Some Ohio\rCongressional townships are divided into four quarters rather than multiple one-mile\rsquare sections. Valid values are 1, 2, 3, 4, NE, NW, SE and SW. Found in the\rCONNECTICUT WESTERN RESERVE and UNITED STATES MILITARY DISTRICT\rLand Subdivision areas.", "17": "OHIO RANGE: Public or Private land survey system range number, typically\rsequentially numbered east or west of the referenced meridian (PRINCIPAL\rMERIDIAN). May also be referred to as CONGRESS RANGE. See WIKI for\radditional information.", "18": "OHIO RANGE DIRECTION: The East or West direction of the OHIO RANGE number\rrelative to the referenced meridian (PRINCIPAL MERIDIAN). May also be referred to\ras CONGRESS RANGE EW DIRECTION. See WIKI for additional information.", "19": "OHIO TOWNSHIP: Public or Private land survey system township number, typically\rsequentially numbered north or south of the baseline associated with the referenced\rmeridian (PRINCIPAL MERIDIAN). May also be referred to as CONGRESS\rTOWNSHIP. See WIKIfor additional information.", "20": "OHIO TOWNSHIP DIRECTION: The North or South direction of the OHIO\rTOWNSHIP number relative to the baseline associated with the referenced meridian\r(PRINCIPAL MERIDIAN). May also be referred to as CONGRESS TOWNSHIP NS\rDIRECTION. See WIKI for additional information.", "21": "OHIO TOWNSHIP NAME: Name of the Civil, Named or Political township where the\rwell is located. These Civil, Named or Political townships typically have a different\rareal extent than Public or Private land survey system townships, although in some\rcases they do exactly coincide.", "22": "OHIO TRACT: Tract irregular subdivision. Found in the CONNECTICUT WESTERN\rRESERVE,\"FRENCH GRANTS and UNITED STATES MILITARY DISTRICT Land\rSubdivision areas.", "23": "OHIO TOWNSHIP LOT CODE: Either the Virginia Military Service (VMS) irregular\rsubdivision lot value(s) if the well is located in the VIRGINIA MILITARY DISTRICT\rOhio Land Subdivision, or the Lot irregular subdivision (including direction if\ravailable) for other Ohio Land Subdivision areas.", "24": "OHIO TOWNSHIP SECTION CODE: Public OR Private land survey system section\rnumber.", "25": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "26": "PRINICPAL MERIDIAN CODE: A reference table identifying the valid principal\rmeridians used for legal survey descriptions. This is the f irst meridian in the survey\rfrom which all other meridians are numbere d. For example Black Hi lls 1878, Boise\r1867, Chicksaw 1833, ...", "27": "REFERENCE PLAN NUM: Reference to a map prepared by a surveyor which shows\rthe land block in question", "28": "REMARK: Narrative remarks about this row of data.", "29": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "30": "SPATIAL DESCRIPTION: The surface and sub-surface description of any object that\roccupies an area, such as a land right, field, facility or area of interest. The surface\rdescription may be stated in terms of a legal survey system, metes and bounds or\rpolygon. The mineral zone description describes the minerals (substances) and\rsubsurface definition (zones/formations) that are included in the definition. For land\rrights, continuations may be described by generating a new Spatial description.\rNOTE: In this table, the FK is added to allow you to describe the polygonal outline for\ra parcel.", "31": "SPATIAL DESCRIPTION OBSERVATION NUMBER: a unique series number for the\rspatial description, allowing the spatial description to be versioned over time.", "32": "SPOT_CODE: A code identifying a quatered division of a section, also known as the\raliquot description (e.g. NW, SW, C NE etc)", "33": "ROW CHANGED BY: Application login id of the user who last changed the row.", "34": "ROW CHANGED DATE: System date of the last time the row was changed.", "35": "ROW CREATED BY: System user who created this row of data.", "36": "ROW CREATED DATE: Date that the row was created on.", "37": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "38": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "39": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}