{"SP_PARCEL_LOT": {"Column Name": {"0": "PARCEL_LOT_ID", "1": "PARCEL_LOT_TYPE", "2": "PARCEL_LOT_NUM", "3": "ACTIVE_IND", "4": "EFFECTIVE_DATE", "5": "EXPIRY_DATE", "6": "GROSS_SIZE", "7": "GROSS_SIZE_OUOM", "8": "LOT_DESCRIPTION", "9": "LOT_NAME", "10": "PARCEL_CONGRESS_ID", "11": "PARCEL_OHIO_ID", "12": "PARCEL_PBL_ID", "13": "PARCEL_TEXAS_ID", "14": "PPDM_GUID", "15": "REMARK", "16": "REMARK_TYPE", "17": "SOURCE", "18": "SPATIAL_DESCRIPTION_ID", "19": "SPATIAL_OBS_NO", "20": "ROW_CHANGED_BY", "21": "ROW_CHANGED_DATE", "22": "ROW_CREATED_BY", "23": "ROW_CREATED_DATE", "24": "ROW_EFFECTIVE_DATE", "25": "ROW_EXPIRY_DATE", "26": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "DATE", "5": "DATE", "6": "NUMBER", "7": "VARCHAR2", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "VARCHAR2", "19": "NUMBER", "20": "VARCHAR2", "21": "DATE", "22": "VARCHAR2", "23": "DATE", "24": "DATE", "25": "DATE", "26": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "10", "3": "1", "4": "DATE", "5": "DATE", "6": "20,10", "7": "40", "8": "1024", "9": "255", "10": "40", "11": "40", "12": "40", "13": "40", "14": "38", "15": "2000", "16": "40", "17": "40", "18": "40", "19": "8", "20": "30", "21": "DATE", "22": "30", "23": "DATE", "24": "DATE", "25": "DATE", "26": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN}, "Ref Table(s)": {"0": NaN, "1": "R_PARCEL_LOT_TYPE", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": "PPDM_UNIT_OF_MEASURE", "8": NaN, "9": NaN, "10": "SP_PARCEL_CONGRESS", "11": "SP_PARCEL_OHIO", "12": "SP_PARCEL_PBL", "13": "SP_PARCEL_TEXAS", "14": NaN, "15": NaN, "16": "R_REMARK_TYPE", "17": "R_SOURCE", "18": "SPATIAL_DESCRIPTION", "19": "SPATIAL_DESCRIPTION", "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "PARCEL_LOT: unique identifier for the parcel lot. If desired, may be populated with\rthe ID of the land parcel to be described, although the appropriate FK column should\ralso be populated.", "1": "PARCEL LOT TYPE: the type of parcel lot descibed. Used to describe the type of US\rland parcel lots, in the congressional legal survey system.", "2": "LOT NUM: An alpha numeric identifier assigned to the lot, possibly by a municipality\ror county.", "3": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "4": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "5": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "6": "GROSS SIZE: Total amount of land measured in hectares/acres in the land right\rbase on working interest", "7": "GROSS SIZE OUOM: Usually hectares or acres", "8": "LOT DESCRIPTION: Textual description of the lot; usually formatted as metes and\rbounds", "9": "LOT NAME: Name assigned to the lot.", "10": "LAND PARCELCONGRESS: Unique identifier for the Congress land parcel", "11": "LAND PARCEL OHIO: Unique identifier for the Ohio land parcel", "12": "LAND PARCEL PUBLIC LAND BLOCK: Unique identifier for the land parcel in terms\rof the public land block system of Alberta, Canada", "13": "LAND PARCELTEXAS: Unique identifier for the Texas land parcel", "14": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "15": "REMARK: Narrative remarks about this row of data.", "16": "REMARK TYPE: Entries in this column describe the general topic of the remark, so\rthat remarks can be grouped by subject area. Topics might include royalty\rcomments, well comments, deficiencies, rental billing comments, etc.", "17": "SOURCE: The individual, company, agency, application or other source designated\ras the source of information for this row.", "18": "SPATIAL DESCRIPTION: The surface and sub-surface description of any object that\roccupies an area, such as a land right, field, facility or area of interest. The surface\rdescription may be stated in terms of a legal survey system, metes and bounds or\rpolygon. The mineral zone description describes the minerals (substances) and\rsubsurface definition (zones/formations) that are included in the definition. For land\rrights, continuations may be described by generating a new Spatial description.\rNOTE: In this table, the FK is added to allow you to describe the polygonal outline for\ra parcel.", "19": "SPATIAL DESCRIPTION OBSERVATION NUMBER: a unique series number for the\rspatial description, allowing the spatial description to be versioned over time.", "20": "ROW CHANGED BY: Application login id of the user who last changed the row.", "21": "ROW CHANGED DATE: System date of the last time the row was changed.", "22": "ROW CREATED BY: System user who created this row of data.", "23": "ROW CREATED DATE: Date that the row was created on.", "24": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "25": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "26": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}