{"STRAT_FIELD_NODE": {"Column Name": {"0": "FIELD_STATION_ID", "1": "NODE_ID", "2": "SOURCE", "3": "ACTIVE_IND", "4": "COORD_ACQUISITION_ID", "5": "COORD_SYSTEM_ID", "6": "EFFECTIVE_DATE", "7": "ELEV", "8": "ELEV_OUOM", "9": "EXPIRY_DATE", "10": "LATITUDE", "11": "LOCAL_COORD_SYSTEM_ID", "12": "LONGITUDE", "13": "NODE_LOC_TYPE", "14": "ORIGINAL_OBS_NO", "15": "ORIGINAL_XY_UOM", "16": "PPDM_GUID", "17": "REMARK", "18": "SELECTED_OBS_NO", "19": "ROW_CHANGED_BY", "20": "ROW_CHANGED_DATE", "21": "ROW_CREATED_BY", "22": "ROW_CREATED_DATE", "23": "ROW_EFFECTIVE_DATE", "24": "ROW_EXPIRY_DATE", "25": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "DATE", "7": "NUMBER", "8": "VARCHAR2", "9": "DATE", "10": "NUMBER", "11": "VARCHAR2", "12": "NUMBER", "13": "VARCHAR2", "14": "NUMBER", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "NUMBER", "19": "VARCHAR2", "20": "DATE", "21": "VARCHAR2", "22": "DATE", "23": "DATE", "24": "DATE", "25": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "40", "3": "1", "4": "40", "5": "40", "6": "DATE", "7": "10,5", "8": "40", "9": "DATE", "10": "14,9", "11": "40", "12": "14,9", "13": "40", "14": "8", "15": "40", "16": "38", "17": "2000", "18": "8", "19": "30", "20": "DATE", "21": "30", "22": "DATE", "23": "DATE", "24": "DATE", "25": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN}, "Ref Table(s)": {"0": "STRAT_FIELD_STATION", "1": NaN, "2": "R_SOURCE", "3": NaN, "4": "CS_COORD_ACQUISITION", "5": "CS_COORDINATE_SYSTEM", "6": NaN, "7": NaN, "8": "PPDM_UNIT_OF_MEASURE", "9": NaN, "10": NaN, "11": "CS_COORDINATE_SYSTEM", "12": NaN, "13": "R_STRAT_FLD_NODE_LOC", "14": NaN, "15": "PPDM_UNIT_OF_MEASURE", "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "FIELD STATION ID: unique identifier for the stratigraphic field station.", "1": "NODE IDENTIFIER: Unique identification number assigned to a specific point (node)\ron the wellbore.", "2": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "3": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "4": "COORD ACQUISITION: identifies an assembly of coordinate data that must be\rgrouped together. It should be acquired together at the same time, from the same\rsource, using the same method and at the same accuracy. May be used to indicate\rthe level of accuracy of a set of coordinates.", "5": "COORDINATE SYSTEM ID: unique identifier for the coordinate system.", "6": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "7": "ELEVATION: the elevation of the field station node.", "8": "ELEVATION ORIGINAL UNITS OF MEASURE: The units of measure that the\relelvation was originally obtained in (such as feet or meters).", "9": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "10": "LATITUDE: The \"selected\" latitude for this node relative to the Equator.", "11": "LOCAL COORDINATE SYSTEM IDENTIFIER: Unique identifier for the local\rcoordinate system, such as a local grid system (ATS, STS, MTS etc) to which these\rcoordinates have been referenced. Coordinates that are referenced to a local\rcoordinate system are usually surveyed relative to the local system using metes and\rbounds or local survey references; maintaining the position of each point relative to\rits referenced local system is very important to survey accuracy.", "12": "LONGITUDE: The \"selected\" longitude for this node relative to the prime meridian of\rthe Geodetic Datum.", "13": "STRATIGRAPHIC FIELD STATION NODE LOCATION TYPE: the type of location for\ra field station node. Locations may exist across the surface of a field station or\rvertically, to describe depths. Types may include sample point, corner, hole surface,\rhole bottom etc.", "14": "ORIGINAL OBSERVATION NUMBER: The observation number of the original\rversion of the node coordinates. Used when the Original coordinate units are not lat,\rlong. With the Node ID, this identifies the row containing the original values", "15": "ORIGINAL XY UNITS OF MEASURE: The units of measure for the original version of\rthe node coordinates.", "16": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "17": "REMARK: Narrative remarks about this row of data.", "18": "SELECTED OBSERVATION: The observation number of the selected version of the\rnode latitude, longitude. Together with the Node ID this uniquely identifies the row in\rWell Node Version where the Node Latitude, Longitude are selected from.", "19": "ROW CHANGED BY: Application login id of the user who last changed the row.", "20": "ROW CHANGED DATE: System date of the last time the row was changed.", "21": "ROW CREATED BY: System user who created this row of data.", "22": "ROW CREATED DATE: Date that the row was created on.", "23": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "24": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "25": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}