{"SUBSTANCE_USE": {"Column Name": {"0": "SUBSTANCE_ID", "1": "SUBSTANCE_USE_OBS_NO", "2": "ACTIVE_IND", "3": "AREA_ID", "4": "AREA_TYPE", "5": "BUSINESS_ASSOCIATE_ID", "6": "CONTRACT_ID", "7": "EFFECTIVE_DATE", "8": "EXPIRY_DATE", "9": "LAND_RIGHT_ID", "10": "LAND_RIGHT_SUBTYPE", "11": "PPDM_COLUMN_NAME", "12": "PPDM_GUID", "13": "PPDM_SYSTEM_ID", "14": "PPDM_TABLE_NAME", "15": "PREFERRED_IND", "16": "PROJECT_ID", "17": "REMARK", "18": "SOURCE", "19": "SUBSTANCE_ALIAS_ID", "20": "SUBSTANCE_USE_RULE_DESC", "21": "SUBSTANCE_USE_RULE_TYPE", "22": "ROW_CHANGED_BY", "23": "ROW_CHANGED_DATE", "24": "ROW_CREATED_BY", "25": "ROW_CREATED_DATE", "26": "ROW_EFFECTIVE_DATE", "27": "ROW_EXPIRY_DATE", "28": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "NUMBER", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "VARCHAR2", "7": "DATE", "8": "DATE", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "VARCHAR2", "19": "VARCHAR2", "20": "VARCHAR2", "21": "VARCHAR2", "22": "VARCHAR2", "23": "DATE", "24": "VARCHAR2", "25": "DATE", "26": "DATE", "27": "DATE", "28": "VARCHAR2"}, "Length": {"0": "40", "1": "8", "2": "1", "3": "40", "4": "40", "5": "40", "6": "40", "7": "DATE", "8": "DATE", "9": "40", "10": "30", "11": "30", "12": "38", "13": "40", "14": "30", "15": "1", "16": "40", "17": "2000", "18": "40", "19": "40", "20": "240", "21": "40", "22": "30", "23": "DATE", "24": "30", "25": "DATE", "26": "DATE", "27": "DATE", "28": "40"}, "Key": {"0": "P", "1": "P", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN}, "Ref Table(s)": {"0": "SUBSTANCE\rSUBSTANCE_ALIAS", "1": NaN, "2": NaN, "3": "AREA", "4": "AREA", "5": "BUSINESS_ASSOCIATE", "6": "CONTRACT", "7": NaN, "8": NaN, "9": "LAND_RIGHT", "10": "LAND_RIGHT", "11": "PPDM_COLUMN", "12": NaN, "13": "PPDM_TABLE\rPPDM_COLUMN", "14": "PPDM_TABLE\rPPDM_COLUMN", "15": NaN, "16": "PROJECT", "17": NaN, "18": "R_SOURCE", "19": "SUBSTANCE_ALIAS", "20": NaN, "21": "R_SUBSTANCE_USE_RULE", "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SUBSTANCE IDENTIFIER: Unique identifier for a substance that can be described\reither chemically or in terms of composition. Elements, ions, isotopes, isomers,\rminerals, chemicals, solvents, production substances, hydrocarbons etc are all listed.\rBe advised that many applications and agencies may use the same term, but the\rdefinition and composition details may not be the same. Use the SUBSTANCE XREF\rtable to capture relationships between substances, such as similar substances.", "1": "SUBSTANCE USE OBSERVATION NUMBER: Unique observation number for the\ruse description for a substance.", "2": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "3": "AREA ID: Unique identifier for any named area such as a country, province, project\rarea, area of interest, offshore area, district etc.", "4": "AREA TYPE: Unique identifier for the type of area, such as country, state, AOI etc.", "5": "BUSINESS ASSOCIATE: Unique identifier for a business associate, such as a\rperson, company, regulatory agency, government or consortium.", "6": "CONTRACT ID: Unique identifier for the contract table.", "7": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "8": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "9": "LAND RIGHT ID: Unique Identifier for the land right. A land right is the rights you\rhave to land, regardless of how obtained. It may be owned outright, rented, aquired\rby agreement or contract.", "10": "LAND RIGHT SUBTYPE: column indicating the type of land right. Must be one of the\rvalid subtypes: LAND TITLE, LAND UNIT, LAND UNIT TRACT, LAND\rAGREEMENT, LAND AGREE PART.", "11": "COLUMN NAME: Name of the column within a specific table found in the schema", "12": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "13": "SYSTEM IDENTIFIER: A unique identifier for a data storage system, such as a\rdatabase or XML schema.", "14": "TABLE NAME: The name of the table within the schema.", "15": "PREFERRED INDICATOR: A Y/N flag indicating that this substance is the one\rpreferred for use in the situation shown by the existance of foreign key relationships.\rOther substances may also be valid, but for special circumstances or for more\rrefinedreporting and business extraction.", "16": "PROJECT IDENTIFIER: unique identifier for the project.", "17": "REMARK: Narrative remarks about this row of data", "18": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "19": "SUBSTANCE ALIAS IDENTIFIER: The unique identifier for the alias that should be\rused in the context or situation identified by this row of data.", "20": "SUBSTANCE USE RULE DESCRIPTION: A narrataive that describes in more detail\ra rule controlling when or how this substance definition should be used.", "21": "SUBSTANCE USE RULE: A rule that describes in more detail a rule controlling when\ror how this substance definition should be used.", "22": "ROW CHANGED BY: Application login id of the user who last changed the row.", "23": "ROW CHANGED DATE: System date of the last time the row was changed.ho last\rchanged the row.", "24": "ROW CREATED BY: System user who created this row of data.", "25": "ROW CREATED DATE: Date that the row was created on.", "26": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "27": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "28": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}