{"SUBSTANCE_BA": {"Column Name": {"0": "SUBSTANCE_ID", "1": "ANL_SOURCE", "2": "BA_OBS_NO", "3": "ACTIVE_IND", "4": "BA_ROLE_TYPE", "5": "CAS_NUMBER", "6": "EFFECTIVE_DATE", "7": "EXPIRY_DATE", "8": "LOCATION", "9": "MANUFACTURER", "10": "PPDM_GUID", "11": "PRICE", "12": "PRICE_OUOM", "13": "PROBLEM_IND", "14": "PURCHASE_QUANTITY", "15": "PURCHASE_QUANTITY_OUOM", "16": "PURCHASE_QUANTITY_TYPE", "17": "REMARK", "18": "SOURCE", "19": "STEP_SEQ_NO", "20": "SUBSTANCE_BA_ID", "21": "SUPPLIER", "22": "ROW_CHANGED_BY", "23": "ROW_CHANGED_DATE", "24": "ROW_CREATED_BY", "25": "ROW_CREATED_DATE", "26": "ROW_EFFECTIVE_DATE", "27": "ROW_EXPIRY_DATE", "28": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "NUMBER", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "DATE", "7": "DATE", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "NUMBER", "12": "VARCHAR2", "13": "VARCHAR2", "14": "NUMBER", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "VARCHAR2", "19": "NUMBER", "20": "VARCHAR2", "21": "VARCHAR2", "22": "VARCHAR2", "23": "DATE", "24": "VARCHAR2", "25": "DATE", "26": "DATE", "27": "DATE", "28": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "8", "3": "1", "4": "40", "5": "40", "6": "DATE", "7": "DATE", "8": "40", "9": "30", "10": "38", "11": "12,2", "12": "40", "13": "1", "14": "10,5", "15": "40", "16": "40", "17": "2000", "18": "40", "19": "8", "20": "40", "21": "30", "22": "30", "23": "DATE", "24": "30", "25": "DATE", "26": "DATE", "27": "DATE", "28": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN}, "Ref Table(s)": {"0": "SUBSTANCE\rANL_ANALYSIS_STEP\rANL_ANALYSIS_REPORT", "1": "ANL_ANALYSIS_STEP\rANL_ANALYSIS_REPORT", "2": NaN, "3": NaN, "4": "R_ANL_BA_ROLE_TYPE", "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": "PPDM_UNIT_OF_MEASURE", "13": NaN, "14": NaN, "15": "PPDM_UNIT_OF_MEASURE", "16": NaN, "17": NaN, "18": "R_SOURCE", "19": "ANL_ANALYSIS_STEP", "20": "BUSINESS_ASSOCIATE", "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SUBSTANCE IDENTIFIER: Unique identifier for a substance that can be described\reither chemically or in terms of composition. Elements, ions, isotopes, isomers,\rminerals, chemicals, solvents, production substances, hydrocarbons etc are all listed.\rBe advised that many applications and agencies may use the same term, but the\rdefinition and composition details may not be the same. Use the SUBSTANCE XREF\rtable to capture relationships between substances, such as similar substances.", "1": "ANALYSIS SOURCE: The source that the analysis came from, this could be a lab\rtechnician, a lab, a company, a government agency, etc.", "2": "BUSINESS ASSOCIATE OBSERVATION NUMBER: Unique identifier for the record\rthat describes the business associate that made the observation regarding the\rsample analysis.", "3": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "4": "REFERENCE ANALYSIS BUSINESS ASSOCIATE ROLE TYPE: the type of role that\ra business associate plays or may play during a sample analysis. Examples include\rtechnician, scientist, reviewer, laboratory, conducted for, document preparation etc.", "5": "CAS NUMBER: A unique numeric identifier for chemicals, alloys and biological\rsequences.", "6": "EFFECTIVE DATE: The date that the data in this row first comes into effect.", "7": "EXPIRY DATE: The date that the data in this row is no longer active or in effect.", "8": "LOCATION: The address or the manufacturer or of the warehouse the substance is\rcoming from.", "9": "MANUFACTURER: The name of the manufacturer that has the substance available\ror can produce the substance at request.", "10": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "11": "PRICE: The price of the specified quantity of the substance.", "12": "ORIGINAL UNIT OF MEASURE", "13": "PROBLEM INDICATOR: A Y/N flag indicating whether or not there is a problem with\rthe step. If a yes flag is indicated, additional information regarding the problem\rshould be noted in the table ANL_PROBLEM.", "14": "QUANTITIES AVAILABLE: The portion quantities that the manufacturer provides the\rsubstance in. For example the substance may be available in liters, kg, sheets, etc.", "15": "ORIGINAL UNIT OF MEASURE", "16": "PURCHASE QUANTITY TYPE: The quantities in which a product or substance can\rbe purchased, such as 20 pund sack, 10 liter pail, etc.", "17": "REMARK: Narrative remarks about this row of data.", "18": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "19": "STEP SEQUENCE NUMBER: A unique number indicating the sequence of the step\ramong other steps in the preparation and processing of the sample. This column is a\rsufficient method to keep track of what is done in the sample analysis. However, if\rthe requirement for more complicated tracking such as two steps occurring\rsimultaneously or if steps are needed to be added to the initial procedure, use the\rtwo columns STEP_SEQ_NO1 and STEP_SEQ_NO2 in the table\rANL_STEP_XREF.", "20": "SUBSTANCE BUSINESS ASSOCIATE IDENTIFIER: Unique identifier for the\rbusiness associate who had anything to do with a substance. Track the role played\rby the business associate in BA_ROLE. If a BA plays more than one role, create a\rrow for each role played by the BA.", "21": "SUPPLIER: the name of the company from whom this substance can be obtained", "22": "ROW CHANGED BY: Application login id of the user who last changed the row.", "23": "ROW CHANGED DATE: System date of the last time the row was changed.", "24": "ROW CREATED BY: System user who created this row of data.", "25": "ROW CREATED DATE: Date that the row was created on.", "26": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "27": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "28": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}