{"SUBSTANCE": {"Column Name": {"0": "SUBSTANCE_ID", "1": "ACTIVE_IND", "2": "API_GRAVITY_MAX", "3": "API_GRAVITY_MIN", "4": "ATOMIC_MASS", "5": "ATOMIC_MASS_NUMBER", "6": "ATOMIC_WEIGHT", "7": "CARBON_COUNT", "8": "CARBON_COUNT_MAX", "9": "CARBON_COUNT_MIN", "10": "COMPOSITION_FORMULA", "11": "CONVERSION_QUANTITY", "12": "EFFECTIVE_DATE", "13": "EXPIRY_DATE", "14": "IONIC_CHARGE", "15": "MOLECULAR_MASS", "16": "M_Z_ION", "17": "PHASE_TYPE", "18": "PH_VALUE", "19": "PPDM_GUID", "20": "PREFERRED_IND", "21": "PREFERRED_LONG_NAME", "22": "PREFERRED_SHORT_NAME", "23": "PREFERRED_UOM_ID", "24": "PROPERTY_SET_ID", "25": "REMARK", "26": "SOURCE", "27": "SOURCE_DOCUMENT_ID", "28": "SUBSTANCE_DEFINITION", "29": "VALENCE_VALUE", "30": "ROW_CHANGED_BY", "31": "ROW_CHANGED_DATE", "32": "ROW_CREATED_BY", "33": "ROW_CREATED_DATE", "34": "ROW_EFFECTIVE_DATE", "35": "ROW_EXPIRY_DATE", "36": "ROW_QUALITY"}, "Null": {"0": "N", "1": "Y", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y", "33": "Y", "34": "Y", "35": "Y", "36": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "NUMBER", "3": "NUMBER", "4": "NUMBER", "5": "VARCHAR2", "6": "NUMBER", "7": "NUMBER", "8": "NUMBER", "9": "NUMBER", "10": "VARCHAR2", "11": "VARCHAR2", "12": "DATE", "13": "DATE", "14": "NUMBER", "15": "NUMBER", "16": "VARCHAR2", "17": "VARCHAR2", "18": "NUMBER", "19": "VARCHAR2", "20": "VARCHAR2", "21": "VARCHAR2", "22": "VARCHAR2", "23": "VARCHAR2", "24": "VARCHAR2", "25": "VARCHAR2", "26": "VARCHAR2", "27": "VARCHAR2", "28": "VARCHAR2", "29": "NUMBER", "30": "VARCHAR2", "31": "DATE", "32": "VARCHAR2", "33": "DATE", "34": "DATE", "35": "DATE", "36": "VARCHAR2"}, "Length": {"0": "40", "1": "1", "2": "10,5", "3": "10,5", "4": "10,5", "5": "20", "6": "10,5", "7": "10", "8": "10", "9": "10", "10": "1024", "11": "40", "12": "DATE", "13": "DATE", "14": "10,5", "15": "10,5", "16": "240", "17": "40", "18": "10,5", "19": "38", "20": "1", "21": "255", "22": "30", "23": "40", "24": "40", "25": "2000", "26": "40", "27": "40", "28": "2000", "29": "10,5", "30": "30", "31": "DATE", "32": "30", "33": "DATE", "34": "DATE", "35": "DATE", "36": "40"}, "Key": {"0": "P", "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN}, "Ref Table(s)": {"0": NaN, "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": "PPDM_QUANTITY", "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": "PPDM_UNIT_OF_MEASURE", "24": "PPDM_PROPERTY_SET", "25": NaN, "26": "R_SOURCE", "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "SUBSTANCE IDENTIFIER: Unique identifier for a substance that can be described\reither chemically or in terms of composition. Elements, ions, isotopes, isomers,\rminerals, chemicals, solvents, production substances, hydrocarbons etc are all listed.\rBe advised that many applications and agencies may use the same term, but the\rdefinition and composition details may not be the same. Use the SUBSTANCE XREF\rtable to capture relationships between substances, such as similar substances.", "1": "ACTIVE INDICATOR: A Y or N flag indicating whether this row of data is currently\reither active/valid (Y) or inactive/invalid (N).", "2": "AMERICAN PETROLEUM INTSTITUTE GRAVITY MAXIMUM: The maximum value\rfor the gravity of this substance as per the American Petroleum Institute and the\rNational Institute of Standards and Technology.", "3": "AMERICAN PETROLEUM INTSTITUTE GRAVITY MINIMUM: The minimum value\rfor the gravity of this substance as per the American Petroleum Institute and the\rNational Institute of Standards and Technology.", "4": "ATOMIC MASS: The atomic mass of the element in this row.", "5": "ATOMIC MASS NUMBER: The atomic mass number of the element in this row.", "6": "ATOMIC WEIGHT: The atomic weight of the element or composite in this row.", "7": "CARBON COUNT: For a hydrocarbon that has a single allowable carbon count. For\rexample, Methane has 1 carbon atom, and Ethane has 2 carbon atoms.", "8": "CARBON COUNT MAXIMUM: For a hydrocarbon family that includes a range of\rcarbon counts, the maximum carbon count included in this substance. For example,\raromatic hydrocarbons may be generally defined as having between 6 and 8 carbon\ratoms in an appropriate configuration.", "9": "CARBON COUNT MINIMUM: For a hydrocarbon family that includes a range of\rcarbon counts, the minimum carbon count included in this substance. For example,\raromatic hydrocarbons may be generally defined as having between 6 and 8 carbon\ratoms in an appropriate configuration.", "10": "COMPOSITION FORMULA: The chemical formula of the composition in this row. For\rexample the chemical formula for isobutane is (CH3)3CH.", "11": "CONVERSION QUANTITY: A Conversion code for a generic set of conversion\rfactors (GAS VOL and OIL VOL) CONVERSION QUANTITY: The generic fluid or\rQuantity to be used when looking up applicable conversion factors in the\rPPDM_VOL_MEAS_CONV table.", "12": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "13": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "14": "IONIC CHARGE: The ionic charge of the element or composition in this row. Specify\rif cation or anion by using + or -, respectively.", "15": "Molecular mass: The molecular mass of the molecule in this row.", "16": "MASS OVER CHARGE ION: the mass of a molecular fragment (in atomic mass units\ror grams per mole) divided by the charge of the molecular fragment (largely a -1\rcharge). As compound elute from the end of a gas chromatography column in a\rGCMS they are bombardedby an electron beam with an ionization energy of 70 eV.\rThis amount of energy is just enough to break each compound into distinct molecular\rfragments that largely have a -1 charge - giving the tool the specificity to uniquely\ridentify compounds. These m/z molecules are further separated by the magnetic field\rprior to smashing into the mass spectrometer detector. In comparison, an ICP-MS or\rinductively coupled plasma mass spec using a very very high ionization energy at\r5000 degrees C which totally atomizes all compounds and results in an elemental\rcomposition - commonly used for water analysis - e.g. sulfate or SO4-- is broken\rdown to pure S.", "17": "PHASE TYPE: The type of phase the substance in the row is; gas, liquid or solid.\rPending on changes in the environment physical phase changes may occur to the\rsubstance.", "18": "PH VALUE: The pH value of the substance in this row.", "19": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "20": "PREFERRED INDICATOR: A Y/N flag indicating whether or not this substance is\rpreferred.", "21": "PREFERRED LONG NAME: the usual or preferred name given to this substance.\rDenormalise this for performance reasons from SUBSTANCE ALIAS if you use this\rcolumn (the value should be in both tables).", "22": "PREFERRED SHORT NAME: Common short name used for the production entity.\rThe usual or preferred short name given to this substance. Denormalise this for\rperformance reasons from SUBSTANCE ALIAS if you use this column (the value\rshould be in both tables).", "23": "PREFERRED UNIT OF MEASURE: The unit of measure in which volumes for this\rsubstance should be usually be stored by preference. This may be modified in detail\rtables SUBSTANCE TABLE or SUBSTANCE COLUMN for specific use in individual\rtables and columns. It is usually most effecient if a particular substance is always\rstored in the same units, but sometimes business needs dictate that some values be\rin different units of measure.", "24": "TABLE PROPERTY CONTROL SET IDENTIFIER: Unique identifier for the property\rcontrol information. This can be used to help you control how a vertical table is\rimplemented, by determining preferred units of measure, data entry types and other\rspecifications for each kind of property that is defined.", "25": "REMARK: Narrative remarks about this row of data", "26": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "27": "SOURCE DOCUMENT: The literature reference for the information about the\rsubstance in this row.", "28": "SUBSTANCE DEFINITION: The full, narrative definition for a substance should be\rprovided here. For substances used in scientific literature, this may be used in\rconjunction with the bibliographic reference in SOURCE DOCUMENT. If a substance\rhasmore than one definition, each definition should likely be related to its own\rSUBSTANCE ID. This may occur, particularly for terms (such as OIL) which are used\rby many sources with different definitions.", "29": "VALENCE VALUE: The value of the valence electrons for the substance in this row.", "30": "ROW CHANGED BY: Application login id of the user who last changed the row.", "31": "ROW CHANGED DATE: System date of the last time the row was changed.ho last\rchanged the row.", "32": "ROW CREATED BY: System user who created this row of data.", "33": "ROW CREATED DATE: Date that the row was created on.", "34": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "35": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "36": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}