{"WELL_ACTIVITY_TYPE_EQUIV": {"Column Name": {"0": "ACTIVITY_SET_ID", "1": "ACTIVITY_TYPE_ID", "2": "ACTIVITY_SET_ID2", "3": "ACTIVITY_TYPE_ID2", "4": "EQUIV_OBS_NO", "5": "ACTIVE_IND", "6": "EFFECTIVE_DATE", "7": "EQUIV_OWNER_BA_ID", "8": "EQUIV_TYPE", "9": "EXPIRY_DATE", "10": "FULL_NAME", "11": "PPDM_GUID", "12": "REMARK", "13": "SOURCE", "14": "ROW_CHANGED_BY", "15": "ROW_CHANGED_DATE", "16": "ROW_CREATED_BY", "17": "ROW_CREATED_DATE", "18": "ROW_EFFECTIVE_DATE", "19": "ROW_EXPIRY_DATE", "20": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "N", "4": "N", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "VARCHAR2", "4": "NUMBER", "5": "VARCHAR2", "6": "DATE", "7": "VARCHAR2", "8": "VARCHAR2", "9": "DATE", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "VARCHAR2", "15": "DATE", "16": "VARCHAR2", "17": "DATE", "18": "DATE", "19": "DATE", "20": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "40", "3": "40", "4": "8", "5": "1", "6": "DATE", "7": "40", "8": "40", "9": "DATE", "10": "255", "11": "38", "12": "2000", "13": "40", "14": "30", "15": "DATE", "16": "30", "17": "DATE", "18": "DATE", "19": "DATE", "20": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": "P", "4": "P", "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN}, "Ref Table(s)": {"0": "WELL_ACTIVITY_TYPE", "1": "WELL_ACTIVITY_TYPE", "2": "WELL_ACTIVITY_TYPE", "3": "WELL_ACTIVITY_TYPE", "4": NaN, "5": NaN, "6": NaN, "7": "BUSINESS_ASSOCIATE", "8": "R_WELL_ACT_TYPE_EQUIV", "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": "R_SOURCE", "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "ACTIVITY SET IDENTIFIER: Unique identifier for a set of activities", "1": "ACTIVITY TYPE IDENTIFIER: the unique identifier or code for the activity.", "2": "ACTIVITY SET IDENTIFIER: Unique identifier for a valid set of activity codes, such\ras those required by a regulatory or professional agency.", "3": "ACTIVITY TYPE: The type of activity that is tracked, such as drilling, testing, coring,\rtubing etc. May be any kind of activity related to well operations.", "4": "ACTITIVTY EQUIVALENCE OBS NO: Unique number assigned to the equivalence.\rThe type of equivalance is subject to the definitions of the creator of an activity set\r(such as by regulation), so it is possible for these equivalences to change over time.", "5": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "6": "EFFECTIVE DATE: date on which the data in this row came into effect.", "7": "EQUIVALENCE OWNER BUSINESS ASSOCIATE IDENTIFIER: Unique identifier for\rthe business associate who owns this equivalence.", "8": "WELL ACTIVITY TYPE EQUIVALENCE: This value can be used to qualify the\requivalence measure, so that you can set up equivalences for activities that are\rclosely related, or for activities that subsume or are fully equivalent with another\ractivity type.", "9": "EXPIRY DATE: Date on which the data in this row of data was no longer in effect.", "10": "WELL ALIAS: Full alias name or code assigned to a well by a partner, agency or\rapplicaiton.", "11": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "12": "REMARK: Narrative remarks about this row of data.", "13": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "14": "ROW CHANGED BY: Application login id of the user who last changed the row.", "15": "ROW CHANGED DATE: System date of the last time the row was changed.", "16": "ROW CREATED BY: System user who created this row of data.", "17": "ROW CREATED DATE: Date that the row was created on.", "18": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "19": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "20": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}