{"WELL_DIR_SRVY_STATION": {"Column Name": {"0": "UWI", "1": "SURVEY_ID", "2": "SOURCE", "3": "DEPTH_OBS_NO", "4": "ACCURACY_PROBLEM_IND", "5": "ACCURACY_PROBLEM_REASO", "6": "ACTIVE_IND", "7": "AZIMUTH", "8": "AZIMUTH_OUOM", "9": "CLOSURE_DIST", "10": "CLOSURE_DIST_DIR", "11": "CLOSURE_DIST_DIR_OUOM", "12": "CLOSURE_DIST_OUOM", "13": "DELTA_LAT", "14": "DELTA_LONG", "15": "DOG_LEG_SEVERITY", "16": "EFFECTIVE_DATE", "17": "EXPIRY_DATE", "18": "INCLINATION", "19": "INCLINATION_OUOM", "20": "LATITUDE", "21": "LONGITUDE", "22": "PERIOD_OBS_NO", "23": "POINT_TYPE", "24": "PPDM_GUID", "25": "RAD_UNCERT_DIST", "26": "RAD_UNCERT_DIST_OUOM", "27": "RAD_UNCERT_DIST_REASON", "28": "REMARK", "29": "RPT_AZIMUTH", "30": "RPT_AZIMUTH_OUOM", "31": "STATION_ID", "32": "STATION_MD", "33": "STATION_MD_OUOM", "34": "STATION_TVD", "35": "STATION_TVDSS", "36": "STATION_TVDSS_OUOM", "37": "STATION_TVD_OUOM", "38": "SURVEY_RUN_NUM", "39": "SURVEY_TYPE", "40": "VERTICAL_SECTION", "41": "VERTICAL_SECTION_OUOM", "42": "X_OFFSET", "43": "X_OFFSET_EW_DIRECTION", "44": "X_OFFSET_OUOM", "45": "Y_OFFSET", "46": "Y_OFFSET_NS_DIRECTION", "47": "Y_OFFSET_OUOM", "48": "ROW_CHANGED_BY", "49": "ROW_CHANGED_DATE", "50": "ROW_CREATED_BY", "51": "ROW_CREATED_DATE", "52": "ROW_EFFECTIVE_DATE", "53": "ROW_EXPIRY_DATE", "54": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "N", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y", "33": "Y", "34": "Y", "35": "Y", "36": "Y", "37": "Y", "38": "Y", "39": "Y", "40": "Y", "41": "Y", "42": "Y", "43": "Y", "44": "Y", "45": "Y", "46": "Y", "47": "Y", "48": "Y", "49": "Y", "50": "Y", "51": "Y", "52": "Y", "53": "Y", "54": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "NUMBER", "4": "VARCHAR2", "5": "VARCHAR2", "6": "VARCHAR2", "7": "NUMBER", "8": "VARCHAR2", "9": "NUMBER", "10": "NUMBER", "11": "VARCHAR2", "12": "VARCHAR2", "13": "NUMBER", "14": "NUMBER", "15": "NUMBER", "16": "DATE", "17": "DATE", "18": "NUMBER", "19": "VARCHAR2", "20": "NUMBER", "21": "NUMBER", "22": "NUMBER", "23": "VARCHAR2", "24": "VARCHAR2", "25": "NUMBER", "26": "VARCHAR2", "27": "VARCHAR2", "28": "VARCHAR2", "29": "NUMBER", "30": "VARCHAR2", "31": "VARCHAR2", "32": "NUMBER", "33": "VARCHAR2", "34": "NUMBER", "35": "NUMBER", "36": "VARCHAR2", "37": "VARCHAR2", "38": "VARCHAR2", "39": "VARCHAR2", "40": "NUMBER", "41": "VARCHAR2", "42": "NUMBER", "43": "VARCHAR2", "44": "VARCHAR2", "45": "NUMBER", "46": "VARCHAR2", "47": "VARCHAR2", "48": "VARCHAR2", "49": "DATE", "50": "VARCHAR2", "51": "DATE", "52": "DATE", "53": "DATE", "54": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "40", "3": "8", "4": "1", "5": "40", "6": "1", "7": "10,5", "8": "40", "9": "10,5", "10": "10,5", "11": "40", "12": "40", "13": "14,9", "14": "14,9", "15": "10,5", "16": "DATE", "17": "DATE", "18": "10,5", "19": "40", "20": "14,9", "21": "14,9", "22": "8", "23": "40", "24": "38", "25": "10,5", "26": "40", "27": "40", "28": "2000", "29": "10,5", "30": "40", "31": "40", "32": "10,5", "33": "40", "34": "10,5", "35": "10,5", "36": "40", "37": "40", "38": "40", "39": "40", "40": "15,2", "41": "40", "42": "10,5", "43": "40", "44": "40", "45": "10,5", "46": "40", "47": "40", "48": "30", "49": "DATE", "50": "30", "51": "DATE", "52": "DATE", "53": "DATE", "54": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": "P", "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN, "37": NaN, "38": NaN, "39": NaN, "40": NaN, "41": NaN, "42": NaN, "43": NaN, "44": NaN, "45": NaN, "46": NaN, "47": NaN, "48": NaN, "49": NaN, "50": NaN, "51": NaN, "52": NaN, "53": NaN, "54": NaN}, "Ref Table(s)": {"0": "WELL_DIR_SRVY\rWELL_DRILL_PERIOD", "1": "WELL_DIR_SRVY", "2": "WELL_DIR_SRVY", "3": NaN, "4": NaN, "5": "R_DIR_SRVY_ACC_REASON", "6": NaN, "7": NaN, "8": "PPDM_UNIT_OF_MEASURE", "9": NaN, "10": NaN, "11": "PPDM_UNIT_OF_MEASURE", "12": "PPDM_UNIT_OF_MEASURE", "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": "PPDM_UNIT_OF_MEASURE", "20": NaN, "21": NaN, "22": "WELL_DRILL_PERIOD", "23": "R_DIR_SRVY_POINT_TYPE", "24": NaN, "25": NaN, "26": "PPDM_UNIT_OF_MEASURE", "27": "R_DIR_SRVY_RAD_UNCERT", "28": NaN, "29": NaN, "30": "PPDM_UNIT_OF_MEASURE", "31": NaN, "32": NaN, "33": "PPDM_UNIT_OF_MEASURE", "34": NaN, "35": NaN, "36": "PPDM_UNIT_OF_MEASURE", "37": "PPDM_UNIT_OF_MEASURE", "38": NaN, "39": "R_DIR_SRVY_TYPE", "40": NaN, "41": "PPDM_UNIT_OF_MEASURE", "42": NaN, "43": "R_EW_DIRECTION", "44": "PPDM_UNIT_OF_MEASURE", "45": NaN, "46": "R_NS_DIRECTION", "47": "PPDM_UNIT_OF_MEASURE", "48": NaN, "49": NaN, "50": NaN, "51": NaN, "52": NaN, "53": NaN, "54": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "UNIQUE WELL IDENTIFIER: A unique name, code or number designated as the\rprimary key for this row.", "1": "DIRECTIONAL SURVEY IDENTIFIER: Number uniquely identifying each Directional\rSurvey. Assign as a unique value (for example a sequence number) for either 1)\runique to each given UWI and SOURCE, 2) unique to each UWI, regardless of\rSOURCE, or 3) unique to each WELL_DIR_SRVY record, regardless of UWI and/or\rSOURCE. This attribute should not be used to store or have any relation to \"Run\rNumbers\" (SURVEY_RUN_NUM) or \"Reference numbers/identifiers/etc.\"\r(SURVEY_REF_NUM) associated with a given survey because it is part of the table\rPrimary Key. If it were used to store \"Run Numbers\" or \"Reference\rnumbers/identifiers/etc.\", then it would not be possible to store two versions of a\rgiven survey having the same \"Run Number\" or \"Reference number/identifier/etc.\"\r(for example, two different X/Y Offset calculation methods).", "2": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "3": "DEPTH OBSERVATION NUMBER: Identifier for the depth of the reading. Use this\rvalue to uniquely identify every station within the same survey (UWI, SURVEY_ID,\rSOURCE). Suggest assigning as a sequence number, or optionally multiply the\rSTATION_MD by 100 and convert to an Integer (multiplying by 100 avoids potential\rduplicate integer versions if two stations differ by less than 1 foot or meter).", "4": "ACCURACY PROBLEM INDICATOR: A Y/N Flag to indicate there is a problem with\rthe accuracy of this survey station.", "5": "ACCURACY PROBLEM REASON: The reason there is a problem, if\rACCURACY_PROBLEM_IND is set to 'Y'.", "6": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently\ractive or valid. Also used to identify valid or invalid stations when there is overlap\r(rather than including a separate \"PREFERRED_IND\" attribute).", "7": "AZIMUTH: Value for the measurement angle (in degrees) of the clockwise departure\rfrom the reference north (WELL_DIR_SRVY.AZIMUTH_NORTH_TYPE) to the well\rbore direction at the survey station Measured Depth. By industry convention, 0\rdegree azimuth coincides with North, 90 degree azimuth with East, 180 degree\razimuth with South, and 270 degree azimuth with West. Values should be within the\rrange of 0.00 to 360.00 degrees, although some systems may allow angles between\r-360.00 to +360.00.", "8": "AZIMUTH OUOM: Original units of measure for the Azimuth value.", "9": "CLOSURE DISTANCE: The horizontal straight line distance from the survey origin\r(Well surface location) to this survey station, calculated using the Pythagorean\rTheorem from this survey station X and Y Offsets. Closure Distance is often reported\ronly once for the bottom hole location; however, the value stored in this attribute is\rthe Closure Distance at this survey station. When rotations are applied to a well path\r(e.g. changing from True North referenced to Grid North), the X and Y Offset values\rwill change at each survey station, but the calculated Closure Distance remains the\rsame. Often referred to as simply \"Closure\" or sometimes referred to as \"Horizontal\rDisplacement\".", "10": "CLOSURE DISTANCE DIRECTION: The direction angle, in the horizontal plane,\rfrom the survey origin (Well surface location) to this survey station, calculated using\rtrigonometry from this survey station X and Y Offsets. This value should be a number\rbetween 0.00 and 360.00 degrees; 0.00 and 360.00 represent North, 90.00 is East,\r180.00 is South and 270.00 is West. The Closure Distance Direction angle North\rReference is defined by WELL_DIR_SRVY.OFFSET_NORTH_TYPE and CRS by\rWELL_DIR_SRVY.OFFSET_COORD_SYSTEM_ID. Sometimes referred to as\r\"Horizontal Displacement Direction\" or \"Horizontal Displacement Bearing\".", "11": "CLOSURE DISTANCE DIRECTION OUOM: Original units of measure for the\rClosure Distance Direction angle.", "12": "CLOSURE DISTANCE OUOM: Original units of measure for the Closure Distance.", "13": "DELTA LATITUDE: The difference between the well surface hole latitude and the\rsurvey station latitude. A positive value indicates a northerly direction; a negative\rvalue indicates a southerly direction. ADD this value to the well Surface Latitude to\rdefine the Station Latitude.", "14": "DELTA LONGITUDE: The difference between the well surface hole longitude and the\rsurvey station longitude. A positive value indicates an easterly direction; a negative\rvalue indicates a westerly direction. ADD this value to the well Surface Longitude to\rdefine the Station Longitude.", "15": "DOG LEG SEVERITY: The rate of change in the wellbore inclination at the survey\rstation. This value is usually expressed in degrees / 100 feet.", "16": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "17": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "18": "INCLINATION: The angle (in degrees) of the well bore defined by a tangent line\rrelative to an \"imaginary\" vertical line (well bore deviation away from the vertical) at\rthe survey station Measured Depth. The vertical line is always parallel to the direction\rof earth's gravity. By industry standard, 0 degree inclination is vertical (downward\rpointing) and 90 degrees inclination is horizontal. An inclination (angle) greater than\r90 degrees coincides with the term \"drilling up\". Values should be in the range of\r0.00 to 180.00 degrees.", "19": "INCLINATION OUOM: Original unit of measure for the inclination value.", "20": "LATITUDE: The latitude of the station in the directional survey. Recommended\rpractice is to utilize DELTA_LAT and DELTA_LONG instead of storing actual\rLATITUDE/LONGITUDE values. NOTE - If the LATITUDE/LONGITUDE attributes\rare populated, the Geodetic Datum must be defined in\rWELL_DIR_SRVY.GEOG_COORD_SYSTEM_ID.", "21": "LONGITUDE: The longitude value of the point in the directional survey.\rRecommended practice is to utilize DELTA_LAT and DELTA_LONG instead of\rstoring actual LATITUDE/LONGITUDE values. NOTE - If the\rLATITUDE/LONGITUDE attributes are populated, the Geodetic Datum must be\rdefined in WELL_DIR_SRVY.GEOG_COORD_SYSTEM_ID.", "22": "WELL DRILLING PERIOD OBSERVATION NUMBER: Unique identifier for a\rreporting period for well operations. Internationally, there may be 1, 2 or 3 periods\reach 24 hours. In some jurisdictions, reporting may occur for more than one period,\rsuch as for an 8 hour tour shift and a 24 daily summary. When available, the well\rdrilling operations reporting period (tour) when this survey reading was taken. Could\ralso be calculated when times are recorded.", "23": "POINT TYPE: The way survey measurements were obtained for a directional survey\robservation point. For example, measured, extrapolated beyond a survey,\rinterpolated between two existing survey points.", "24": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "25": "RADIUS OF UNCERTAINTY DISTANCE: The radius of uncertainty distance of this\rsurvey station caused primarily by sections of the wellbore where only inclination\rdata exists.", "26": "RADIUS OF UNCERTAINTY DISTANCE OUOM: Radius of Uncertainty Distance\roriginal unit of measure.", "27": "RADIUS OF UNCERTAINTY DISTANCE REASON: Reason for Radius of\rUncertainty.", "28": "REMARK: Narrative remarks about this row of data.", "29": "REPORT AZIMUTH: The unprocessed, unrotated azimuth (angle (in degrees) of the\rclockwise departure from the reference north\r(WELL_DIR_SRVY.RPT_NORTH_TYPE) to the well bore direction at the survey\rstation Measured Depth) value obtained directly from the hardcopy report. Retained\rto avoid future confusion when comparing data from this table to the original\rdocuments/reports/files/etc. By industry convention, 0 degree azimuth coincides with\rNorth, 90 degree azimuth with East, 180 degree azimuth with South, and 270 degree\razimuth with West. Values should be within the range of 0.00 to 360.00 degrees,\ralthough some systems may allow angles between -360.00 to +360.00.", "30": "REPORT AZIMUTH OUOM: Original units of measure for the Report Azimuth value.", "31": "STATION IDENTIFIER: Unique identifier of survey station within the directional\rsurvey.", "32": "STATION MEASURED DEPTH: Depth measured along the borehole from the\rsurface to the survey station.", "33": "STATION MEASURED DEPTH OUOM: Station measured depth original unit of\rmeasure.", "34": "TRUE VERTICAL DEPTH: Straight line depth measured from the surface to the\rsurvey station.", "35": "STATION TRUE VERTICAL DEPTH SUB-SEA: STATION_TVD converted to a\rSub-Sea Vertical depth.", "36": "STATION TRUE VERTICAL DEPTH SUB-SEA OUOM: Station true vertical depth\rsub-sea original unit of measure.", "37": "STATION TRUE VERTICAL DEPTH OUOM: Station true vertical depth original unit\rof measure.", "38": "SURVEY RUN NUMBER: Used to identify the Survey Run Number from which this\rstation came from. If this survey is a single Run, then all stations should have the\rsame SURVEY_RUN_NUM. If this survey is a Combined Run or Composite, different\rstations may have different SURVEY_RUN_NUM values. Run number is typically\rNOT explicitly stated on a given directional survey report, but is often assigned when\rmultiple survey runs are evaluated, processes and/or composited.", "39": "SURVEY TYPE: Type of Tool or Equipment used to acquire this station in a\rDirectional Survey. For example, gyroscopic, magnetic, MWD, totco, acid bottle, etc.\rIncluded for each station so stations acquired using different tools can be identified in\ra composited survey.", "40": "VERTICAL SECTION: The horizontal straight line distance the wellbore moves -- in\rthe direction of the target -- from the survey origin (Well surface location) to this\rsurvey station, as projected onto the planned or intended plane of proposal. Vertical\rSection distance can be reported only once for the bottom hole location; however, the\rvalue stored in this attribute is the Vertical Section distance at this survey station. The\rcalculation for Vertical Section (V.Section) is as follows: V.Section = DEast *\rSin(VSAngle) + DNorth * Cos(VSAngle). DEast is the survey station east distance\r(X_OFFSET) from wellhead. DNorth is the survey station north distance\r(Y_OFFSET) from wellhead. VSAngle is the planned or intended azimuth angle from\rwellhead to the target (or a value chosen by the user); VSAngle is defined in the\rWELL_DIR_SRVY.PLANE_OF_PROPOSAL attribute. Vertical Section distance can\rbe computed on the fly, but is stored for retrieval efficiency.", "41": "VERTICAL SECTION OUOM: Vertical section original unit of measure.", "42": "X OFFSET: Distance in the X, east/west direction of the positional offset from the well\rsurface hole to the survey station. This value can be stored in one of two methods -\r1) Store as a positive/negative number and ignore the corresponding\rX_OFFSET_EW_DIRECTION or 2) Store as an absolute value number and use\rX_OFFSET_EW_DIRECTION to identify if the value is positive (E) or negative (W).", "43": "X_OFFSET EAST-WEST DIRECTION: Direction indicator (East or West) of the\rX_OFFSET.", "44": "PX OFFSET OUOM: North/south direction deviation original unit of measure.", "45": "Y OFFSET: Distance in the Y, north/south direction of the positional offset from the\rwell surface hole to the survey station. This value can be stored in one of two\rmethods - 1) Store as a positive/negative number and ignore the corresponding\rY_OFFSET_NS_DIRECTION or 2) Store as an absolute value number and use\rY_OFFSET_NS_DIRECTION to identify if the value is positive (N) or negative (S).", "46": "Y_OFFSET NORTH-SOUTH DIRECTION: Direction indicator (North or South) of the\rY_OFFSET", "47": "Y OFFSET OUOM: East/west direction deviation original unit of measure.", "48": "ROW CHANGED BY: Application login id of the user who last changed the row.", "49": "ROW CHANGED DATE: System date of the last time the row was changed.", "50": "ROW CREATED BY: System user who created this row of data.", "51": "ROW CREATED DATE: Date that the row was created on.", "52": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "53": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "54": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}