{"WELL_DRILL_PERIOD_CREW": {"Column Name": {"0": "UWI", "1": "PERIOD_OBS_NO", "2": "CREW_COMPANY_BA_ID", "3": "DETAIL_OBS_NO", "4": "ACTIVE_IND", "5": "BOOKED_TIME_ELAPSED", "6": "BOOKED_TIME_ELAPSED_UOM", "7": "CREW_MEMBER_BA_ID", "8": "CREW_MEMBER_NAME", "9": "CREW_MEMBER_NUM", "10": "CREW_MEMBER_RECORD_IND", "11": "CREW_POSITION", "12": "CREW_RECORD_IND", "13": "CREW_REFERENCE_NUM", "14": "EFFECTIVE_DATE", "15": "EXPIRY_DATE", "16": "INJURY_IND", "17": "INJURY_INITIAL_IND", "18": "NO_INJURY_IND", "19": "OVERHEAD_COST", "20": "OVERHEAD_COST_UOM", "21": "OVERHEAD_TYPE", "22": "PPDM_GUID", "23": "REMARK", "24": "SF_SUBTYPE", "25": "SOURCE", "26": "SUBSISTANCE_IND", "27": "SUPPORT_FACILITY_ID", "28": "TOTAL_CREW_COUNT", "29": "TOTAL_INJURY_COUNT", "30": "ROW_CHANGED_BY", "31": "ROW_CHANGED_DATE", "32": "ROW_CREATED_BY", "33": "ROW_CREATED_DATE", "34": "ROW_EFFECTIVE_DATE", "35": "ROW_EXPIRY_DATE", "36": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "N", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y", "28": "Y", "29": "Y", "30": "Y", "31": "Y", "32": "Y", "33": "Y", "34": "Y", "35": "Y", "36": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "NUMBER", "2": "VARCHAR2", "3": "NUMBER", "4": "VARCHAR2", "5": "NUMBER", "6": "VARCHAR2", "7": "VARCHAR2", "8": "VARCHAR2", "9": "VARCHAR2", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "VARCHAR2", "14": "DATE", "15": "DATE", "16": "VARCHAR2", "17": "VARCHAR2", "18": "VARCHAR2", "19": "NUMBER", "20": "VARCHAR2", "21": "VARCHAR2", "22": "VARCHAR2", "23": "VARCHAR2", "24": "VARCHAR2", "25": "VARCHAR2", "26": "VARCHAR2", "27": "VARCHAR2", "28": "NUMBER", "29": "NUMBER", "30": "VARCHAR2", "31": "DATE", "32": "VARCHAR2", "33": "DATE", "34": "DATE", "35": "DATE", "36": "VARCHAR2"}, "Length": {"0": "40", "1": "8", "2": "40", "3": "8", "4": "1", "5": "10,5", "6": "40", "7": "40", "8": "255", "9": "255", "10": "1", "11": "40", "12": "1", "13": "30", "14": "DATE", "15": "DATE", "16": "1", "17": "1", "18": "1", "19": "12,2", "20": "40", "21": "40", "22": "38", "23": "2000", "24": "30", "25": "40", "26": "1", "27": "40", "28": "10", "29": "10", "30": "30", "31": "DATE", "32": "30", "33": "DATE", "34": "DATE", "35": "DATE", "36": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": "P", "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN, "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": NaN}, "Ref Table(s)": {"0": "WELL_DRILL_PERIOD", "1": "WELL_DRILL_PERIOD", "2": "BUSINESS_ASSOCIATE", "3": NaN, "4": NaN, "5": NaN, "6": "PPDM_UNIT_OF_MEASURE", "7": "BUSINESS_ASSOCIATE", "8": NaN, "9": NaN, "10": NaN, "11": "R_EMPLOYEE_POSITION", "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": "PPDM_UNIT_OF_MEASURE", "21": "R_BA_CREW_OVERHEAD_TY\rPE", "22": NaN, "23": NaN, "24": "SF_SUPPORT_FACILITY", "25": "R_SOURCE", "26": NaN, "27": "SF_SUPPORT_FACILITY", "28": NaN, "29": NaN, "30": NaN, "31": NaN, "32": NaN, "33": NaN, "34": NaN, "35": NaN, "36": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "UWI: Unique identifier for a well.", "1": "WELL DRILLING PERIOD OBSERVATION NUMBER: unique identifier for a\rreporting period for well operations. Internationally, there may be 1, 2 or 3 periods\reach 24 hours. In some jurisdictions, reporting may occur for more than one period,\rsuch as for an 8 hour tour shift and a 24 daily summary.", "2": "CREW COMPANY BUSINESS ASSOCIATE IDENTIFIER: Unique identifier for the\rcompany that runs this crew. Not all members of a crew may be employees, but may\rbe contractors or seconded to the crew by another company.", "3": "DETAIL OBSERVATION NUMBER: Unique sequence number that allows more than\rone record about a crew to be captured for every drill period.", "4": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "5": "BOOKED TIME ELAPSED: The number of hours booked by the crew member or the\rcrew during a reporting period.", "6": "UNIT OF MEASURE", "7": "CREW MEMBER BUSINESS ASSOCIATE IDENTIFIER: unique identifier for a\rbusiness associate who is a member of this crew.", "8": "CREW MEMBER NAME: Unvalidated field for the name of the crew member. If you\rwant to track crew member names from a validated list, please use CREW MEMBER\rBA ID.", "9": "CREW MEMBER NUMBER: Unvalidated field for the number of the crew member. If\ryou want to track crew member numbers from a validated list, please use CREW\rMEMBER BA and link to BA_ALIAS, where the alias type = CREW MEMBER\rNUMBER (or whatever you choose to call it).", "10": "CREW MEMBER RECORD INDICATOR: A Y/N flag indicating whether this record\rcontains information about an individual member of the crew.", "11": "EMPLOYEE POSITION: A reference table listing valid types of employee positions.\rThis list may come from human resource departments.", "12": "CREW RECORD INDICATOR: A Y/N flag indicating whether this row of data is for\rthe entire crew (a summary).", "13": "CREW REFERENCE NUMBER: a local reference number assigned to a crew or to a\rcrew member for the purposes of bookeeping. Usually used for payroll purposes.\rNote that this information could also be stored in BA_ALIAS.", "14": "EFFECTIVE DATE: the date on which this row of data first came into effect from a\rbusiness perspective.", "15": "EXPIRY DATE: the date on which this row of data is no longer in effect from a\rbusiness perspective.", "16": "INJURY INDICATOR: A Y/N flag indicating whether an injury was recorded during\rthis period. In the record for the crew, records whether any crew member was\rinjured. For the record for an individual, records whether that individual was injured.\rFor regulatory reasons, a separate flag is provided to confirm that an injury DID ocurr\rduring this period. This is more explicit than a single Y/N flag that covers both\rcontingencies, as the N position may be ambiguous. In this case, a setting of Y\rindicates that an injury WAS recorded during this period (Yes, there were injuries).", "17": "INJURY INITIALS INDICATOR: A Y/N flag confirming that the crew member has\rproperly initialed the well period reporting sheet that explicitly confirms whether or not\rthere was an injury. Typically, the crew member must initial a spot marked NO\rINJURY or another spot marked YES INJURY .", "18": "NO INJURY INDICATOR: For regulatory reasons, a separate flag is provided to\rconfirm that NO injury ocurred during this period. This is more explicit than a single\rY/N flag that covers both contingencies, as the N position may be ambiguous. In this\rcase, a setting of Y indicates that an injury was NOT recorded during this period\r(Yes, there were no injuries).", "19": "OVERHEAD COST: the cost associated with overhead, such as living costs.", "20": "UNIT OF MEASURE", "21": "CREW OVERHEAD TYPE: They type of overhead paid to a crew member during a\rpeiod, such as cost of living allowance.", "22": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "23": "REMARK: Narrative remarks relating to this row of data.", "24": "SUPPORT FACILITY SUBTYPE: check constraint value that is used to maintain the\rrelationship between SUPPORT FACILITY and its various sub-types.", "25": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "26": "SUBSISTANCE INDICATOR: A Y/N flag indicating whether the crew or an individual\ron the crew qualified for a subsistance subsidy during this reporting period.", "27": "SUPPORT FACILITY IDENTIIER: Unique identifier for the support facility that the\rcrew is assigned to for this reporting period. Normally a vessel, but could be a camp\ror other habitat.", "28": "TOTAL CREW COUNT: The total number in the crew during this reporting period.\rOnly used for the record that represents the entire crew.", "29": "TOTAL INJURY COUNT: The total number of injuries recorded during this shift. This\rcolumn is only used in the record for the entire crew.", "30": "ROW CHANGED BY: Application login id of the user who last changed the row.", "31": "ROW CHANGED DATE: System date of the last time the row was changed.", "32": "ROW CREATED BY: System user who created this row of data.", "33": "ROW CREATED DATE: Date that the row was created on.", "34": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "35": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "36": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}