{"WELL_DRILL_MUD_ADDITIVE": {"Column Name": {"0": "UWI", "1": "DRILL_PERIOD_OBS_NO", "2": "ADDITIVE_ID", "3": "ADDITIVE_SEQ_NO", "4": "ACTIVE_IND", "5": "ADDITIVE_METHOD", "6": "ADDITIVE_PERIOD", "7": "ADDITIVE_PERIOD_OUOM", "8": "ADDITIVE_PERIOD_UOM", "9": "EFFECTIVE_DATE", "10": "END_TIME", "11": "EXPIRY_DATE", "12": "PPDM_GUID", "13": "QUANTITY_COUNT", "14": "QUANTITY_VALUE", "15": "QUANTITY_VALUE_OUOM", "16": "QUANTITY_VALUE_UOM", "17": "REMARK", "18": "SOURCE", "19": "START_TIME", "20": "TIMEZONE", "21": "ROW_CHANGED_BY", "22": "ROW_CHANGED_DATE", "23": "ROW_CREATED_BY", "24": "ROW_CREATED_DATE", "25": "ROW_EFFECTIVE_DATE", "26": "ROW_EXPIRY_DATE", "27": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "N", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y", "24": "Y", "25": "Y", "26": "Y", "27": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "NUMBER", "2": "VARCHAR2", "3": "NUMBER", "4": "VARCHAR2", "5": "VARCHAR2", "6": "NUMBER", "7": "VARCHAR2", "8": "VARCHAR2", "9": "DATE", "10": "DATE", "11": "DATE", "12": "VARCHAR2", "13": "NUMBER", "14": "NUMBER", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "VARCHAR2", "19": "DATE", "20": "VARCHAR2", "21": "VARCHAR2", "22": "DATE", "23": "VARCHAR2", "24": "DATE", "25": "DATE", "26": "DATE", "27": "VARCHAR2"}, "Length": {"0": "40", "1": "8", "2": "40", "3": "8", "4": "1", "5": "40", "6": "10,5", "7": "40", "8": "40", "9": "DATE", "10": "DATE", "11": "DATE", "12": "38", "13": "12,2", "14": "15,5", "15": "40", "16": "40", "17": "2000", "18": "40", "19": "DATE", "20": "40", "21": "30", "22": "DATE", "23": "30", "24": "DATE", "25": "DATE", "26": "DATE", "27": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": "P", "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": NaN}, "Ref Table(s)": {"0": "WELL_DRILL_PERIOD", "1": "WELL_DRILL_PERIOD", "2": "CAT_ADDITIVE", "3": NaN, "4": NaN, "5": "R_ADDITIVE_METHOD", "6": NaN, "7": "PPDM_UNIT_OF_MEASURE", "8": "PPDM_UNIT_OF_MEASURE", "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": "PPDM_UNIT_OF_MEASURE", "16": "PPDM_UNIT_OF_MEASURE", "17": NaN, "18": "R_SOURCE", "19": NaN, "20": "R_TIMEZONE", "21": NaN, "22": NaN, "23": NaN, "24": NaN, "25": NaN, "26": NaN, "27": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "UNIQUE WELL IDENTIFIER: A unique name, code or number designated as the\rprimary key for this row.", "1": "WELL DRILLING PERIOD OBSERVATION NUMBER: unique identifier for a\rreporting period for well operations. Internationally, there may be 1, 2 or 3 periods\reach 24 hours. In some jurisdictions, reporting may occur for more than one period,\rsuch as for an 8 hour tour shift and a 24 daily summary. In this case, the period in\rwhich the crew STARTED to add the additives. The period may extend over one or\rmore reporting periods.", "2": "CATALOGUE MUD ADDITIVE IDENTIFIER: Unique identifier for the kind of additive.\rThe CAT_ADDITIVE table captures information about the package type and size for\reach additive.", "3": "ADDITIVE SEQUENCE NUMBER: Number in sequence for multiple observations of\rthe addition of an additive over the period, so that the total of additives or the amount\rof additives used at various times may be captured.", "4": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "5": "ADDITIVE METHOD: The method used for adding the additive to the well bore. While\rthe patterns of addition may be complex, use this reference value to describe the\rmethod generally.", "6": "ADDITIVE PERIOD: the period of time over which the additive is added to the drilling\rmud. Usually additives are put in over a period of several hours.", "7": "ORIGINAL UNIT OF MEASURE", "8": "UNIT OF MEASURE", "9": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "10": "END TIME: The time when the process of adding the additive is complete. More\rcommonly the start time and the period over which the additive was added is\rcaptured, so this is calculated most of the time. Only use this column if you require\rthis information in addition to the ADDITIVE PERIOD", "11": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "12": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL shouldbe created.", "13": "QUANTITY COUNT: The number of units of the additive, as described in\rCAT_ADDITIVE . PURCHASE QUANTITY TYPE, that were added to the drilling fluid\rduring the period. For example, if two bags of additive were added, the number 2\rshould be stored here. To determine the full amount, multiply by the PURCHASE\rQUANTITY column in CAT_ADDITIVE. Units of measure are usually stored in\rPURCHASE QUANTITY UOM.", "14": "QUANTITY VALUE: the quantity of additive added in the case where the amount\rcannot be calcuated from multiplying the QUANTITY COUNT by the purchase\rquantity in CAT ADDITIVE. Used for performance or to simplify queries, as this value\rcanusually be calculated.", "15": "ORIGINAL UNIT OF MEASURE", "16": "UNIT OF MEASURE", "17": "REMARK: Narrative remarks about this row of data.", "18": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "19": "START ADD TIME: The time of day when you first began to add the additive to the\rdrilling fluid. The period over which the additive is added may cross reporting periods,\rbut should usually be stored in the period when the process was begun.", "20": "TIMEZONE: The timezone for the start and end times.", "21": "ROW CHANGED BY: Application login id of the user who last changed the row.", "22": "ROW CHANGED DATE: System date of the last time the row was changed.", "23": "ROW CREATED BY: System user who created this row of data.", "24": "ROW CREATED DATE: Date that the row was created on.", "25": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "26": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "27": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}