{"WELL_ACTIVITY_CAUSE": {"Column Name": {"0": "UWI", "1": "SOURCE", "2": "ACTIVITY_OBS_NO", "3": "CAUSE_TYPE", "4": "ACTIVE_IND", "5": "DESCRIPTION", "6": "EFFECTIVE_DATE", "7": "EQUIPMENT_ID", "8": "EXPIRY_DATE", "9": "PERIOD_OBS_NO", "10": "PPDM_GUID", "11": "REMARK", "12": "ROW_CHANGED_BY", "13": "ROW_CHANGED_DATE", "14": "ROW_CREATED_BY", "15": "ROW_CREATED_DATE", "16": "ROW_EFFECTIVE_DATE", "17": "ROW_EXPIRY_DATE", "18": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "N", "3": "N", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "NUMBER", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "DATE", "7": "VARCHAR2", "8": "DATE", "9": "NUMBER", "10": "VARCHAR2", "11": "VARCHAR2", "12": "VARCHAR2", "13": "DATE", "14": "VARCHAR2", "15": "DATE", "16": "DATE", "17": "DATE", "18": "VARCHAR2"}, "Length": {"0": "40", "1": "40", "2": "8", "3": "40", "4": "1", "5": "2000", "6": "DATE", "7": "40", "8": "DATE", "9": "8", "10": "38", "11": "2000", "12": "30", "13": "DATE", "14": "30", "15": "DATE", "16": "DATE", "17": "DATE", "18": "40"}, "Key": {"0": "P", "1": "P", "2": "P", "3": "P", "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN}, "Ref Table(s)": {"0": "WELL_ACTIVITY\rWELL_DRILL_PERIOD", "1": "R_SOURCE WELL_ACTIVITY", "2": "WELL_ACTIVITY", "3": "R_WELL_ACTIVITY_CAUSE", "4": NaN, "5": NaN, "6": NaN, "7": "EQUIPMENT", "8": NaN, "9": "WELL_DRILL_PERIOD", "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "UNIQUE WELL IDENTIFIER: A unique name, code or number designated as the\rprimary key for this row.", "1": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "2": "ACTIVITY OBSERVATION NUMBER: Number uniquely identifying each observation\rof an activity.", "3": "CAUSE TYPE: The type of cause that resulted in a change to the activity in the well.\rOfen, things that cause downtimes (cessation of production, constrained production\ror deferred production). Causes are usually defined hierarchically. This column may\rrefer to a cause at any level of the hierarchy.", "4": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "5": "DESCRIPTION: Narrative description about the cause for the activity, such as a\rdowntime.", "6": "EFFECTIVE DATE: The date that the data in this row first came into effect.", "7": "EQUIPMENT IDENTIFIER: Unique identifier for the piece of equipment that caused\rthe activity (either by failing or through maintenance, for example).", "8": "EXPIRY DATE: The date that the data in this row was no longer active or in effect.", "9": "WELL DRILLING PERIOD OBSERVATION NUMBER: unique identifier for a\rreporting period for well operations. Internationally, there may be 1, 2 or 3 periods\reach 24 hours. In some jurisdictions, reporting may occur for more than one period,\rsuch as for an 8 hour tour shift and a 24 daily summary.", "10": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "11": "REMARK: Narrative remarks about this row of data.", "12": "ROW CHANGED BY: Application login id of the user who last changed the row.", "13": "ROW CHANGED DATE: System date of the last time the row was changed.", "14": "ROW CREATED BY: System user who created this row of data.", "15": "ROW CREATED DATE: Date that the row was created on.", "16": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "17": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "18": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}