{"WELL_LOG_DICTIONARY": {"Column Name": {"0": "DICTIONARY_ID", "1": "ACTIVE_IND", "2": "DESCRIPTION", "3": "EFFECTIVE_DATE", "4": "EXPIRY_DATE", "5": "OWNED_BY_BA_ID", "6": "PPDM_GUID", "7": "PREFERRED_NAME", "8": "REMARK", "9": "SOURCE", "10": "VERSION_OBS_NO", "11": "ROW_CHANGED_BY", "12": "ROW_CHANGED_DATE", "13": "ROW_CREATED_BY", "14": "ROW_CREATED_DATE", "15": "ROW_EFFECTIVE_DATE", "16": "ROW_EXPIRY_DATE", "17": "ROW_QUALITY"}, "Null": {"0": "N", "1": "Y", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "VARCHAR2", "2": "VARCHAR2", "3": "DATE", "4": "DATE", "5": "VARCHAR2", "6": "VARCHAR2", "7": "VARCHAR2", "8": "VARCHAR2", "9": "VARCHAR2", "10": "NUMBER", "11": "VARCHAR2", "12": "DATE", "13": "VARCHAR2", "14": "DATE", "15": "DATE", "16": "DATE", "17": "VARCHAR2"}, "Length": {"0": "40", "1": "1", "2": "2000", "3": "DATE", "4": "DATE", "5": "40", "6": "38", "7": "255", "8": "2000", "9": "40", "10": "8", "11": "30", "12": "DATE", "13": "30", "14": "DATE", "15": "DATE", "16": "DATE", "17": "40"}, "Key": {"0": "P", "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN}, "Ref Table(s)": {"0": NaN, "1": NaN, "2": NaN, "3": NaN, "4": NaN, "5": "BUSINESS_ASSOCIATE", "6": NaN, "7": NaN, "8": NaN, "9": "R_SOURCE", "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "WELL LOG DICTIONARY: The dictionary contains a set of curve names, property\rnames and parameters that are used by a well logging contracter during a specified\rperiod of time. At any given time, a contractor may have one or more dictionaries in\ruse.", "1": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "2": "DESCRIPTION: Short narrative description about the dictionary", "3": "EFFECTIVE DATE: date on which the data in this row came into effect.", "4": "EXPIRY DATE: Date on which the data in this row of data was no longer in effect.", "5": "OWNED BY BUSINESS ASSOCIATE ID: unique identifier for the business associate\rwho owns the well log dictionary, usually a well logging company.", "6": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should be created.", "7": "PREFERRED NAME: The name this dictionary is usually known by.", "8": "REMARK: Narrative remarks about this row of data.", "9": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "10": "DICTIONARY VERSION OBSERVATION NUMBER: This column tracks the version\rnumber assigned to the dictionary by the owner. Combine with the name to get\rcomplete information about which dictionary you are dealing with.", "11": "ROW CHANGED BY: Application login id of the user who last changed the row.", "12": "ROW CHANGED DATE: System date of the last time the row was changed.", "13": "ROW CREATED BY: System user who created this row of data.", "14": "ROW CREATED DATE: Date that the row was created on.", "15": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "16": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "17": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}