{"WORK_ORDER_CONDITION": {"Column Name": {"0": "WORK_ORDER_ID", "1": "CONDITION_OBS_NO", "2": "ACTIVE_IND", "3": "BA_ROLE", "4": "BUSINESS_ASSOCIATE_ID", "5": "CONDITION_DESC", "6": "CONDITION_TYPE", "7": "CURRENCY_CONVERSION", "8": "EFFECTIVE_DATE", "9": "EXPIRY_DATE", "10": "PAYMENT_AMOUNT", "11": "PAYMENT_AMOUNT_OUOM", "12": "PAYMENT_PERCENT", "13": "PPDM_GUID", "14": "REMARK", "15": "SOURCE", "16": "WORK_ORDER_TYPE", "17": "ROW_CHANGED_BY", "18": "ROW_CHANGED_DATE", "19": "ROW_CREATED_BY", "20": "ROW_CREATED_DATE", "21": "ROW_EFFECTIVE_DATE", "22": "ROW_EXPIRY_DATE", "23": "ROW_QUALITY"}, "Null": {"0": "N", "1": "N", "2": "Y", "3": "Y", "4": "Y", "5": "Y", "6": "Y", "7": "Y", "8": "Y", "9": "Y", "10": "Y", "11": "Y", "12": "Y", "13": "Y", "14": "Y", "15": "Y", "16": "Y", "17": "Y", "18": "Y", "19": "Y", "20": "Y", "21": "Y", "22": "Y", "23": "Y"}, "Data Type": {"0": "VARCHAR2", "1": "NUMBER", "2": "VARCHAR2", "3": "VARCHAR2", "4": "VARCHAR2", "5": "VARCHAR2", "6": "VARCHAR2", "7": "NUMBER", "8": "DATE", "9": "DATE", "10": "NUMBER", "11": "VARCHAR2", "12": "NUMBER", "13": "VARCHAR2", "14": "VARCHAR2", "15": "VARCHAR2", "16": "VARCHAR2", "17": "VARCHAR2", "18": "DATE", "19": "VARCHAR2", "20": "DATE", "21": "DATE", "22": "DATE", "23": "VARCHAR2"}, "Length": {"0": "40", "1": "8", "2": "1", "3": "40", "4": "40", "5": "240", "6": "40", "7": "10,5", "8": "DATE", "9": "DATE", "10": "12,2", "11": "40", "12": "15,12", "13": "38", "14": "2000", "15": "40", "16": "40", "17": "30", "18": "DATE", "19": "30", "20": "DATE", "21": "DATE", "22": "DATE", "23": "40"}, "Key": {"0": "P", "1": "P", "2": NaN, "3": NaN, "4": NaN, "5": NaN, "6": NaN, "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": NaN, "12": NaN, "13": NaN, "14": NaN, "15": NaN, "16": NaN, "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": NaN}, "Ref Table(s)": {"0": "WORK_ORDER", "1": NaN, "2": NaN, "3": "R_WO_BA_ROLE", "4": "BUSINESS_ASSOCIATE", "5": NaN, "6": "R_WO_CONDITION", "7": NaN, "8": NaN, "9": NaN, "10": NaN, "11": "PPDM_UNIT_OF_MEASURE", "12": NaN, "13": NaN, "14": NaN, "15": "R_SOURCE", "16": "R_WO_CONDITION", "17": NaN, "18": NaN, "19": NaN, "20": NaN, "21": NaN, "22": NaN, "23": "R_PPDM_ROW_QUALITY"}, "Column Comment": {"0": "WORK ORDER IDENTIFIER: unique identifier for the work order.", "1": "CONDITION OBSERVATION NUMBER: unique observation number for the condition\rthat is required for the work order.", "2": "ACTIVE INDICATOR: A Y/N flag indicating whether this row of data is currently either\ractive / valid (Y) or inactive / invalid (N).", "3": "WORK ORDER BUSINESS ASSOCIATE ROLE: A list of valid roles played by\rbusiness associates with respect to carrying out instructions for a work order. Roles\rinclude shipping address, client etc.", "4": "BUSINESS ASSOCIATE IDENTIFIER: unique identifier for the business associate\rwho is involved with this work order as a client, service provider, intermediary etc.\rThe BA may be a company, contact name etc.", "5": "CONDITION DESCRIPTION: In necessary, an unvalidated narrative description of\rthe condition that must be met for the work order to proceed.", "6": "WORK ORDER CONDITION: Lists the pre-conditions that must exist in order for this\rwork order to be completed or filled. Can indicate a need for approval, payment, for a\rfacility to be taken off-line (for maintenance), for notification to besent out etc.", "7": "CURRENCY CONVERSION RATE: the rate applied to convert the currency from its\roriginal monetary UOM to the stored UOM. This value is valid for this row in this table\ronly. When this value is multiplied by the STORED currency value,the original value\rof the transaction in the original currency is obtained.", "8": "EFFECTIVE DATE: the date on which this row of data first came into effect from a\rbusiness perspective.", "9": "EXPIRY DATE: the date on which this row of data is no longer in effect from a\rbusiness perspective.", "10": "PAYMENT AMOUNT: the gross amount of the payment due from this BA. Note that\rfull details about the costs for the work order may be tracked in the FINANCE tables.\rIf more details about payment are required, use the OBLIGATIONS module.", "11": "ORIGINAL UNIT OF MEASURE", "12": "PERCENT OF PAYMENT: Used when the BA is a payer for the work order, to\rindicate what percent of the entire payment is due from this BA. Note that full details\rabout the payments can be obtained from the FINANCE tables.", "13": "ROW_MANAGEMENT_GUID: This value may be used to provide a global unique\ridentifier for this row of data. Use of this column is not mandatory, but if used,\roptional PPDM NOT NULL and UNIQUE INDEX constraints provided in the data\rmodel DDL should becreated.", "14": "REMARK: Narrative remarks relating to this row of data.", "15": "SOURCE: The individual, company, state, or government agency designated as the\rsource of information for this row.", "16": "WORK ORDER TYPE: the type of work order, such as data circulation, flowing hole\rremediation, brokerage etc.", "17": "ROW CHANGED BY: Application login id of the user who last changed the row.", "18": "ROW CHANGED DATE: System date of the last time the row was changed.", "19": "ROW CREATED BY: System user who created this row of data.", "20": "ROW CREATED DATE: Date that the row was created on.", "21": "ROW_EFFECTIVE_DATE: A system assigned date that specified when a row of data\ris effective from a systems perspective. This may be the date that a row of data was\rmade available to end users, for example.", "22": "ROW_EXPIRY_DATE: A system assigned date that specified when a row of data is\rno longer effective from a systems perspective. This may be the date that a row of\rdata was no longer available to end users, for example.", "23": "PPDM ROW QUALITY: A set of values indicating the quality of data in this row,\rusually with reference to the method or procedures used to load the data, although\rother types of quality reference are permitted."}}}